//=============================================================================
// Drill_AssetsOfActorAttributes.js
//=============================================================================

/*:
 * @plugindesc [v1.0]        管理器 - 素材库之角色属性
 * @author Drill_up
 * 
 * @Drill_LE_param "角色属性样式-%d"
 * @Drill_LE_parentKey "---样式组%d至%d---"
 * @Drill_LE_var "DrillUp.g_AsOAA_style_length"
 * 
 * 
 * @help  
 * =============================================================================
 * +++ Drill_AssetsOfActorAttributes +++
 * 作者：Drill_up
 * 如果你有兴趣，也可以来看看更多我写的drill插件哦ヽ(*。>Д<)o゜
 * https://rpg.blue/thread-409713-1-1.html
 * =============================================================================
 * 使得你可以将所有与"角色属性"相关的素材配置到该插件，并关联到其他子插件。
 * 
 * -----------------------------------------------------------------------------
 * ----插件扩展
 * 该插件 可以 单独使用。
 * 可被扩展：
 *   - Drill_DialogTextBigImage       窗口字符-窗口字符核心★★v2.2及以上★★
 *     有了该插件，素材库能支持指代字符。
 *   - Drill_DialogTextBigImage       窗口字符-大图片字符★★v1.5及以上★★
 *     有了该插件，素材库能支持绘制大图片字符。
 * 
 * -----------------------------------------------------------------------------
 * ----设定注意事项
 * 1.插件的作用域：战斗界面、地图界面、菜单界面。
 *   作用于地图UI、菜单面板等。
 * 2.详细内容可以去看看 "21.管理器 > 关于素材库.docx"。
 * 定义：
 *   (1.该插件的名称为 "角色属性"，固定的名词。
 *      游戏中可以称呼为其它名称，在参数中修改用语即可。
 *   (2."角色属性"还包含下面固定名词：
 *      "生命上限"、"魔法上限"、"生命数值"、"魔法数值"、
 *      "物理攻击"、"物理防御"、"魔法攻击"、"魔法防御"、
 *      "幸运"、"敏捷"、"经验"、"等级"
 * 细节：
 *   (1."Assets"是指"素材库"，作用于战斗界面、地图界面、菜单界面。
 *      素材库的意义是对某些通用的数据，只配置一次，就能应用到所有相关子插件中。
 *      而不需要每个插件都去配置一次资源素材。
 *   (2.插件中可以修改样式，效果只是给游戏默认的素材进行批量换皮。
 *      如果你希望定义多种不同的属性，建议用变量来设计。
 * 设计：
 *   (1.素材库可以换样式，你可以根据游戏剧情，设计不同机制的角色属性，
 *      章节中可能会切换主角，不同主角用不同图标或能力图片。
 * 
 * -----------------------------------------------------------------------------
 * ----关联文件
 * 资源路径：img/Assets__ActorAttribute （Assets后面有两个下划线）
 * 先确保项目img文件夹下是否有Assets__ActorAttribute文件夹。
 * 要查看所有关联资源文件的插件，可以去看看"插件清单.xlsx"。
 * 需要配置资源文件：
 * 
 * 资源-小图
 * 资源-中型图
 * 资源-高清图
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(生命上限)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[生命上限文本]
 * 窗口字符：\dtxt[生命上限文本:只图标]
 * 窗口字符：\dtxt[生命上限文本:只文本]
 * 窗口字符：\dtxt[生命上限文本:图标+文本]
 * 
 * 窗口字符：\dimg[生命上限素材:小图:不占高宽]
 * 窗口字符：\dimg[生命上限素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命上限素材:小图:占用高宽]
 * 窗口字符：\dimg[生命上限素材:中型图:不占高宽]
 * 窗口字符：\dimg[生命上限素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命上限素材:中型图:占用高宽]
 * 窗口字符：\dimg[生命上限素材:高清图:不占高宽]
 * 窗口字符：\dimg[生命上限素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命上限素材:高清图:占用高宽]
 * 窗口字符：\dimg[生命上限素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[生命上限素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命上限素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(魔法上限)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[魔法上限文本]
 * 窗口字符：\dtxt[魔法上限文本:只图标]
 * 窗口字符：\dtxt[魔法上限文本:只文本]
 * 窗口字符：\dtxt[魔法上限文本:图标+文本]
 * 
 * 窗口字符：\dimg[魔法上限素材:小图:不占高宽]
 * 窗口字符：\dimg[魔法上限素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法上限素材:小图:占用高宽]
 * 窗口字符：\dimg[魔法上限素材:中型图:不占高宽]
 * 窗口字符：\dimg[魔法上限素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法上限素材:中型图:占用高宽]
 * 窗口字符：\dimg[魔法上限素材:高清图:不占高宽]
 * 窗口字符：\dimg[魔法上限素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法上限素材:高清图:占用高宽]
 * 窗口字符：\dimg[魔法上限素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[魔法上限素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法上限素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(生命数值)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[生命数值文本]
 * 窗口字符：\dtxt[生命数值文本:只图标]
 * 窗口字符：\dtxt[生命数值文本:只文本]
 * 窗口字符：\dtxt[生命数值文本:图标+文本]
 * 
 * 窗口字符：\dimg[生命数值素材:小图:不占高宽]
 * 窗口字符：\dimg[生命数值素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命数值素材:小图:占用高宽]
 * 窗口字符：\dimg[生命数值素材:中型图:不占高宽]
 * 窗口字符：\dimg[生命数值素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命数值素材:中型图:占用高宽]
 * 窗口字符：\dimg[生命数值素材:高清图:不占高宽]
 * 窗口字符：\dimg[生命数值素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命数值素材:高清图:占用高宽]
 * 窗口字符：\dimg[生命数值素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[生命数值素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[生命数值素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(魔法数值)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[魔法数值文本]
 * 窗口字符：\dtxt[魔法数值文本:只图标]
 * 窗口字符：\dtxt[魔法数值文本:只文本]
 * 窗口字符：\dtxt[魔法数值文本:图标+文本]
 * 
 * 窗口字符：\dimg[魔法数值素材:小图:不占高宽]
 * 窗口字符：\dimg[魔法数值素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法数值素材:小图:占用高宽]
 * 窗口字符：\dimg[魔法数值素材:中型图:不占高宽]
 * 窗口字符：\dimg[魔法数值素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法数值素材:中型图:占用高宽]
 * 窗口字符：\dimg[魔法数值素材:高清图:不占高宽]
 * 窗口字符：\dimg[魔法数值素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法数值素材:高清图:占用高宽]
 * 窗口字符：\dimg[魔法数值素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[魔法数值素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法数值素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(物理攻击)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[物理攻击文本]
 * 窗口字符：\dtxt[物理攻击文本:只图标]
 * 窗口字符：\dtxt[物理攻击文本:只文本]
 * 窗口字符：\dtxt[物理攻击文本:图标+文本]
 * 
 * 窗口字符：\dimg[物理攻击素材:小图:不占高宽]
 * 窗口字符：\dimg[物理攻击素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理攻击素材:小图:占用高宽]
 * 窗口字符：\dimg[物理攻击素材:中型图:不占高宽]
 * 窗口字符：\dimg[物理攻击素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理攻击素材:中型图:占用高宽]
 * 窗口字符：\dimg[物理攻击素材:高清图:不占高宽]
 * 窗口字符：\dimg[物理攻击素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理攻击素材:高清图:占用高宽]
 * 窗口字符：\dimg[物理攻击素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[物理攻击素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理攻击素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(物理防御)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[物理防御文本]
 * 窗口字符：\dtxt[物理防御文本:只图标]
 * 窗口字符：\dtxt[物理防御文本:只文本]
 * 窗口字符：\dtxt[物理防御文本:图标+文本]
 * 
 * 窗口字符：\dimg[物理防御素材:小图:不占高宽]
 * 窗口字符：\dimg[物理防御素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理防御素材:小图:占用高宽]
 * 窗口字符：\dimg[物理防御素材:中型图:不占高宽]
 * 窗口字符：\dimg[物理防御素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理防御素材:中型图:占用高宽]
 * 窗口字符：\dimg[物理防御素材:高清图:不占高宽]
 * 窗口字符：\dimg[物理防御素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理防御素材:高清图:占用高宽]
 * 窗口字符：\dimg[物理防御素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[物理防御素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[物理防御素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(魔法攻击)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[魔法攻击文本]
 * 窗口字符：\dtxt[魔法攻击文本:只图标]
 * 窗口字符：\dtxt[魔法攻击文本:只文本]
 * 窗口字符：\dtxt[魔法攻击文本:图标+文本]
 * 
 * 窗口字符：\dimg[魔法攻击素材:小图:不占高宽]
 * 窗口字符：\dimg[魔法攻击素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法攻击素材:小图:占用高宽]
 * 窗口字符：\dimg[魔法攻击素材:中型图:不占高宽]
 * 窗口字符：\dimg[魔法攻击素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法攻击素材:中型图:占用高宽]
 * 窗口字符：\dimg[魔法攻击素材:高清图:不占高宽]
 * 窗口字符：\dimg[魔法攻击素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法攻击素材:高清图:占用高宽]
 * 窗口字符：\dimg[魔法攻击素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[魔法攻击素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法攻击素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(魔法防御)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[魔法防御文本]
 * 窗口字符：\dtxt[魔法防御文本:只图标]
 * 窗口字符：\dtxt[魔法防御文本:只文本]
 * 窗口字符：\dtxt[魔法防御文本:图标+文本]
 * 
 * 窗口字符：\dimg[魔法防御素材:小图:不占高宽]
 * 窗口字符：\dimg[魔法防御素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法防御素材:小图:占用高宽]
 * 窗口字符：\dimg[魔法防御素材:中型图:不占高宽]
 * 窗口字符：\dimg[魔法防御素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法防御素材:中型图:占用高宽]
 * 窗口字符：\dimg[魔法防御素材:高清图:不占高宽]
 * 窗口字符：\dimg[魔法防御素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法防御素材:高清图:占用高宽]
 * 窗口字符：\dimg[魔法防御素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[魔法防御素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[魔法防御素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(幸运)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[幸运文本]
 * 窗口字符：\dtxt[幸运文本:只图标]
 * 窗口字符：\dtxt[幸运文本:只文本]
 * 窗口字符：\dtxt[幸运文本:图标+文本]
 * 
 * 窗口字符：\dimg[幸运素材:小图:不占高宽]
 * 窗口字符：\dimg[幸运素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[幸运素材:小图:占用高宽]
 * 窗口字符：\dimg[幸运素材:中型图:不占高宽]
 * 窗口字符：\dimg[幸运素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[幸运素材:中型图:占用高宽]
 * 窗口字符：\dimg[幸运素材:高清图:不占高宽]
 * 窗口字符：\dimg[幸运素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[幸运素材:高清图:占用高宽]
 * 窗口字符：\dimg[幸运素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[幸运素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[幸运素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(敏捷)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[敏捷文本]
 * 窗口字符：\dtxt[敏捷文本:只图标]
 * 窗口字符：\dtxt[敏捷文本:只文本]
 * 窗口字符：\dtxt[敏捷文本:图标+文本]
 * 
 * 窗口字符：\dimg[敏捷素材:小图:不占高宽]
 * 窗口字符：\dimg[敏捷素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[敏捷素材:小图:占用高宽]
 * 窗口字符：\dimg[敏捷素材:中型图:不占高宽]
 * 窗口字符：\dimg[敏捷素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[敏捷素材:中型图:占用高宽]
 * 窗口字符：\dimg[敏捷素材:高清图:不占高宽]
 * 窗口字符：\dimg[敏捷素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[敏捷素材:高清图:占用高宽]
 * 窗口字符：\dimg[敏捷素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[敏捷素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[敏捷素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(经验)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[经验文本]
 * 窗口字符：\dtxt[经验文本:只图标]
 * 窗口字符：\dtxt[经验文本:只文本]
 * 窗口字符：\dtxt[经验文本:图标+文本]
 * 
 * 窗口字符：\dimg[经验素材:小图:不占高宽]
 * 窗口字符：\dimg[经验素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[经验素材:小图:占用高宽]
 * 窗口字符：\dimg[经验素材:中型图:不占高宽]
 * 窗口字符：\dimg[经验素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[经验素材:中型图:占用高宽]
 * 窗口字符：\dimg[经验素材:高清图:不占高宽]
 * 窗口字符：\dimg[经验素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[经验素材:高清图:占用高宽]
 * 窗口字符：\dimg[经验素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[经验素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[经验素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 窗口字符(等级)
 * 你可以使用下面的窗口字符：
 * 
 * 窗口字符：\dtxt[等级文本]
 * 窗口字符：\dtxt[等级文本:只图标]
 * 窗口字符：\dtxt[等级文本:只文本]
 * 窗口字符：\dtxt[等级文本:图标+文本]
 * 
 * 窗口字符：\dimg[等级素材:小图:不占高宽]
 * 窗口字符：\dimg[等级素材:小图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[等级素材:小图:占用高宽]
 * 窗口字符：\dimg[等级素材:中型图:不占高宽]
 * 窗口字符：\dimg[等级素材:中型图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[等级素材:中型图:占用高宽]
 * 窗口字符：\dimg[等级素材:高清图:不占高宽]
 * 窗口字符：\dimg[等级素材:高清图:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[等级素材:高清图:占用高宽]
 * 窗口字符：\dimg[等级素材:自定义[108,96]:不占高宽]
 * 窗口字符：\dimg[等级素材:自定义[108,96]:不占高宽:位置[10,-10]]
 * 窗口字符：\dimg[等级素材:自定义[108,96]:占用高宽]
 * 
 * 1.上述的窗口字符中，
 *   "\dtxt" 是指代字符，会被替换成 图标+文本 的文本格式。
 *   "\dimg" 是大图片字符，效果是绘制大图片。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 样式切换
 * 你可以通过插件指令修改样式：
 * 
 * 插件指令：>素材库之角色属性 : 修改样式 : 样式[1]
 * 插件指令：>素材库之角色属性 : 恢复默认样式
 * 
 * 1.注意，插件中可以修改样式，效果只是给游戏默认的素材进行批量换皮。
 *   如果你希望定义多种不同的属性，建议用变量来设计。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - Debug查看
 * 你可以通过插件指令打开插件的Debug查看：
 * 
 * 插件指令：>素材库之角色属性 : DEBUG资源情况测试 : 打开
 * 插件指令：>素材库之角色属性 : DEBUG资源情况测试 : 关闭
 * 
 * -----------------------------------------------------------------------------
 * ----插件性能
 * 测试仪器：   4G 内存，Intel Core i5-2520M CPU 2.5GHz 处理器
 *              Intel(R) HD Graphics 3000 集显 的垃圾笔记本
 *              (笔记本的3dmark综合分：571，鲁大师综合分：48456)
 * 总时段：     20000.00ms左右
 * 对照表：     0.00ms  - 40.00ms （几乎无消耗）
 *              40.00ms - 80.00ms （低消耗）
 *              80.00ms - 120.00ms（中消耗）
 *              120.00ms以上      （高消耗）
 * 工作类型：   单次执行
 * 时间复杂度： o(n)
 * 测试方法：   在各个界面中进行测试。
 * 测试结果：   战斗界面中，平均消耗为：【5ms以下】
 *              地图界面中，平均消耗为：【5ms以下】
 *              菜单界面中，平均消耗为：【5ms以下】
 * 
 * 1.插件只在自己作用域下工作消耗性能，在其它作用域下是不工作的。
 *   测试结果并不是精确值，范围在给定值的10ms范围内波动。
 *   更多性能介绍，去看看 "0.性能测试报告 > 关于插件性能.docx"。
 * 2.插件只单次执行，提供对应的素材数据。
 * 
 * -----------------------------------------------------------------------------
 * ----更新日志
 * [v1.0]
 * 完成插件ヽ(*。>Д<)o゜
 *
 *
 *
 * @param 是否预加载全部中型图
 * @type boolean
 * @on 预加载
 * @off 关闭
 * @desc 关闭预加载可以节省内存。若中型图未加载时，系统会用缩放的小图或图标代替。
 * @default false
 *
 * @param 是否预加载全部高清图
 * @type boolean
 * @on 预加载
 * @off 关闭
 * @desc 关闭预加载可以节省内存。若高清图未加载时，系统会用缩放的中型图、小图或图标代替。
 * @default false
 *
 *
 * @param 是否将'用语最大HP'同步为生命上限文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 最大HP" 的文本将变为当前样式的生命上限文本。
 * @default false
 *
 * @param 同步的生命上限文本格式
 * @parent 是否将'用语最大HP'同步为生命上限文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 最大HP" 的文本将变为当前样式的生命上限文本。
 * @default 图标+文本
 *
 * @param 是否将'用语最大MP'同步为魔法上限文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 最大MP" 的文本将变为当前样式的魔法上限文本。
 * @default false
 *
 * @param 同步的魔法上限文本格式
 * @parent 是否将'用语最大MP'同步为魔法上限文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 最大MP" 的文本将变为当前样式的魔法上限文本。
 * @default 图标+文本
 *
 * @param 是否将'用语攻击力'同步为物理攻击文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 攻击力" 的文本将变为当前样式的物理攻击文本。
 * @default false
 *
 * @param 同步的物理攻击文本格式
 * @parent 是否将'用语攻击力'同步为物理攻击文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 攻击力" 的文本将变为当前样式的物理攻击文本。
 * @default 图标+文本
 *
 * @param 是否将'用语防御力'同步为物理防御文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 防御力" 的文本将变为当前样式的物理防御文本。
 * @default false
 *
 * @param 同步的物理防御文本格式
 * @parent 是否将'用语防御力'同步为物理防御文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 防御力" 的文本将变为当前样式的物理防御文本。
 * @default 图标+文本
 *
 * @param 是否将'用语魔法攻击'同步为魔法攻击文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 魔法攻击" 的文本将变为当前样式的魔法攻击文本。
 * @default false
 *
 * @param 同步的魔法攻击文本格式
 * @parent 是否将'用语魔法攻击'同步为魔法攻击文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 魔法攻击" 的文本将变为当前样式的魔法攻击文本。
 * @default 图标+文本
 *
 * @param 是否将'用语魔法防御'同步为魔法防御文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 魔法防御" 的文本将变为当前样式的魔法防御文本。
 * @default false
 *
 * @param 同步的魔法防御文本格式
 * @parent 是否将'用语魔法防御'同步为魔法防御文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 魔法防御" 的文本将变为当前样式的魔法防御文本。
 * @default 图标+文本
 *
 * @param 是否将'用语敏捷'同步为敏捷文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 敏捷" 的文本将变为当前样式的敏捷文本。
 * @default false
 *
 * @param 同步的敏捷文本格式
 * @parent 是否将'用语敏捷'同步为敏捷文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 敏捷" 的文本将变为当前样式的敏捷文本。
 * @default 图标+文本
 *
 * @param 是否将'用语幸运'同步为幸运文本
 * @type boolean
 * @on 同步
 * @off 不操作
 * @desc true - 同步，false - 不操作。"数据库 > 用语 > 幸运" 的文本将变为当前样式的幸运文本。
 * @default false
 *
 * @param 同步的幸运文本格式
 * @parent 是否将'用语幸运'同步为幸运文本
 * @type select
 * @option 只图标
 * @value 只图标
 * @option 只文本
 * @value 只文本
 * @option 图标+文本
 * @value 图标+文本
 * @desc "数据库 > 用语 > 幸运" 的文本将变为当前样式的幸运文本。
 * @default 图标+文本
 *
 *
 * @param 默认角色属性样式
 * @type number
 * @min 1
 * @desc 默认的角色属性样式。
 * @default 1
 * 
 * @param ---角色属性样式组---
 * @default 
 * 
 * @param 角色属性样式-1
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default {"标签":"==标准角色属性素材==","---生命上限---":"","用语-生命上限文本":"生命上限","用语-生命上限文本颜色":"0","生命上限图标":"505","生命上限资源-小图":"生命上限_64x64小图","生命上限资源-中型图":"生命上限_96x96中型图","生命上限资源-高清图":"生命上限_256x256高清图","---魔法上限---":"","用语-魔法上限文本":"魔法上限","用语-魔法上限文本颜色":"0","魔法上限图标":"521","魔法上限资源-小图":"魔法上限_64x64小图","魔法上限资源-中型图":"魔法上限_96x96中型图","魔法上限资源-高清图":"魔法上限_256x256高清图","---生命数值---":"","用语-生命数值文本":"生命值","用语-生命数值文本颜色":"0","生命数值图标":"504","生命数值资源-小图":"生命数值_64x64小图","生命数值资源-中型图":"生命数值_96x96中型图","生命数值资源-高清图":"生命数值_256x256高清图","---魔法数值---":"","用语-魔法数值文本":"魔法值","用语-魔法数值文本颜色":"0","魔法数值图标":"520","魔法数值资源-小图":"魔法数值_64x64小图","魔法数值资源-中型图":"魔法数值_96x96中型图","魔法数值资源-高清图":"魔法数值_256x256高清图","---物理攻击---":"","用语-物理攻击文本":"物理攻击","用语-物理攻击文本颜色":"0","物理攻击图标":"506","物理攻击资源-小图":"物理攻击_64x64小图","物理攻击资源-中型图":"物理攻击_96x96中型图","物理攻击资源-高清图":"物理攻击_256x256高清图","---物理防御---":"","用语-物理防御文本":"物理防御","用语-物理防御文本颜色":"0","物理防御图标":"507","物理防御资源-小图":"物理防御_64x64小图","物理防御资源-中型图":"物理防御_96x96中型图","物理防御资源-高清图":"物理防御_256x256高清图","---魔法攻击---":"","用语-魔法攻击文本":"魔法攻击","用语-魔法攻击文本颜色":"0","魔法攻击图标":"522","魔法攻击资源-小图":"魔法攻击_64x64小图","魔法攻击资源-中型图":"魔法攻击_96x96中型图","魔法攻击资源-高清图":"魔法攻击_256x256高清图","---魔法防御---":"","用语-魔法防御文本":"魔法防御","用语-魔法防御文本颜色":"0","魔法防御图标":"523","魔法防御资源-小图":"魔法防御_64x64小图","魔法防御资源-中型图":"魔法防御_96x96中型图","魔法防御资源-高清图":"魔法防御_256x256高清图","---幸运---":"","用语-幸运文本":"幸运","用语-幸运文本颜色":"0","幸运图标":"508","幸运资源-小图":"幸运_64x64小图","幸运资源-中型图":"幸运_96x96中型图","幸运资源-高清图":"幸运_256x256高清图","---敏捷---":"","用语-敏捷文本":"敏捷","用语-敏捷文本颜色":"0","敏捷图标":"524","敏捷资源-小图":"敏捷_64x64小图","敏捷资源-中型图":"敏捷_96x96中型图","敏捷资源-高清图":"敏捷_256x256高清图","---经验---":"","用语-经验文本":"经验","用语-经验文本颜色":"0","经验图标":"509","经验资源-小图":"经验_64x64小图","经验资源-中型图":"经验_96x96中型图","经验资源-高清图":"经验_256x256高清图","---等级---":"","用语-等级文本":"等级","用语-等级文本颜色":"0","等级图标":"525","等级资源-小图":"等级_64x64小图","等级资源-中型图":"等级_96x96中型图","等级资源-高清图":"等级_256x256高清图"}
 *
 * @param 角色属性样式-2
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-3
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-4
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-5
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-6
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-7
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-8
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-9
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 * @param 角色属性样式-10
 * @parent ---角色属性样式组---
 * @type struct<DrillAsOAAStyle>
 * @desc 漂浮文字的内容配置信息。
 * @default 
 * 
 */
/*~struct~DrillAsOAAStyle:
 * 
 * @param 标签
 * @desc 只用于方便区分查看的标签，不作用在插件中。
 * @default ==新的角色属性样式==
 * 
 * 
 * @param ---生命上限---
 * @default 
 * 
 * @param 用语-生命上限文本
 * @parent ---生命上限---
 * @desc 生命上限的用语文本。
 * @default 生命上限
 *
 * @param 用语-生命上限文本颜色
 * @parent ---生命上限---
 * @type number
 * @min 0
 * @desc 生命上限文本的颜色。
 * @default 0
 *
 * @param 生命上限图标
 * @parent ---生命上限---
 * @type number
 * @min 0
 * @desc 生命上限的图标序号。
 * @default 505
 * 
 * @param 生命上限资源-小图
 * @parent ---生命上限---
 * @desc 生命上限作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)生命上限资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 生命上限资源-中型图
 * @parent ---生命上限---
 * @desc 生命上限作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)生命上限资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 生命上限资源-高清图
 * @parent ---生命上限---
 * @desc 生命上限作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)生命上限资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---魔法上限---
 * @default 
 * 
 * @param 用语-魔法上限文本
 * @parent ---魔法上限---
 * @desc 魔法上限的用语文本。
 * @default 魔法上限
 *
 * @param 用语-魔法上限文本颜色
 * @parent ---魔法上限---
 * @type number
 * @min 0
 * @desc 魔法上限文本的颜色。
 * @default 0
 *
 * @param 魔法上限图标
 * @parent ---魔法上限---
 * @type number
 * @min 0
 * @desc 魔法上限的图标序号。
 * @default 521
 * 
 * @param 魔法上限资源-小图
 * @parent ---魔法上限---
 * @desc 魔法上限作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)魔法上限资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法上限资源-中型图
 * @parent ---魔法上限---
 * @desc 魔法上限作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)魔法上限资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法上限资源-高清图
 * @parent ---魔法上限---
 * @desc 魔法上限作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)魔法上限资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---生命数值---
 * @default 
 * 
 * @param 用语-生命数值文本
 * @parent ---生命数值---
 * @desc 生命数值的用语文本。
 * @default 生命数值
 *
 * @param 用语-生命数值文本颜色
 * @parent ---生命数值---
 * @type number
 * @min 0
 * @desc 生命数值文本的颜色。
 * @default 0
 *
 * @param 生命数值图标
 * @parent ---生命数值---
 * @type number
 * @min 0
 * @desc 生命数值的图标序号。
 * @default 504
 * 
 * @param 生命数值资源-小图
 * @parent ---生命数值---
 * @desc 生命数值作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)生命数值资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 生命数值资源-中型图
 * @parent ---生命数值---
 * @desc 生命数值作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)生命数值资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 生命数值资源-高清图
 * @parent ---生命数值---
 * @desc 生命数值作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)生命数值资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---魔法数值---
 * @default 
 * 
 * @param 用语-魔法数值文本
 * @parent ---魔法数值---
 * @desc 魔法数值的用语文本。
 * @default 魔法数值
 *
 * @param 用语-魔法数值文本颜色
 * @parent ---魔法数值---
 * @type number
 * @min 0
 * @desc 魔法数值文本的颜色。
 * @default 0
 *
 * @param 魔法数值图标
 * @parent ---魔法数值---
 * @type number
 * @min 0
 * @desc 魔法数值的图标序号。
 * @default 520
 * 
 * @param 魔法数值资源-小图
 * @parent ---魔法数值---
 * @desc 魔法数值作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)魔法数值资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法数值资源-中型图
 * @parent ---魔法数值---
 * @desc 魔法数值作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)魔法数值资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法数值资源-高清图
 * @parent ---魔法数值---
 * @desc 魔法数值作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)魔法数值资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---物理攻击---
 * @default 
 * 
 * @param 用语-物理攻击文本
 * @parent ---物理攻击---
 * @desc 物理攻击的用语文本。
 * @default 物理攻击
 *
 * @param 用语-物理攻击文本颜色
 * @parent ---物理攻击---
 * @type number
 * @min 0
 * @desc 物理攻击文本的颜色。
 * @default 0
 *
 * @param 物理攻击图标
 * @parent ---物理攻击---
 * @type number
 * @min 0
 * @desc 物理攻击的图标序号。
 * @default 506
 * 
 * @param 物理攻击资源-小图
 * @parent ---物理攻击---
 * @desc 物理攻击作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)物理攻击资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 物理攻击资源-中型图
 * @parent ---物理攻击---
 * @desc 物理攻击作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)物理攻击资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 物理攻击资源-高清图
 * @parent ---物理攻击---
 * @desc 物理攻击作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)物理攻击资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---物理防御---
 * @default 
 * 
 * @param 用语-物理防御文本
 * @parent ---物理防御---
 * @desc 物理防御的用语文本。
 * @default 物理防御
 *
 * @param 用语-物理防御文本颜色
 * @parent ---物理防御---
 * @type number
 * @min 0
 * @desc 物理防御文本的颜色。
 * @default 0
 *
 * @param 物理防御图标
 * @parent ---物理防御---
 * @type number
 * @min 0
 * @desc 物理防御的图标序号。
 * @default 507
 * 
 * @param 物理防御资源-小图
 * @parent ---物理防御---
 * @desc 物理防御作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)物理防御资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 物理防御资源-中型图
 * @parent ---物理防御---
 * @desc 物理防御作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)物理防御资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 物理防御资源-高清图
 * @parent ---物理防御---
 * @desc 物理防御作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)物理防御资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---魔法攻击---
 * @default 
 * 
 * @param 用语-魔法攻击文本
 * @parent ---魔法攻击---
 * @desc 魔法攻击的用语文本。
 * @default 魔法攻击
 *
 * @param 用语-魔法攻击文本颜色
 * @parent ---魔法攻击---
 * @type number
 * @min 0
 * @desc 魔法攻击文本的颜色。
 * @default 0
 *
 * @param 魔法攻击图标
 * @parent ---魔法攻击---
 * @type number
 * @min 0
 * @desc 魔法攻击的图标序号。
 * @default 522
 * 
 * @param 魔法攻击资源-小图
 * @parent ---魔法攻击---
 * @desc 魔法攻击作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)魔法攻击资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法攻击资源-中型图
 * @parent ---魔法攻击---
 * @desc 魔法攻击作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)魔法攻击资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法攻击资源-高清图
 * @parent ---魔法攻击---
 * @desc 魔法攻击作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)魔法攻击资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---魔法防御---
 * @default 
 * 
 * @param 用语-魔法防御文本
 * @parent ---魔法防御---
 * @desc 魔法防御的用语文本。
 * @default 魔法防御
 *
 * @param 用语-魔法防御文本颜色
 * @parent ---魔法防御---
 * @type number
 * @min 0
 * @desc 魔法防御文本的颜色。
 * @default 0
 *
 * @param 魔法防御图标
 * @parent ---魔法防御---
 * @type number
 * @min 0
 * @desc 魔法防御的图标序号。
 * @default 523
 * 
 * @param 魔法防御资源-小图
 * @parent ---魔法防御---
 * @desc 魔法防御作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)魔法防御资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法防御资源-中型图
 * @parent ---魔法防御---
 * @desc 魔法防御作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)魔法防御资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 魔法防御资源-高清图
 * @parent ---魔法防御---
 * @desc 魔法防御作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)魔法防御资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---幸运---
 * @default 
 * 
 * @param 用语-幸运文本
 * @parent ---幸运---
 * @desc 幸运的用语文本。
 * @default 幸运
 *
 * @param 用语-幸运文本颜色
 * @parent ---幸运---
 * @type number
 * @min 0
 * @desc 幸运文本的颜色。
 * @default 0
 *
 * @param 幸运图标
 * @parent ---幸运---
 * @type number
 * @min 0
 * @desc 幸运的图标序号。
 * @default 508
 * 
 * @param 幸运资源-小图
 * @parent ---幸运---
 * @desc 幸运作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)幸运资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 幸运资源-中型图
 * @parent ---幸运---
 * @desc 幸运作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)幸运资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 幸运资源-高清图
 * @parent ---幸运---
 * @desc 幸运作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)幸运资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---敏捷---
 * @default 
 * 
 * @param 用语-敏捷文本
 * @parent ---敏捷---
 * @desc 敏捷的用语文本。
 * @default 敏捷
 *
 * @param 用语-敏捷文本颜色
 * @parent ---敏捷---
 * @type number
 * @min 0
 * @desc 敏捷文本的颜色。
 * @default 0
 *
 * @param 敏捷图标
 * @parent ---敏捷---
 * @type number
 * @min 0
 * @desc 敏捷的图标序号。
 * @default 524
 * 
 * @param 敏捷资源-小图
 * @parent ---敏捷---
 * @desc 敏捷作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)敏捷资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 敏捷资源-中型图
 * @parent ---敏捷---
 * @desc 敏捷作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)敏捷资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 敏捷资源-高清图
 * @parent ---敏捷---
 * @desc 敏捷作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)敏捷资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---经验---
 * @default 
 * 
 * @param 用语-经验文本
 * @parent ---经验---
 * @desc 经验的用语文本。
 * @default 经验
 *
 * @param 用语-经验文本颜色
 * @parent ---经验---
 * @type number
 * @min 0
 * @desc 经验文本的颜色。
 * @default 0
 *
 * @param 经验图标
 * @parent ---经验---
 * @type number
 * @min 0
 * @desc 经验的图标序号。
 * @default 509
 * 
 * @param 经验资源-小图
 * @parent ---经验---
 * @desc 经验作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)经验资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 经验资源-中型图
 * @parent ---经验---
 * @desc 经验作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)经验资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 经验资源-高清图
 * @parent ---经验---
 * @desc 经验作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)经验资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 * 
 * @param ---等级---
 * @default 
 * 
 * @param 用语-等级文本
 * @parent ---等级---
 * @desc 等级的用语文本。
 * @default 等级
 *
 * @param 用语-等级文本颜色
 * @parent ---等级---
 * @type number
 * @min 0
 * @desc 等级文本的颜色。
 * @default 0
 *
 * @param 等级图标
 * @parent ---等级---
 * @type number
 * @min 0
 * @desc 等级的图标序号。
 * @default 525
 * 
 * @param 等级资源-小图
 * @parent ---等级---
 * @desc 等级作为小图时的资源，大小为64x64，建议该资源背景为透明。
 * @default (需配置)等级资源-小图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 等级资源-中型图
 * @parent ---等级---
 * @desc 等级作为中型图时的资源，大小为96x96，建议该资源背景为透明。
 * @default (需配置)等级资源-中型图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 *
 * @param 等级资源-高清图
 * @parent ---等级---
 * @desc 等级作为高清图时的资源，大小为256x256，建议该资源背景为透明。
 * @default (需配置)等级资源-高清图
 * @require 1
 * @dir img/Assets__ActorAttribute/
 * @type file
 * 
 */
 
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//		插件简称		AsOAA (Assets_Of_Actor_Attributes)
//		临时全局变量	DrillUp.g_AsOAA_xxx
//		临时局部变量	this._drill_AsOAA_xxx
//		存储数据变量	无
//		全局存储变量	无
//		覆盖重写方法	无
//
//<<<<<<<<性能记录<<<<<<<<
//
//		★工作类型		单次执行
//		★时间复杂度		o(n)
//		★性能测试因素	
//		★性能测试消耗	
//		★最坏情况		暂无
//		★备注			暂无
//		
//		★优化记录		暂无
//
//<<<<<<<<插件记录<<<<<<<<
//
//		★功能结构树：
//			->☆提示信息
//			->☆静态数据
//			->☆插件指令
//			->☆存储数据
//			->☆预加载
//			
//			
//			->☆素材库的样式
//				->样式变化（子插件继承用）
//			
//			->☆素材库的窗口字符 标准模块
//				->生命上限（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->魔法上限（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->生命数值（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->魔法数值（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->物理攻击（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->物理防御（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->魔法攻击（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->魔法防御（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->幸运（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->敏捷（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->经验（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//				->等级（文本/文本颜色索引/图标索引/完整文本） - 获取【标准函数】
//			->☆素材库的窗口字符实现
//			
//			->☆素材库的资源 标准模块
//				->生命上限（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->魔法上限（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->生命数值（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->魔法数值（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->物理攻击（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->物理防御（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->魔法攻击（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->魔法防御（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->幸运（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->敏捷（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->经验（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//				->等级（图标/小图/中型图/高清图/自定义） - 获取【标准函数】
//			->☆素材库的资源实现
//			
//			->☆窗口字符应用之指代字符
//				> \dtxt[生命上限文本:……]
//				> \dtxt[魔法上限文本:……]
//				> \dtxt[生命数值文本:……]
//				> \dtxt[魔法数值文本:……]
//				> \dtxt[物理攻击文本:……]
//				> \dtxt[物理防御文本:……]
//				> \dtxt[魔法攻击文本:……]
//				> \dtxt[魔法防御文本:……]
//				> \dtxt[幸运文本:……]
//				> \dtxt[敏捷文本:……]
//				> \dtxt[经验文本:……]
//				> \dtxt[等级文本:……]
//			->☆窗口字符应用之效果字符
//				> \dimg[生命上限素材:……]
//				> \dimg[魔法上限素材:……]
//				> \dimg[生命数值素材:……]
//				> \dimg[魔法数值素材:……]
//				> \dimg[物理攻击素材:……]
//				> \dimg[物理防御素材:……]
//				> \dimg[魔法攻击素材:……]
//				> \dimg[魔法防御素材:……]
//				> \dimg[幸运素材:……]
//				> \dimg[敏捷素材:……]
//				> \dimg[经验素材:……]
//				> \dimg[等级素材:……]
//			
//			->☆用语管理器覆盖
//			
//			
//			->☆DEBUG资源情况测试
//			
//			
//		★家谱：
//			无
//			
//		★脚本文档：
//			无
//		
//		★插件私有类：
//			无
//			
//		★必要注意事项：
//			1. 2025/12/18 这是一个因为素材提前画好了，但是要着急出来用的插件。
//				  ╭━━━━━━━━━━━╮
//				  ┃╱╱╱╱╱╱┏━━┓╱┃
//				  ┃╱╱┏┓╱╱╰━╮┃╱┃
//				  ┃╱┏┛┗┓╱┏━╯┃╱┃
//				  ┃╱┗┓┏┛╱┃╭━╯╱┃
//				  ┃╱╱┗┛╱╱┃╰━╮╱┃
//				  ┃╱╱╱╱╱╱┗━━┛╱┃
//				  ╰━━━━━━━━━━━╯
//			2.该插件的格式和 隔壁素材库的插件 一模一样，具体去看那个+1的插件。
//			  有介绍『素材库批量复制方法』。
//
//		★其它说明细节：
//			1.文档中规定 小图和图标 必须配置一个，但这里不检查，因为找不到时函数会给个空图片，并不会报错。
//
//		★存在的问题：
//			暂无
//

//=============================================================================
// ** ☆提示信息
//=============================================================================
	//==============================
	// * 提示信息 - 参数
	//==============================
	var DrillUp = DrillUp || {}; 
	DrillUp.g_AsOAA_PluginTip_curName = "Drill_AssetsOfActorAttributes.js 管理器-素材库之角色属性";
	DrillUp.g_AsOAA_PluginTip_baseList = [];
	//==============================
	// * 提示信息 - 报错 - 底层版本过低
	//==============================
	DrillUp.drill_AsOAA_getPluginTip_LowVersion = function(){
		return "【" + DrillUp.g_AsOAA_PluginTip_curName + "】\n游戏底层版本过低，插件基本功能无法执行。\n你可以去看\"rmmv软件版本（必看）.docx\"中的 \"旧工程升级至1.6版本\" 章节，来升级你的游戏底层版本。";
	};
	
	
//=============================================================================
// ** ☆静态数据
//=============================================================================
	var Imported = Imported || {};
	Imported.Drill_AssetsOfActorAttributes = true;
	var DrillUp = DrillUp || {}; 
	DrillUp.parameters = PluginManager.parameters('Drill_AssetsOfActorAttributes');
	
	
	//==============================
	// * 静态数据 - 角色属性样式
	//				（~struct~DrillAsOAAStyle）
	//==============================
	DrillUp.drill_AsOAA_initStyle = function( dataFrom ){
		var data = {};
		
		// > 生命上限文本
		data['maxHP_text'] = String( dataFrom["用语-生命上限文本"] || "生命上限");
		data['maxHP_textColor'] = Number( dataFrom["用语-生命上限文本颜色"] || 17);
		data['maxHP_iconIndex'] = Number( dataFrom["生命上限图标"] || 504);
		// > 生命上限素材
		data['maxHP_src_img_64x64'] = String( dataFrom["生命上限资源-小图"] || "");
		data['maxHP_src_img_96x96'] = String( dataFrom["生命上限资源-中型图"] || "");
		data['maxHP_src_img_256x256'] = String( dataFrom["生命上限资源-高清图"] || "");
		
		// > 魔法上限文本
		data['maxMP_text'] = String( dataFrom["用语-魔法上限文本"] || "魔法上限");
		data['maxMP_textColor'] = Number( dataFrom["用语-魔法上限文本颜色"] || 17);
		data['maxMP_iconIndex'] = Number( dataFrom["魔法上限图标"] || 520);
		// > 魔法上限素材
		data['maxMP_src_img_64x64'] = String( dataFrom["魔法上限资源-小图"] || "");
		data['maxMP_src_img_96x96'] = String( dataFrom["魔法上限资源-中型图"] || "");
		data['maxMP_src_img_256x256'] = String( dataFrom["魔法上限资源-高清图"] || "");
		
		// > 生命数值文本
		data['curHP_text'] = String( dataFrom["用语-生命数值文本"] || "生命数值");
		data['curHP_textColor'] = Number( dataFrom["用语-生命数值文本颜色"] || 17);
		data['curHP_iconIndex'] = Number( dataFrom["生命数值图标"] || 504);
		// > 生命数值素材
		data['curHP_src_img_64x64'] = String( dataFrom["生命数值资源-小图"] || "");
		data['curHP_src_img_96x96'] = String( dataFrom["生命数值资源-中型图"] || "");
		data['curHP_src_img_256x256'] = String( dataFrom["生命数值资源-高清图"] || "");
		
		// > 魔法数值文本
		data['curMP_text'] = String( dataFrom["用语-魔法数值文本"] || "魔法数值");
		data['curMP_textColor'] = Number( dataFrom["用语-魔法数值文本颜色"] || 17);
		data['curMP_iconIndex'] = Number( dataFrom["魔法数值图标"] || 504);
		// > 魔法数值素材
		data['curMP_src_img_64x64'] = String( dataFrom["魔法数值资源-小图"] || "");
		data['curMP_src_img_96x96'] = String( dataFrom["魔法数值资源-中型图"] || "");
		data['curMP_src_img_256x256'] = String( dataFrom["魔法数值资源-高清图"] || "");
		
		// > 物理攻击文本
		data['atk_text'] = String( dataFrom["用语-物理攻击文本"] || "物理攻击");
		data['atk_textColor'] = Number( dataFrom["用语-物理攻击文本颜色"] || 17);
		data['atk_iconIndex'] = Number( dataFrom["物理攻击图标"] || 504);
		// > 物理攻击素材
		data['atk_src_img_64x64'] = String( dataFrom["物理攻击资源-小图"] || "");
		data['atk_src_img_96x96'] = String( dataFrom["物理攻击资源-中型图"] || "");
		data['atk_src_img_256x256'] = String( dataFrom["物理攻击资源-高清图"] || "");
		
		// > 物理防御文本
		data['def_text'] = String( dataFrom["用语-物理防御文本"] || "物理防御");
		data['def_textColor'] = Number( dataFrom["用语-物理防御文本颜色"] || 17);
		data['def_iconIndex'] = Number( dataFrom["物理防御图标"] || 504);
		// > 物理防御素材
		data['def_src_img_64x64'] = String( dataFrom["物理防御资源-小图"] || "");
		data['def_src_img_96x96'] = String( dataFrom["物理防御资源-中型图"] || "");
		data['def_src_img_256x256'] = String( dataFrom["物理防御资源-高清图"] || "");
		
		// > 魔法攻击文本
		data['mat_text'] = String( dataFrom["用语-魔法攻击文本"] || "魔法攻击");
		data['mat_textColor'] = Number( dataFrom["用语-魔法攻击文本颜色"] || 17);
		data['mat_iconIndex'] = Number( dataFrom["魔法攻击图标"] || 504);
		// > 魔法攻击素材
		data['mat_src_img_64x64'] = String( dataFrom["魔法攻击资源-小图"] || "");
		data['mat_src_img_96x96'] = String( dataFrom["魔法攻击资源-中型图"] || "");
		data['mat_src_img_256x256'] = String( dataFrom["魔法攻击资源-高清图"] || "");
		
		// > 魔法防御文本
		data['mdf_text'] = String( dataFrom["用语-魔法防御文本"] || "魔法防御");
		data['mdf_textColor'] = Number( dataFrom["用语-魔法防御文本颜色"] || 17);
		data['mdf_iconIndex'] = Number( dataFrom["魔法防御图标"] || 504);
		// > 魔法防御素材
		data['mdf_src_img_64x64'] = String( dataFrom["魔法防御资源-小图"] || "");
		data['mdf_src_img_96x96'] = String( dataFrom["魔法防御资源-中型图"] || "");
		data['mdf_src_img_256x256'] = String( dataFrom["魔法防御资源-高清图"] || "");
		
		// > 幸运文本
		data['luk_text'] = String( dataFrom["用语-幸运文本"] || "幸运");
		data['luk_textColor'] = Number( dataFrom["用语-幸运文本颜色"] || 17);
		data['luk_iconIndex'] = Number( dataFrom["幸运图标"] || 504);
		// > 幸运素材
		data['luk_src_img_64x64'] = String( dataFrom["幸运资源-小图"] || "");
		data['luk_src_img_96x96'] = String( dataFrom["幸运资源-中型图"] || "");
		data['luk_src_img_256x256'] = String( dataFrom["幸运资源-高清图"] || "");
		
		// > 敏捷文本
		data['agi_text'] = String( dataFrom["用语-敏捷文本"] || "敏捷");
		data['agi_textColor'] = Number( dataFrom["用语-敏捷文本颜色"] || 17);
		data['agi_iconIndex'] = Number( dataFrom["敏捷图标"] || 504);
		// > 敏捷素材
		data['agi_src_img_64x64'] = String( dataFrom["敏捷资源-小图"] || "");
		data['agi_src_img_96x96'] = String( dataFrom["敏捷资源-中型图"] || "");
		data['agi_src_img_256x256'] = String( dataFrom["敏捷资源-高清图"] || "");
		
		// > 经验文本
		data['exp_text'] = String( dataFrom["用语-经验文本"] || "经验");
		data['exp_textColor'] = Number( dataFrom["用语-经验文本颜色"] || 17);
		data['exp_iconIndex'] = Number( dataFrom["经验图标"] || 504);
		// > 经验素材
		data['exp_src_img_64x64'] = String( dataFrom["经验资源-小图"] || "");
		data['exp_src_img_96x96'] = String( dataFrom["经验资源-中型图"] || "");
		data['exp_src_img_256x256'] = String( dataFrom["经验资源-高清图"] || "");
		
		// > 等级文本
		data['level_text'] = String( dataFrom["用语-等级文本"] || "等级");
		data['level_textColor'] = Number( dataFrom["用语-等级文本颜色"] || 17);
		data['level_iconIndex'] = Number( dataFrom["等级图标"] || 504);
		// > 等级素材
		data['level_src_img_64x64'] = String( dataFrom["等级资源-小图"] || "");
		data['level_src_img_96x96'] = String( dataFrom["等级资源-中型图"] || "");
		data['level_src_img_256x256'] = String( dataFrom["等级资源-高清图"] || "");
		
		return data;
	}
	/*-----------------角色属性样式集合------------------*/
	DrillUp.g_AsOAA_style_length = 10;
	DrillUp.g_AsOAA_style = [];
	for( var i = 0; i < DrillUp.g_AsOAA_style_length; i++ ){
		if( DrillUp.parameters["角色属性样式-" + String(i+1) ] != undefined &&
			DrillUp.parameters["角色属性样式-" + String(i+1) ] != "" ){
			var temp = JSON.parse(DrillUp.parameters["角色属性样式-" + String(i+1) ]);
			DrillUp.g_AsOAA_style[i] = DrillUp.drill_AsOAA_initStyle( temp );
		}else{
			DrillUp.g_AsOAA_style[i] = DrillUp.drill_AsOAA_initStyle( {} );
		}
	}
	
	
	/*-----------------杂项------------------*/
	DrillUp.g_AsOAA_defaultStyleId = Number(DrillUp.parameters["默认角色属性样式"] || 1); 
	DrillUp.g_AsOAA_preload96x96Enabled = String(DrillUp.parameters["是否预加载全部中型图"] || "false") == "true";
	DrillUp.g_AsOAA_preload256x256Enabled = String(DrillUp.parameters["是否预加载全部高清图"] || "false") == "true";
	
	DrillUp.g_AsOAA_coverEnabled_maxHP = String(DrillUp.parameters["是否将'用语最大HP'同步为生命上限文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_maxHP = String(DrillUp.parameters["同步的生命上限文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_maxMP = String(DrillUp.parameters["是否将'用语最大MP'同步为魔法上限文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_maxMP = String(DrillUp.parameters["同步的魔法上限文本格式"] || "只文本");
	//	生命数值文本（无）
	//	魔法数值文本（无）
	DrillUp.g_AsOAA_coverEnabled_atk = String(DrillUp.parameters["是否将'用语攻击力'同步为物理攻击文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_atk = String(DrillUp.parameters["同步的物理攻击文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_def = String(DrillUp.parameters["是否将'用语防御力'同步为物理防御文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_def = String(DrillUp.parameters["同步的物理防御文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_mat = String(DrillUp.parameters["是否将'用语魔法攻击'同步为魔法攻击文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_mat = String(DrillUp.parameters["同步的魔法攻击文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_mdf = String(DrillUp.parameters["是否将'用语魔法防御'同步为魔法防御文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_mdf = String(DrillUp.parameters["同步的魔法防御文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_luk = String(DrillUp.parameters["是否将'用语敏捷'同步为敏捷文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_luk = String(DrillUp.parameters["同步的敏捷文本格式"] || "只文本");
	DrillUp.g_AsOAA_coverEnabled_agi = String(DrillUp.parameters["是否将'用语幸运'同步为幸运文本"] || "false") == "true";
	DrillUp.g_AsOAA_coverFormat_agi = String(DrillUp.parameters["同步的幸运文本格式"] || "只文本");
	//	经验文本（无）
	//	等级文本（无）
	
	
	
//=============================================================================
// ** ☆插件指令
//=============================================================================
//==============================
// * 插件指令 - 指令绑定
//==============================
var _drill_AsOAA_pluginCommand = Game_Interpreter.prototype.pluginCommand
Game_Interpreter.prototype.pluginCommand = function( command, args ){
	_drill_AsOAA_pluginCommand.call(this, command, args);
	this.drill_AsOAA_pluginCommand( command, args );
}
//==============================
// * 插件指令 - 指令执行
//==============================
Game_Interpreter.prototype.drill_AsOAA_pluginCommand = function( command, args ){
	if( command === ">素材库之角色属性" ){
		
		/*-----------------修改样式------------------*/
		if( args.length == 4 ){
			var type = String(args[1]);
			var temp1 = String(args[3]);
			if( type == "修改样式" ){
				temp1 = temp1.replace("样式[","");
				temp1 = temp1.replace("]","");
				$gameSystem.drill_AsOAA_setStyleData( Number(temp1) );
			}
		}
		if( args.length == 2 ){
			var type = String(args[1]);
			if( type == "恢复默认样式" ){
				$gameSystem.drill_AsOAA_setStyleData( DrillUp.g_AsOAA_defaultStyleId );
			}
		}
		
		/*-----------------DEBUG------------------*/
		if( args.length == 4 ){
			var type = String(args[1]);
			var temp1 = String(args[3]);
			if( type == "DEBUG资源情况测试" ){
				if( temp1 == "启用" || temp1 == "开启" || temp1 == "打开" || temp1 == "启动" ){
					$gameTemp._drill_AsOAA_DebugEnabled = true;
				}
				if( temp1 == "关闭" || temp1 == "禁用" ){
					$gameTemp._drill_AsOAA_DebugEnabled = false;
				}
			}
		}
	};
};


//#############################################################################
// ** 【标准模块】存储数据 ☆存储数据
//#############################################################################
//##############################
// * 存储数据 - 参数存储 开关
//          
//			说明：	> 如果该插件开放了用户可以修改的参数，就注释掉。
//##############################
DrillUp.g_AsOAA_saveEnabled = true;
//##############################
// * 存储数据 - 初始化
//          
//			说明：	> 下方为固定写法，不要动。
//##############################
var _drill_AsOAA_sys_initialize = Game_System.prototype.initialize;
Game_System.prototype.initialize = function() {
    _drill_AsOAA_sys_initialize.call(this);
	this.drill_AsOAA_initSysData();
};
//##############################
// * 存储数据 - 载入存档
//          
//			说明：	> 下方为固定写法，不要动。
//##############################
var _drill_AsOAA_sys_extractSaveContents = DataManager.extractSaveContents;
DataManager.extractSaveContents = function( contents ){
	_drill_AsOAA_sys_extractSaveContents.call( this, contents );
	
	// > 参数存储 启用时（检查数据）
	if( DrillUp.g_AsOAA_saveEnabled == true ){	
		$gameSystem.drill_AsOAA_checkSysData();
		
	// > 参数存储 关闭时（直接覆盖）
	}else{
		$gameSystem.drill_AsOAA_initSysData();
	}
};
//##############################
// * 存储数据 - 初始化数据【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，执行数据初始化，并存入存档数据中。
//##############################
Game_System.prototype.drill_AsOAA_initSysData = function() {
	this.drill_AsOAA_initSysData_Private();
};
//##############################
// * 存储数据 - 载入存档时检查数据【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，载入存档时执行的数据检查操作。
//##############################
Game_System.prototype.drill_AsOAA_checkSysData = function() {
	this.drill_AsOAA_checkSysData_Private();
};
//=============================================================================
// ** 存储数据（接口实现）
//=============================================================================
//==============================
// * 存储数据 - 初始化数据（私有）
//==============================
Game_System.prototype.drill_AsOAA_initSysData_Private = function() {
	
	this._drill_AsOAA_styleId = DrillUp.g_AsOAA_defaultStyleId;
};
//==============================
// * 存储数据 - 载入存档时检查数据（私有）
//==============================
Game_System.prototype.drill_AsOAA_checkSysData_Private = function() {
	
	// > 旧存档数据自动补充
	if( this._drill_AsOAA_styleId == undefined ){
		this.drill_AsOAA_initSysData();
	}
};
	
	
//=============================================================================
// ** ☆预加载
//
//			说明：	> 用过的bitmap，全部标记不删除，防止刷菜单时重建导致浪费资源。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
DrillUp.g_AsOAA_preloadEnabled = true;		//（预加载开关）
if( DrillUp.g_AsOAA_preloadEnabled == true ){
	//==============================
	// * 预加载 - 初始化
	//==============================
	var _drill_AsOAA_preload_initialize = Game_Temp.prototype.initialize;
	Game_Temp.prototype.initialize = function() {
		_drill_AsOAA_preload_initialize.call(this);
		this.drill_AsOAA_preloadInit();
	}
	//==============================
	// * 预加载 - 版本校验
	//==============================
	if( Utils.generateRuntimeId == undefined ){
		alert( DrillUp.drill_AsOAA_getPluginTip_LowVersion() );
	}
	//==============================
	// * 预加载 - 执行资源预加载
	//
	//			说明：	> 遍历全部资源，提前预加载标记过的资源。
	//==============================
	Game_Temp.prototype.drill_AsOAA_preloadInit = function() {
		this._drill_AsOAA_cacheId = Utils.generateRuntimeId();	//资源缓存id
		this._drill_AsOAA_preloadTank = [];						//bitmap容器
		for( var i = 0; i < DrillUp.g_AsOAA_style.length; i++ ){
			var temp_data = DrillUp.g_AsOAA_style[i];
			if( temp_data == undefined ){ continue; }
			
			// > 生命上限素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxHP_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxHP_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxHP_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 魔法上限素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxMP_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxMP_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['maxMP_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 生命数值素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curHP_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curHP_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curHP_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 魔法数值素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curMP_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curMP_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['curMP_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 物理攻击素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['atk_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['atk_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['atk_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 物理防御素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['def_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['def_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['def_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 魔法攻击素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mat_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mat_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mat_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 魔法防御素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mdf_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mdf_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['mdf_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 幸运素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['luk_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['luk_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['luk_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 敏捷素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['agi_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['agi_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['agi_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 经验素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['exp_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['exp_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['exp_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
			// > 等级素材
			this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['level_src_img_64x64'], 0, true, this._drill_AsOAA_cacheId ) );
			if( DrillUp.g_AsOAA_preload96x96Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['level_src_img_96x96'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			if( DrillUp.g_AsOAA_preload256x256Enabled == true ){
				this._drill_AsOAA_preloadTank.push( ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", temp_data['level_src_img_256x256'], 0, true, this._drill_AsOAA_cacheId ) );
			}
			
		}
	}
}



//=============================================================================
// ** ☆素材库的样式
//
//			说明：	> 该模块提供 素材库 功能。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 素材库的样式 - 切换样式
//==============================
Game_System.prototype.drill_AsOAA_setStyleData = function( style_id ){
	this._drill_AsOAA_styleId = Number(style_id);
	$gameTemp.drill_AsOAA_styleDataChanged();
}
//==============================
// * 素材库的样式 - 获取当前样式
//==============================
Game_Temp.prototype.drill_AsOAA_getStyleData = function() {
	return DrillUp.g_AsOAA_style[ $gameSystem._drill_AsOAA_styleId-1 ];
}
//==============================
// * 素材库的样式 - 样式变化时（子插件继承用）
//==============================
Game_Temp.prototype.drill_AsOAA_styleDataChanged = function() {
	//（当样式发生变化时，此函数会被调用，子插件可以继承此函数，即时监听并变化）
	//（你也可以将监听放在帧刷新中同步，但是那样更消耗性能）
};



//#############################################################################
// ** ☆素材库的窗口字符 标准模块
//#############################################################################
//##############################
// * 『素材库的窗口字符』 - 生命上限（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_maxHP = function() {
	return this.drill_AsOAA_getStyleData()['maxHP_text'];
};
//##############################
// * 『素材库的窗口字符』 - 生命上限（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_maxHP = function() {
	return this.drill_AsOAA_getStyleData()['maxHP_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 生命上限（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_maxHP = function() {
	return this.drill_AsOAA_getStyleData()['maxHP_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 生命上限（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_maxHP = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "maxHP", format );
};

//##############################
// * 『素材库的窗口字符』 - 魔法上限（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_maxMP = function() {
	return this.drill_AsOAA_getStyleData()['maxMP_text'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法上限（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_maxMP = function() {
	return this.drill_AsOAA_getStyleData()['maxMP_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法上限（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_maxMP = function() {
	return this.drill_AsOAA_getStyleData()['maxMP_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法上限（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_maxMP = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "maxMP", format );
};

//##############################
// * 『素材库的窗口字符』 - 生命数值（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_curHP = function() {
	return this.drill_AsOAA_getStyleData()['curHP_text'];
};
//##############################
// * 『素材库的窗口字符』 - 生命数值（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_curHP = function() {
	return this.drill_AsOAA_getStyleData()['curHP_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 生命数值（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_curHP = function() {
	return this.drill_AsOAA_getStyleData()['curHP_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 生命数值（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_curHP = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "curHP", format );
};

//##############################
// * 『素材库的窗口字符』 - 魔法数值（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_curMP = function() {
	return this.drill_AsOAA_getStyleData()['curMP_text'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法数值（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_curMP = function() {
	return this.drill_AsOAA_getStyleData()['curMP_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法数值（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_curMP = function() {
	return this.drill_AsOAA_getStyleData()['curMP_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法数值（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_curMP = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "curMP", format );
};

//##############################
// * 『素材库的窗口字符』 - 物理攻击（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_atk = function() {
	return this.drill_AsOAA_getStyleData()['atk_text'];
};
//##############################
// * 『素材库的窗口字符』 - 物理攻击（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_atk = function() {
	return this.drill_AsOAA_getStyleData()['atk_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 物理攻击（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_atk = function() {
	return this.drill_AsOAA_getStyleData()['atk_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 物理攻击（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_atk = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "atk", format );
};

//##############################
// * 『素材库的窗口字符』 - 物理防御（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_def = function() {
	return this.drill_AsOAA_getStyleData()['def_text'];
};
//##############################
// * 『素材库的窗口字符』 - 物理防御（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_def = function() {
	return this.drill_AsOAA_getStyleData()['def_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 物理防御（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_def = function() {
	return this.drill_AsOAA_getStyleData()['def_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 物理防御（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_def = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "def", format );
};

//##############################
// * 『素材库的窗口字符』 - 魔法攻击（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_mat = function() {
	return this.drill_AsOAA_getStyleData()['mat_text'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法攻击（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_mat = function() {
	return this.drill_AsOAA_getStyleData()['mat_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法攻击（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_mat = function() {
	return this.drill_AsOAA_getStyleData()['mat_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法攻击（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_mat = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "mat", format );
};

//##############################
// * 『素材库的窗口字符』 - 魔法防御（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_mdf = function() {
	return this.drill_AsOAA_getStyleData()['mdf_text'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法防御（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_mdf = function() {
	return this.drill_AsOAA_getStyleData()['mdf_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法防御（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_mdf = function() {
	return this.drill_AsOAA_getStyleData()['mdf_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 魔法防御（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_mdf = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "mdf", format );
};

//##############################
// * 『素材库的窗口字符』 - 幸运（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_luk = function() {
	return this.drill_AsOAA_getStyleData()['luk_text'];
};
//##############################
// * 『素材库的窗口字符』 - 幸运（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_luk = function() {
	return this.drill_AsOAA_getStyleData()['luk_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 幸运（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_luk = function() {
	return this.drill_AsOAA_getStyleData()['luk_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 幸运（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_luk = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "luk", format );
};

//##############################
// * 『素材库的窗口字符』 - 敏捷（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_agi = function() {
	return this.drill_AsOAA_getStyleData()['agi_text'];
};
//##############################
// * 『素材库的窗口字符』 - 敏捷（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_agi = function() {
	return this.drill_AsOAA_getStyleData()['agi_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 敏捷（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_agi = function() {
	return this.drill_AsOAA_getStyleData()['agi_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 敏捷（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_agi = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "agi", format );
};

//##############################
// * 『素材库的窗口字符』 - 经验（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_exp = function() {
	return this.drill_AsOAA_getStyleData()['exp_text'];
};
//##############################
// * 『素材库的窗口字符』 - 经验（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_exp = function() {
	return this.drill_AsOAA_getStyleData()['exp_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 经验（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_exp = function() {
	return this.drill_AsOAA_getStyleData()['exp_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 经验（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_exp = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "exp", format );
};

//##############################
// * 『素材库的窗口字符』 - 等级（文本） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getText_level = function() {
	return this.drill_AsOAA_getStyleData()['level_text'];
};
//##############################
// * 『素材库的窗口字符』 - 等级（文本颜色索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getTextColor_level = function() {
	return this.drill_AsOAA_getStyleData()['level_textColor'];
};
//##############################
// * 『素材库的窗口字符』 - 等级（图标索引） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 数字
//##############################
Game_Temp.prototype.drill_AsOAA_getIconIndex_level = function() {
	return this.drill_AsOAA_getStyleData()['level_iconIndex'];
};
//##############################
// * 『素材库的窗口字符』 - 等级（完整文本） - 获取【标准函数】
//			
//			参数：	> format 字符串 （只图标/只文本/图标+文本）
//			返回：	> 字符串
//##############################
Game_Temp.prototype.drill_AsOAA_getTextByFormat_level = function( format ){
	return this.drill_AsOAA_getTextByFormatPrivate( "level", format );
};

//=============================================================================
// ** ☆素材库的窗口字符实现
//
//			说明：	> 该模块提供 素材库 功能。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 素材库的窗口字符实现 - 完整文本 - 获取（私有）
//==============================
Game_Temp.prototype.drill_AsOAA_getTextByFormatPrivate = function( paramName, format ){
	var data = this.drill_AsOAA_getStyleData();
	var paramName_text = paramName + '_text';				//（组装的参数名）
	var paramName_iconIndex = paramName + '_iconIndex';		//
	var paramName_textColor = paramName + '_textColor';		//
	
	var context = "";
	if( format == "只图标" ){
		context += "\\i[" + data[paramName_iconIndex] + "]";
	}
	if( format == "只文本" ){
		
		// > 文本 - 修改颜色（白色时，不修改）
		if( data[paramName_textColor] > 0 ){
			if( Imported.Drill_CoreOfColor ){ context += "\\cc[oSave]"; }	//【窗口字符-颜色核心】
			context += "\\c[" + data[paramName_textColor] + "]";
		}
		
		// > 文本
		context += data[paramName_text];
		
		// > 文本 - 恢复颜色
		if( data[paramName_textColor] > 0 ){
			if( Imported.Drill_CoreOfColor ){ context += "\\cc[oLoad]"; }
		}
	}
	if( format == "图标+文本" ){
		
		// > 图标
		context += "\\i[" + data[paramName_iconIndex] + "]";
		
		// > 文本 - 修改颜色（白色时，不修改）
		if( data[paramName_textColor] > 0 ){
			if( Imported.Drill_CoreOfColor ){ context += "\\cc[oSave]"; }
			context += "\\c[" + data[paramName_textColor] + "]";
		}
		
		// > 文本
		context += data[paramName_text];
		
		// > 文本 - 恢复颜色
		if( data[paramName_textColor] > 0 ){
			if( Imported.Drill_CoreOfColor ){ context += "\\cc[oLoad]"; }
		}
	}
	return context;
};



//#############################################################################
// ** ☆素材库的资源 标准模块
//#############################################################################
//##############################
// * 『素材库的资源』 - 生命上限（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_maxHP = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "maxHP" );
}
//##############################
// * 『素材库的资源』 - 生命上限（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_maxHP = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "maxHP" );
}
//##############################
// * 『素材库的资源』 - 生命上限（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_maxHP = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "maxHP" );
}
//##############################
// * 『素材库的资源』 - 生命上限（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_maxHP = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "maxHP" );
}
//##############################
// * 『素材库的资源』 - 生命上限（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_maxHP = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "maxHP", width, height );
}

//##############################
// * 『素材库的资源』 - 魔法上限（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_maxMP = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "maxMP" );
}
//##############################
// * 『素材库的资源』 - 魔法上限（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_maxMP = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "maxMP" );
}
//##############################
// * 『素材库的资源』 - 魔法上限（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_maxMP = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "maxMP" );
}
//##############################
// * 『素材库的资源』 - 魔法上限（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_maxMP = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "maxMP" );
}
//##############################
// * 『素材库的资源』 - 魔法上限（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_maxMP = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "maxMP", width, height );
}

//##############################
// * 『素材库的资源』 - 生命数值（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_curHP = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "curHP" );
}
//##############################
// * 『素材库的资源』 - 生命数值（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_curHP = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "curHP" );
}
//##############################
// * 『素材库的资源』 - 生命数值（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_curHP = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "curHP" );
}
//##############################
// * 『素材库的资源』 - 生命数值（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_curHP = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "curHP" );
}
//##############################
// * 『素材库的资源』 - 生命数值（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_curHP = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "curHP", width, height );
}

//##############################
// * 『素材库的资源』 - 魔法数值（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_curMP = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "curMP" );
}
//##############################
// * 『素材库的资源』 - 魔法数值（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_curMP = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "curMP" );
}
//##############################
// * 『素材库的资源』 - 魔法数值（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_curMP = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "curMP" );
}
//##############################
// * 『素材库的资源』 - 魔法数值（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_curMP = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "curMP" );
}
//##############################
// * 『素材库的资源』 - 魔法数值（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_curMP = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "curMP", width, height );
}

//##############################
// * 『素材库的资源』 - 物理攻击（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_atk = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "atk" );
}
//##############################
// * 『素材库的资源』 - 物理攻击（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_atk = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "atk" );
}
//##############################
// * 『素材库的资源』 - 物理攻击（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_atk = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "atk" );
}
//##############################
// * 『素材库的资源』 - 物理攻击（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_atk = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "atk" );
}
//##############################
// * 『素材库的资源』 - 物理攻击（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_atk = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "atk", width, height );
}

//##############################
// * 『素材库的资源』 - 物理防御（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_def = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "def" );
}
//##############################
// * 『素材库的资源』 - 物理防御（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_def = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "def" );
}
//##############################
// * 『素材库的资源』 - 物理防御（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_def = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "def" );
}
//##############################
// * 『素材库的资源』 - 物理防御（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_def = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "def" );
}
//##############################
// * 『素材库的资源』 - 物理防御（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_def = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "def", width, height );
}

//##############################
// * 『素材库的资源』 - 魔法攻击（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_mat = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "mat" );
}
//##############################
// * 『素材库的资源』 - 魔法攻击（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_mat = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "mat" );
}
//##############################
// * 『素材库的资源』 - 魔法攻击（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_mat = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "mat" );
}
//##############################
// * 『素材库的资源』 - 魔法攻击（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_mat = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "mat" );
}
//##############################
// * 『素材库的资源』 - 魔法攻击（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_mat = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "mat", width, height );
}

//##############################
// * 『素材库的资源』 - 魔法防御（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_mdf = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "mdf" );
}
//##############################
// * 『素材库的资源』 - 魔法防御（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_mdf = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "mdf" );
}
//##############################
// * 『素材库的资源』 - 魔法防御（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_mdf = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "mdf" );
}
//##############################
// * 『素材库的资源』 - 魔法防御（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_mdf = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "mdf" );
}
//##############################
// * 『素材库的资源』 - 魔法防御（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_mdf = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "mdf", width, height );
}

//##############################
// * 『素材库的资源』 - 幸运（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_luk = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "luk" );
}
//##############################
// * 『素材库的资源』 - 幸运（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_luk = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "luk" );
}
//##############################
// * 『素材库的资源』 - 幸运（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_luk = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "luk" );
}
//##############################
// * 『素材库的资源』 - 幸运（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_luk = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "luk" );
}
//##############################
// * 『素材库的资源』 - 幸运（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_luk = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "luk", width, height );
}

//##############################
// * 『素材库的资源』 - 敏捷（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_agi = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "agi" );
}
//##############################
// * 『素材库的资源』 - 敏捷（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_agi = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "agi" );
}
//##############################
// * 『素材库的资源』 - 敏捷（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_agi = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "agi" );
}
//##############################
// * 『素材库的资源』 - 敏捷（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_agi = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "agi" );
}
//##############################
// * 『素材库的资源』 - 敏捷（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_agi = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "agi", width, height );
}

//##############################
// * 『素材库的资源』 - 经验（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_exp = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "exp" );
}
//##############################
// * 『素材库的资源』 - 经验（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_exp = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "exp" );
}
//##############################
// * 『素材库的资源』 - 经验（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_exp = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "exp" );
}
//##############################
// * 『素材库的资源』 - 经验（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_exp = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "exp" );
}
//##############################
// * 『素材库的资源』 - 经验（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_exp = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "exp", width, height );
}

//##############################
// * 『素材库的资源』 - 等级（图标） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//			
//			说明：	> 大小为32x32，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap32x32_level = function() {
	return this.drill_AsOAA_getBitmap32x32Private( "level" );
}
//##############################
// * 『素材库的资源』 - 等级（小图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为64x64，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap64x64_level = function() {
	return this.drill_AsOAA_getBitmap64x64Private( "level" );
}
//##############################
// * 『素材库的资源』 - 等级（中型图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为96x96，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap96x96_level = function() {
	return this.drill_AsOAA_getBitmap96x96Private( "level" );
}
//##############################
// * 『素材库的资源』 - 等级（高清图） - 获取【标准函数】
//			
//			参数：	> 无
//			返回：	> 画布对象
//
//			说明：	> 大小为256x256，返回的bitmap使用画布实现，且一定为isReady状态。（512x512太占内存了，所以不要太大）
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmap256x256_level = function() {
	return this.drill_AsOAA_getBitmap256x256Private( "level" );
}
//##############################
// * 『素材库的资源』 - 等级（自定义） - 获取【标准函数】
//			
//			参数：	> width,height 数字
//			返回：	> 画布对象
//
//			说明：	> 大小为width*height，返回的bitmap使用画布实现，且一定为isReady状态。
//##############################
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSize_level = function( width, height ){
	return this.drill_AsOAA_getBitmapCustomSizePrivate( "level", width, height );
}

//=============================================================================
// ** ☆素材库的资源实现
//
//			说明：	> 该模块管理 资源贴图 。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 素材库的资源实现 - 图标 - 获取（私有）
//
//			说明：	> 插件不允许同时缺少 图标和小图。
//==============================
Game_Temp.prototype.drill_AsOAA_getBitmap32x32Private = function( paramName ){
	var new_bitmap = new Bitmap(32,32);
	
	// > 有图标时（32x32）
	if( this.drill_AsOAA_hasBitmap32x32(paramName) == true ){
		var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
		var icon_index = this.drill_AsOAA_getStyleData()[paramName_iconIndex];
		var src_bitmap = ImageManager.loadSystem('IconSet');
		var pw = Window_Base._iconWidth;
		var ph = Window_Base._iconHeight;
		var sx = icon_index % 16 * pw;
		var sy = Math.floor(icon_index / 16) * ph;
		new_bitmap.blt( src_bitmap, sx, sy, pw, ph, 0, 0, 32, 32 );
		return new_bitmap;
	}
	// > 有小图时（64x64）
	if( this.drill_AsOAA_isReadyBitmap64x64(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_64x64';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 64, 64, 0, 0, 32, 32 );
		return new_bitmap;
	}
	return new_bitmap;
}
//==============================
// * 素材库的资源实现 - 图标 - 是否存在（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_hasBitmap32x32 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
	var icon_index = data[paramName_iconIndex];
	if( icon_index <= 0 ){ return false; }
	return true;
}
//==============================
// * 素材库的资源实现 - 图标 - 是否已加载（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_isReadyBitmap32x32 = function( paramName ){
	var src_bitmap = ImageManager.loadSystem('IconSet');
	return src_bitmap.isReady();
}

//==============================
// * 素材库的资源实现 - 小图 - 获取（私有）
//
//			说明：	> 插件不允许同时缺少 图标和小图。
//==============================
Game_Temp.prototype.drill_AsOAA_getBitmap64x64Private = function( paramName ){
	var new_bitmap = new Bitmap(64,64);
	
	// > 有小图时（64x64）
	if( this.drill_AsOAA_isReadyBitmap64x64(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_64x64';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 64, 64, 0, 0, 64, 64 );
		return new_bitmap;
	}
	// > 有图标时（32x32）
	if( this.drill_AsOAA_hasBitmap32x32(paramName) == true ){
		var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
		var icon_index = this.drill_AsOAA_getStyleData()[paramName_iconIndex];
		var src_bitmap = ImageManager.loadSystem('IconSet');
		var pw = Window_Base._iconWidth;
		var ph = Window_Base._iconHeight;
		var sx = icon_index % 16 * pw;
		var sy = Math.floor(icon_index / 16) * ph;
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, sx, sy, pw, ph, 0, 0, 64, 64 );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	return new_bitmap;
}
//==============================
// * 素材库的资源实现 - 小图 - 是否存在（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_hasBitmap64x64 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_64x64';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	return true;
}
//==============================
// * 素材库的资源实现 - 小图 - 是否已加载（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_isReadyBitmap64x64 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_64x64';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	var src_bitmap = ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", src_img, 0, true, this._drill_AsOAA_cacheId );
	if( src_bitmap.isReady() == true ){
		return true;
	}else{
		// > 未加载时，添加到预加载缓存中
		this._drill_AsOAA_preloadTank.push( src_bitmap );
		return false;
	}
}

//==============================
// * 素材库的资源实现 - 中型图 - 获取（私有）
//==============================
Game_Temp.prototype.drill_AsOAA_getBitmap96x96Private = function( paramName ){
	var new_bitmap = new Bitmap(96,96);
	
	// > 有中型图时（96x96）
	if( this.drill_AsOAA_isReadyBitmap96x96(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_96x96';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 96, 96, 0, 0, 96, 96 );
		return new_bitmap;
	}
	// > 有高清图时（256x256）
	if( this.drill_AsOAA_isReadyBitmap256x256(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_256x256';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 256, 256, 0, 0, 96, 96 );
		return new_bitmap;
	}
	// > 有小图时（64x64）
	if( this.drill_AsOAA_isReadyBitmap64x64(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_64x64';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, 0, 0, 64, 64, 0, 0, 96, 96 );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	// > 有图标时（32x32）
	if( this.drill_AsOAA_hasBitmap32x32(paramName) == true ){
		var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
		var icon_index = this.drill_AsOAA_getStyleData()[paramName_iconIndex];
		var src_bitmap = ImageManager.loadSystem('IconSet');
		var pw = Window_Base._iconWidth;
		var ph = Window_Base._iconHeight;
		var sx = icon_index % 16 * pw;
		var sy = Math.floor(icon_index / 16) * ph;
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, sx, sy, pw, ph, 0, 0, 96, 96 );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	return new_bitmap;
}
//==============================
// * 素材库的资源实现 - 中型图 - 是否存在（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_hasBitmap96x96 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_96x96';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	return true;
}
//==============================
// * 素材库的资源实现 - 中型图 - 是否已加载（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_isReadyBitmap96x96 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_96x96';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	var src_bitmap = ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", src_img, 0, true, this._drill_AsOAA_cacheId );
	if( src_bitmap.isReady() == true ){
		return true;
	}else{
		// > 未加载时，添加到预加载缓存中
		this._drill_AsOAA_preloadTank.push( src_bitmap );
		return false;
	}
}

//==============================
// * 素材库的资源实现 - 高清图 - 获取（私有）
//==============================
Game_Temp.prototype.drill_AsOAA_getBitmap256x256Private = function( paramName ){
	var new_bitmap = new Bitmap(256,256);
	
	// > 有高清图时（256x256）
	if( this.drill_AsOAA_isReadyBitmap256x256(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_256x256';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 256, 256, 0, 0, 256, 256 );
		return new_bitmap;
	}
	// > 有中型图时（96x96）
	if( this.drill_AsOAA_isReadyBitmap96x96(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_96x96';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 96, 96, 0, 0, 256, 256 );
		return new_bitmap;
	}
	// > 有小图时（64x64）
	if( this.drill_AsOAA_isReadyBitmap64x64(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_64x64';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, 0, 0, 64, 64, 0, 0, 256, 256 );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	// > 有图标时（32x32）
	if( this.drill_AsOAA_hasBitmap32x32(paramName) == true ){
		var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
		var icon_index = this.drill_AsOAA_getStyleData()[paramName_iconIndex];
		var src_bitmap = ImageManager.loadSystem('IconSet');
		var pw = Window_Base._iconWidth;
		var ph = Window_Base._iconHeight;
		var sx = icon_index % 16 * pw;
		var sy = Math.floor(icon_index / 16) * ph;
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, sx, sy, pw, ph, 0, 0, 256, 256 );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	return new_bitmap;
}
//==============================
// * 素材库的资源实现 - 高清图 - 是否存在（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_hasBitmap256x256 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_256x256';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	return true;
}
//==============================
// * 素材库的资源实现 - 高清图 - 是否已加载（开放函数）
//			
//			参数：	> paramName 字符串（参数名）
//			返回：	> 布尔
//			
//			说明：	> 该函数返回真实情况下的资源状态。
//==============================
Game_Temp.prototype.drill_AsOAA_isReadyBitmap256x256 = function( paramName ){
	var data = this.drill_AsOAA_getStyleData();
	if( data == undefined ){ return false; }
	var paramName_src_img = paramName + '_src_img_256x256';		//（组装的参数名）
	var src_img = data[paramName_src_img];
	if( src_img == undefined ){ return false; }
	if( src_img == "" ){ return false; }
	var src_bitmap = ImageManager.reserveBitmap( "img/Assets__ActorAttribute/", src_img, 0, true, this._drill_AsOAA_cacheId );
	if( src_bitmap.isReady() == true ){
		return true;
	}else{
		// > 未加载时，添加到预加载缓存中
		this._drill_AsOAA_preloadTank.push( src_bitmap );
		return false;
	}
}

//==============================
// * 素材库的资源实现 - 自定义 - 获取（私有）
//==============================
Game_Temp.prototype.drill_AsOAA_getBitmapCustomSizePrivate = function( paramName, width, height ){
	var new_bitmap = new Bitmap( width,height );
	//	（直接用更清晰的图来缩放大小）
	
	// > 有高清图时（256x256）
	if( this.drill_AsOAA_isReadyBitmap256x256(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_256x256';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 256, 256, 0, 0, width, height );
		return new_bitmap;
	}
	// > 有中型图时（96x96）
	if( this.drill_AsOAA_isReadyBitmap96x96(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_96x96';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap.blt( src_bitmap, 0, 0, 96, 96, 0, 0, width, height );
		return new_bitmap;
	}
	// > 有小图时（64x64）
	if( this.drill_AsOAA_isReadyBitmap64x64(paramName) == true ){
		var paramName_src_img = paramName + '_src_img_64x64';	//（组装的参数名）
		var src_img = this.drill_AsOAA_getStyleData()[paramName_src_img];
		var src_bitmap = ImageManager.loadBitmap( "img/Assets__ActorAttribute/", src_img, 0, true );
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, 0, 0, 64, 64, 0, 0, width, height );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	// > 有图标时（32x32）
	if( this.drill_AsOAA_hasBitmap32x32(paramName) == true ){
		var paramName_iconIndex = paramName + '_iconIndex';		//（组装的参数名）
		var icon_index = this.drill_AsOAA_getStyleData()[paramName_iconIndex];
		var src_bitmap = ImageManager.loadSystem('IconSet');
		var pw = Window_Base._iconWidth;
		var ph = Window_Base._iconHeight;
		var sx = icon_index % 16 * pw;
		var sy = Math.floor(icon_index / 16) * ph;
		new_bitmap._context.imageSmoothingEnabled = false;	//（像素邻近缩放）
		new_bitmap.blt( src_bitmap, sx, sy, pw, ph, 0, 0, width, height );
		new_bitmap._context.imageSmoothingEnabled = true;
		return new_bitmap;
	}
	return new_bitmap;
}


//=============================================================================
// ** ☆窗口字符应用之指代字符
//
//			说明：	> 指代字符阶段的 接口继承、执行 的相关应用。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 窗口字符应用之指代字符 - 最后继承1级
//==============================
var _drill_AsOAA_scene_initialize_1 = SceneManager.initialize;
SceneManager.initialize = function() {
	_drill_AsOAA_scene_initialize_1.call(this);
	
	//==============================
	// * 窗口字符应用之指代字符 - 组合符配置
	//==============================
	var _drill_AsOAA_COWC_transform_processCombined = Game_Temp.prototype.drill_COWC_transform_processCombined;
	Game_Temp.prototype.drill_COWC_transform_processCombined = function( matched_index, matched_str, command, args ){
		_drill_AsOAA_COWC_transform_processCombined.call( this, matched_index, matched_str, command, args );
		
		if( command.toUpperCase() == "DTXT" ){
			
			// > 『窗口字符定义』 - 生命上限文本（\dtxt[生命上限文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "生命上限文本" ){
					var str = this.drill_AsOAA_getTextByFormat_maxHP( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 生命上限文本（\dtxt[生命上限文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "生命上限文本" ){
					var str = this.drill_AsOAA_getTextByFormat_maxHP( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 魔法上限文本（\dtxt[魔法上限文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "魔法上限文本" ){
					var str = this.drill_AsOAA_getTextByFormat_maxMP( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 魔法上限文本（\dtxt[魔法上限文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "魔法上限文本" ){
					var str = this.drill_AsOAA_getTextByFormat_maxMP( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 生命数值文本（\dtxt[生命数值文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "生命数值文本" ){
					var str = this.drill_AsOAA_getTextByFormat_curHP( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 生命数值文本（\dtxt[生命数值文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "生命数值文本" ){
					var str = this.drill_AsOAA_getTextByFormat_curHP( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 魔法数值文本（\dtxt[魔法数值文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "魔法数值文本" ){
					var str = this.drill_AsOAA_getTextByFormat_curMP( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 魔法数值文本（\dtxt[魔法数值文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "魔法数值文本" ){
					var str = this.drill_AsOAA_getTextByFormat_curMP( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 物理攻击文本（\dtxt[物理攻击文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "物理攻击文本" ){
					var str = this.drill_AsOAA_getTextByFormat_atk( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 物理攻击文本（\dtxt[物理攻击文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "物理攻击文本" ){
					var str = this.drill_AsOAA_getTextByFormat_atk( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 物理防御文本（\dtxt[物理防御文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "物理防御文本" ){
					var str = this.drill_AsOAA_getTextByFormat_def( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 物理防御文本（\dtxt[物理防御文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "物理防御文本" ){
					var str = this.drill_AsOAA_getTextByFormat_def( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 魔法攻击文本（\dtxt[魔法攻击文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "魔法攻击文本" ){
					var str = this.drill_AsOAA_getTextByFormat_mat( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 魔法攻击文本（\dtxt[魔法攻击文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "魔法攻击文本" ){
					var str = this.drill_AsOAA_getTextByFormat_mat( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 魔法防御文本（\dtxt[魔法防御文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "魔法防御文本" ){
					var str = this.drill_AsOAA_getTextByFormat_mdf( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 魔法防御文本（\dtxt[魔法防御文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "魔法防御文本" ){
					var str = this.drill_AsOAA_getTextByFormat_mdf( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 幸运文本（\dtxt[幸运文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "幸运文本" ){
					var str = this.drill_AsOAA_getTextByFormat_luk( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 幸运文本（\dtxt[幸运文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "幸运文本" ){
					var str = this.drill_AsOAA_getTextByFormat_luk( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 敏捷文本（\dtxt[敏捷文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "敏捷文本" ){
					var str = this.drill_AsOAA_getTextByFormat_agi( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 敏捷文本（\dtxt[敏捷文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "敏捷文本" ){
					var str = this.drill_AsOAA_getTextByFormat_agi( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 经验文本（\dtxt[经验文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "经验文本" ){
					var str = this.drill_AsOAA_getTextByFormat_exp( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 经验文本（\dtxt[经验文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "经验文本" ){
					var str = this.drill_AsOAA_getTextByFormat_exp( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
			// > 『窗口字符定义』 - 等级文本（\dtxt[等级文本]）
			if( args.length == 1 ){
				var type = String(args[0]);
				if( type == "等级文本" ){
					var str = this.drill_AsOAA_getTextByFormat_level( "图标+文本" );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			// > 『窗口字符定义』 - 等级文本（\dtxt[等级文本:图标+文本]）
			if( args.length == 2 ){
				var type = String(args[0]);
				var temp1 = String(args[1]);
				if( type == "等级文本" ){
					var str = this.drill_AsOAA_getTextByFormat_level( temp1 );
					this.drill_COWC_transform_submitCombined( str );
					return;
				}
			}
			
		}
	}
}


//=============================================================================
// ** ☆窗口字符应用之效果字符
//=============================================================================
//==============================
// * 窗口字符应用之效果字符 - 最后继承1级
//==============================
var _drill_AsOAA_scene_initialize_2 = SceneManager.initialize;
SceneManager.initialize = function() {
	_drill_AsOAA_scene_initialize_2.call(this);
	
	// 【窗口字符 - 大图片字符】
	if( Imported.Drill_DialogTextBigImage ){
	
	//==============================
	// * 大图片字符 - 组合符配置
	//==============================
	var _drill_AsOAA_DTBI_COWC_effect_processCombined = Game_Temp.prototype.drill_COWC_effect_processCombined;
	Game_Temp.prototype.drill_COWC_effect_processCombined = function( matched_index, matched_str, command, args ){
		_drill_AsOAA_DTBI_COWC_effect_processCombined.call( this, matched_index, matched_str, command, args );
		
		if( command == "dimg" && args.length >= 3 ){
			var temp1 = String(args[0]);
			var temp2 = String(args[1]);
			var temp3 = String(args[2]);
			
			if( temp1 == "生命上限素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[生命上限素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "1";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "2";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "3";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("4");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[生命上限素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_maxHP();
							var str_imgIndex  = "1";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_maxHP();
							var str_imgIndex  = "2";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_maxHP();
							var str_imgIndex  = "3";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("4");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[生命上限素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "1";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "2";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "3";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("4");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "魔法上限素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法上限素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "5";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "6";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "7";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("8");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法上限素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_maxMP();
							var str_imgIndex  = "5";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_maxMP();
							var str_imgIndex  = "6";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_maxMP();
							var str_imgIndex  = "7";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("8");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[魔法上限素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "5";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "6";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "7";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("8");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "生命数值素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[生命数值素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "9";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "10";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "11";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("12");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[生命数值素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_curHP();
							var str_imgIndex  = "9";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_curHP();
							var str_imgIndex  = "10";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_curHP();
							var str_imgIndex  = "11";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("12");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[生命数值素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "9";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "10";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "11";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("12");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "魔法数值素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法数值素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "13";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "14";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "15";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("16");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法数值素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_curMP();
							var str_imgIndex  = "13";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_curMP();
							var str_imgIndex  = "14";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_curMP();
							var str_imgIndex  = "15";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("16");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[魔法数值素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "13";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "14";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "15";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("16");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "物理攻击素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[物理攻击素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "17";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "18";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "19";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("20");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[物理攻击素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_atk();
							var str_imgIndex  = "17";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_atk();
							var str_imgIndex  = "18";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_atk();
							var str_imgIndex  = "19";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("20");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[物理攻击素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "17";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "18";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "19";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("20");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "物理防御素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[物理防御素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "21";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "22";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "23";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("24");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[物理防御素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_def();
							var str_imgIndex  = "21";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_def();
							var str_imgIndex  = "22";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_def();
							var str_imgIndex  = "23";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("24");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[物理防御素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "21";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "22";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "23";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("24");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "魔法攻击素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法攻击素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "25";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "26";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "27";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("28");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法攻击素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_mat();
							var str_imgIndex  = "25";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_mat();
							var str_imgIndex  = "26";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_mat();
							var str_imgIndex  = "27";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("28");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[魔法攻击素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "25";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "26";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "27";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("28");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "魔法防御素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法防御素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "29";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "30";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "31";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("32");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[魔法防御素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_mdf();
							var str_imgIndex  = "29";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_mdf();
							var str_imgIndex  = "30";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_mdf();
							var str_imgIndex  = "31";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("32");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[魔法防御素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "29";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "30";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "31";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("32");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "幸运素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[幸运素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "33";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "34";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "35";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("36");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[幸运素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_luk();
							var str_imgIndex  = "33";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_luk();
							var str_imgIndex  = "34";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_luk();
							var str_imgIndex  = "35";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("36");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[幸运素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "33";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "34";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "35";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("36");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "敏捷素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[敏捷素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "37";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "38";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "39";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("40");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[敏捷素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_agi();
							var str_imgIndex  = "37";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_agi();
							var str_imgIndex  = "38";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_agi();
							var str_imgIndex  = "39";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("40");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[敏捷素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "37";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "38";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "39";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("40");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "经验素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[经验素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "41";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "42";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "43";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("44");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[经验素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_exp();
							var str_imgIndex  = "41";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_exp();
							var str_imgIndex  = "42";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_exp();
							var str_imgIndex  = "43";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("44");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[经验素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "41";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "42";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "43";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("44");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
			
			if( temp1 == "等级素材" ){
				if( args.length == 3 ){
					if( temp3 == "不占高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[等级素材:小图:不占高宽]）
						if( temp2 == "小图" ){
							var str_imgIndex  = "45";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "46";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "47";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("48");
								var str_imgIndex = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
					if( temp3 == "占用高宽" ){	// > 『窗口字符定义』 - 大图片字符（\dimg[等级素材:小图:占用高宽]）
						if( temp2 == "小图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_level();
							var str_imgIndex  = "45";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_level();
							var str_imgIndex  = "46";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var src_bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_level();
							var str_imgIndex  = "47";
							var str_imgWidth  = String(src_bitmap.width);
							var str_imgHeight = String(src_bitmap.height);
							var str_imgPosX   = "0";
							var str_imgPosY   = "0";
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("48");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = Number(size_arr[1]);
								var str_imgHeight = Number(size_arr[2]);
								var str_imgPosX   = "0";
								var str_imgPosY   = "0";
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
				if( args.length == 4 ){		// > 『窗口字符定义』 - 大图片字符（\dimg[等级素材:小图:不占高宽:位置[10,-10]]）
					var temp4 = String(args[3]);
					temp4 = temp4.replace("位置[","");
					temp4 = temp4.replace("]","");
					var pos = temp4.split(/[,，]/);
					if( pos.length >= 2 ){
						if( temp2 == "小图" ){
							var str_imgIndex  = "45";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "中型图" ){
							var str_imgIndex  = "46";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2 == "高清图" ){
							var str_imgIndex  = "47";
							var str_imgWidth  = "0";
							var str_imgHeight = "0";
							var str_imgPosX   = String(pos[0]);
							var str_imgPosY   = String(pos[1]);
							this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
						}
						if( temp2.indexOf("自定义[") != -1 ){
							temp2 = temp2.replace("自定义[","");
							temp2 = temp2.replace("]","");
							var size_arr = temp2.split(/[,，]/);
							if( size_arr.length >= 2 ){
								size_arr.unshift("48");
								var str_imgIndex  = size_arr.join("_");
								var str_imgWidth  = "0";
								var str_imgHeight = "0";
								var str_imgPosX   = String(pos[0]);
								var str_imgPosY   = String(pos[1]);
								this.drill_COWC_effect_submitCombined( "@@@dbi[drawAsset:_AsOAA_:"+str_imgIndex+":"+str_imgWidth+":"+str_imgHeight+":"+str_imgPosX+":"+str_imgPosY+"]" );
							}
						}
						return;
					}
				}
			}
			
		}
	};
	
	//==============================
	// * 字符图 - 再处理阶段-配置阶段（继承）
	//==============================
	var _drill_AsOAA_DTBI_COCD_textBlock_processSecond = Game_Temp.prototype.drill_COCD_textBlock_processSecond;
	Game_Temp.prototype.drill_COCD_textBlock_processSecond = function( command, args, cur_baseParam, cur_blockParam, cur_rowParam ){
		_drill_AsOAA_DTBI_COCD_textBlock_processSecond.call( this, command, args, cur_baseParam, cur_blockParam, cur_rowParam );
		
		if( command == "@@@dbi" ){
			if( args.length >= 5 ){
				var drawType = String(args[0]);
				if( drawType == "drawAsset" ){
					
					// > 『底层字符定义』 - 字符图（@@@dbi[drawAsset:XXXX素材:"1":0:0:4:4]） drill_big_image
					if( args.length == 7 ){
						cur_baseParam['DTBI_imgType'] = String(args[1]);		//（基础字符配置）
						cur_baseParam['DTBI_imgIndex'] = String(args[2]);		//
						
						cur_baseParam['DTBI_imgWidth'] = Number(args[3]);		//
						cur_baseParam['DTBI_imgHeight'] = Number(args[4]);		//
						cur_baseParam['DTBI_imgPosX'] = Number(args[5]);		//
						cur_baseParam['DTBI_imgPosY'] = Number(args[6]);		//
						
						this.drill_COCD_textBlock_submitSecond( "@" );			//（必须提交一个字符）
						return;
					}
				}
			}
		}
	}
	//==============================
	// * 大图片字符 - 绘制大图片
	//==============================
	var _drill_AsOAA_DTBI_getBitmap = Bitmap.prototype.drill_DTBI_getBitmap;
	Bitmap.prototype.drill_DTBI_getBitmap = function( baseParam ){
		var imgType = baseParam['DTBI_imgType'];
		var imgIndex = baseParam['DTBI_imgIndex'];
		if( imgType == "_AsOAA_" ){
			
			// > 自定义情况
			var custom_list = null;
			if( imgIndex.indexOf("_") != -1 ){
				var temp_arr = imgIndex.split("_");
				if( temp_arr.length >= 3 ){
					custom_list = temp_arr;
				}
			}
			
			// > 绘制 生命上限素材（小图/中型图/高清图/自定义）
			if( imgIndex == "1" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_maxHP();
			}
			if( imgIndex == "2" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_maxHP();
			}
			if( imgIndex == "3" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_maxHP();
			}
			if( custom_list != null && custom_list[0] == "4" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_maxHP( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 魔法上限素材（小图/中型图/高清图/自定义）
			if( imgIndex == "5" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_maxMP();
			}
			if( imgIndex == "6" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_maxMP();
			}
			if( imgIndex == "7" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_maxMP();
			}
			if( custom_list != null && custom_list[0] == "8" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_maxMP( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 生命数值素材（小图/中型图/高清图/自定义）
			if( imgIndex == "9" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_curHP();
			}
			if( imgIndex == "10" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_curHP();
			}
			if( imgIndex == "11" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_curHP();
			}
			if( custom_list != null && custom_list[0] == "12" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_curHP( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 魔法数值素材（小图/中型图/高清图/自定义）
			if( imgIndex == "13" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_curMP();
			}
			if( imgIndex == "14" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_curMP();
			}
			if( imgIndex == "15" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_curMP();
			}
			if( custom_list != null && custom_list[0] == "16" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_curMP( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 物理攻击素材（小图/中型图/高清图/自定义）
			if( imgIndex == "17" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_atk();
			}
			if( imgIndex == "18" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_atk();
			}
			if( imgIndex == "19" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_atk();
			}
			if( custom_list != null && custom_list[0] == "20" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_atk( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 物理防御素材（小图/中型图/高清图/自定义）
			if( imgIndex == "21" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_def();
			}
			if( imgIndex == "22" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_def();
			}
			if( imgIndex == "23" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_def();
			}
			if( custom_list != null && custom_list[0] == "24" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_def( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 魔法攻击素材（小图/中型图/高清图/自定义）
			if( imgIndex == "25" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_mat();
			}
			if( imgIndex == "26" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_mat();
			}
			if( imgIndex == "27" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_mat();
			}
			if( custom_list != null && custom_list[0] == "28" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_mat( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 魔法防御素材（小图/中型图/高清图/自定义）
			if( imgIndex == "29" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_mdf();
			}
			if( imgIndex == "30" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_mdf();
			}
			if( imgIndex == "31" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_mdf();
			}
			if( custom_list != null && custom_list[0] == "32" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_mdf( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 幸运素材（小图/中型图/高清图/自定义）
			if( imgIndex == "33" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_luk();
			}
			if( imgIndex == "34" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_luk();
			}
			if( imgIndex == "35" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_luk();
			}
			if( custom_list != null && custom_list[0] == "36" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_luk( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 敏捷素材（小图/中型图/高清图/自定义）
			if( imgIndex == "37" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_agi();
			}
			if( imgIndex == "38" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_agi();
			}
			if( imgIndex == "39" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_agi();
			}
			if( custom_list != null && custom_list[0] == "40" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_agi( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 经验素材（小图/中型图/高清图/自定义）
			if( imgIndex == "41" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_exp();
			}
			if( imgIndex == "42" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_exp();
			}
			if( imgIndex == "43" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_exp();
			}
			if( custom_list != null && custom_list[0] == "44" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_exp( Number(custom_list[1]),Number(custom_list[2]) );
			}
			
			// > 绘制 等级素材（小图/中型图/高清图/自定义）
			if( imgIndex == "45" ){
				return $gameTemp.drill_AsOAA_getBitmap64x64_level();
			}
			if( imgIndex == "46" ){
				return $gameTemp.drill_AsOAA_getBitmap96x96_level();
			}
			if( imgIndex == "47" ){
				return $gameTemp.drill_AsOAA_getBitmap256x256_level();
			}
			if( custom_list != null && custom_list[0] == "48" ){
				return $gameTemp.drill_AsOAA_getBitmapCustomSize_level( Number(custom_list[1]),Number(custom_list[2]) );
			}
		}
		
		// > 原函数
		return _drill_AsOAA_DTBI_getBitmap.call( this, baseParam );
	};
	
	
	}
}


//=============================================================================
// ** ☆用语管理器覆盖
//
//			说明：	> 该模块专门管理 用语管理器 的属性。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 用语管理器覆盖 - 最后继承1级
//==============================
var _drill_AsOAA_scene_initialize_3 = SceneManager.initialize;
SceneManager.initialize = function() {
	_drill_AsOAA_scene_initialize_3.call(this);
	
	//==============================
	// * 用语管理器覆盖 - 最大HP（覆写）
	//
	//			说明：	> 此文本在 【数据库 > 用语 > 最大HP】 设置。
	//==============================
	var _drill_AsOAA_TextManager_param = TextManager.param;
	TextManager.param = function( paramId ){
		// 数据来自：$dataSystem.terms.params 数组
		// 数据对应：["生命上限","魔法上限","物理攻击","物理防御","魔法攻击","魔法防御","敏捷","幸运","命中率","闪避率"]
		
		if( paramId == 0 ){
			if( DrillUp.g_AsOAA_coverEnabled_maxHP == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_maxHP( DrillUp.g_AsOAA_coverFormat_maxHP );
			}
		}
		if( paramId == 1 ){
			if( DrillUp.g_AsOAA_coverEnabled_maxMP == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_maxMP( DrillUp.g_AsOAA_coverFormat_maxMP );
			}
		}
		if( paramId == 2 ){
			if( DrillUp.g_AsOAA_coverEnabled_atk == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_atk( DrillUp.g_AsOAA_coverFormat_atk );
			}
		}
		if( paramId == 3 ){
			if( DrillUp.g_AsOAA_coverEnabled_def == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_def( DrillUp.g_AsOAA_coverFormat_def );
			}
		}
		if( paramId == 4 ){
			if( DrillUp.g_AsOAA_coverEnabled_mat == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_mat( DrillUp.g_AsOAA_coverFormat_mat );
			}
		}
		if( paramId == 5 ){
			if( DrillUp.g_AsOAA_coverEnabled_mdf == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_mdf( DrillUp.g_AsOAA_coverFormat_mdf );
			}
		}
		if( paramId == 6 ){
			if( DrillUp.g_AsOAA_coverEnabled_luk == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_luk( DrillUp.g_AsOAA_coverFormat_luk );
			}
		}
		if( paramId == 7 ){
			if( DrillUp.g_AsOAA_coverEnabled_agi == true ){
				return $gameTemp.drill_AsOAA_getTextByFormat_agi( DrillUp.g_AsOAA_coverFormat_agi );
			}
		}
		
		// > 原函数
		return _drill_AsOAA_TextManager_param.call(this);
	}
}



//=============================================================================
// ** ☆DEBUG资源情况测试
//
//			说明：	> 此模块控制 DEBUG资源情况测试 功能。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * DEBUG资源情况测试 - 帧刷新（地图界面）
//==============================
var _drill_AsOAA_debug_update = Scene_Map.prototype.update;
Scene_Map.prototype.update = function() {
    _drill_AsOAA_debug_update.call(this);
	
	// > 创建贴图
	if( $gameTemp._drill_AsOAA_DebugEnabled == true ){
		$gameTemp._drill_AsOAA_DebugEnabled = undefined;
		this.drill_AsOAA_createDebugSprite();
	}
	// > 销毁贴图
	if( $gameTemp._drill_AsOAA_DebugEnabled == false ){
		$gameTemp._drill_AsOAA_DebugEnabled = undefined;
		if( this._drill_AsOAA_DebugSprite != undefined ){
			this.removeChild(this._drill_AsOAA_DebugSprite);
			this._drill_AsOAA_DebugSprite = undefined;
		}
	}
}
//==============================
// * DEBUG资源情况测试 - 创建贴图
//==============================
Scene_Map.prototype.drill_AsOAA_createDebugSprite = function() {
	
	// > 销毁贴图
	if( this._drill_AsOAA_DebugSprite != undefined ){
		this.removeChild(this._drill_AsOAA_DebugSprite);
		this._drill_AsOAA_DebugSprite = undefined;
	}
	
	// > 创建贴图
	var temp_layer = new Sprite();
	this.addChild( temp_layer );	//（直接加在最顶层的上面）
	this._drill_AsOAA_DebugSprite = temp_layer;
	
	// > 显示图片
	var temp_sprite = new Sprite();
	temp_sprite.x = 50;
	temp_sprite.y = 150;
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.bitmap = $gameTemp.drill_AsOAA_getBitmap32x32_maxHP();
	temp_layer.addChild( temp_sprite );
	
	var temp_sprite = new Sprite();
	temp_sprite.x = 70;
	temp_sprite.y = 220;
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.bitmap = $gameTemp.drill_AsOAA_getBitmap64x64_maxHP();
	temp_layer.addChild( temp_sprite );
	
	var temp_sprite = new Sprite();
	temp_sprite.x = 90;
	temp_sprite.y = 320;
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.bitmap = $gameTemp.drill_AsOAA_getBitmap96x96_maxHP();
	temp_layer.addChild( temp_sprite );
	
	var temp_sprite = new Sprite();
	temp_sprite.x = 120;
	temp_sprite.y = 500;
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.bitmap = $gameTemp.drill_AsOAA_getBitmap256x256_maxHP();
	temp_layer.addChild( temp_sprite );
	
	// > 显示图片（自定义）
	var temp_sprite = new Sprite();
	temp_sprite.x = 200;
	temp_sprite.y = 100;
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.bitmap = $gameTemp.drill_AsOAA_getBitmapCustomSize_maxHP( 128, 64 );
	temp_layer.addChild( temp_sprite );
	
	
	// > 显示窗口字符
	var temp_window = new Window_Base( 300, 10, 500, 600 );
	temp_layer.addChild( temp_window );
	
	// > 绘制 - DEBUG显示画布范围
	var temp_bitmap = temp_window.contents;
	temp_bitmap.drill_COWC_debug_drawRect();
	
	// > 绘制 - 参数准备
	var options = {};
	options['infoParam'] = {};
	options['infoParam']['x'] = 0;
	options['infoParam']['y'] = 0;
	options['infoParam']['canvasWidth'] = temp_bitmap.width;
	options['infoParam']['canvasHeight'] = temp_bitmap.height;
	
	// > 绘制 - 参数准备 - 自定义
	options['blockParam'] = {};					//『清零字符默认间距』
	options['blockParam']['paddingTop'] = 0;
	options['rowParam'] = {};
	options['rowParam']['lineHeight_upCorrection'] = 0;
	
	options['baseParam'] = {};
	options['baseParam']['drawDebugBaseRect'] = false;
	options['baseParam']['fontSize'] = 18;		//（初始设置字体大小，这样就不会被 全局默认值 干扰了，fr也会重置为此值）
	
	// > 绘制 - 测试的字符
	var text =  "【" + DrillUp.g_AsOAA_PluginTip_curName + "】<br>" + 
				"当前测试窗口字符，如下： <br>" + 
				
				"\\\\dtxt[生命上限文本]　　　    \\dtxt[生命上限文本] \\fr<br>" + 
				"\\\\dtxt[魔法上限文本]　　　    \\dtxt[魔法上限文本] \\fr<br>" + 
				"\\\\dtxt[生命数值文本]　　　    \\dtxt[生命数值文本] \\fr<br>" + 
				"\\\\dtxt[魔法数值文本]　　　    \\dtxt[魔法数值文本] \\fr<br>" + 
				"\\\\dtxt[物理攻击文本]　　　    \\dtxt[物理攻击文本] \\fr<br>" + 
				"\\\\dtxt[物理防御文本]　　　    \\dtxt[物理防御文本] \\fr<br>" + 
				"\\\\dtxt[魔法攻击文本]　　　    \\dtxt[魔法攻击文本] \\fr<br>" + 
				"\\\\dtxt[魔法防御文本]　　　    \\dtxt[魔法防御文本] \\fr<br>" + 
				"\\\\dtxt[幸运文本]　　　　　    \\dtxt[幸运文本] \\fr<br>" + 
				"\\\\dtxt[敏捷文本]　　　　　    \\dtxt[敏捷文本] \\fr<br>" + 
				"\\\\dtxt[经验文本]　　　　　    \\dtxt[经验文本] \\fr<br>" + 
				"\\\\dtxt[等级文本]　　　　　    \\dtxt[等级文本] \\fr<br>" + 
				
				"\\\\dimg[魔法上限素材:小图:占用高宽]   \\dimg[魔法上限素材:小图:占用高宽] \\fr<br>" + 
				"\\\\dimg[魔法上限素材:自定义[72,48]:占用高宽]   \\dimg[魔法上限素材:自定义[72,48]:占用高宽] \\fr<br>" +
				
				"\\dimg[生命上限素材:小图:占用高宽]\\dimg[魔法数值素材:小图:占用高宽]\\dimg[魔法攻击素材:小图:占用高宽]\\dimg[敏捷素材:小图:占用高宽]<br>" + 
				"\\dimg[魔法上限素材:小图:占用高宽]\\dimg[物理攻击素材:小图:占用高宽]\\dimg[魔法防御素材:小图:占用高宽]\\dimg[经验素材:小图:占用高宽]<br>" + 
				"\\dimg[生命数值素材:小图:占用高宽]\\dimg[物理防御素材:小图:占用高宽]\\dimg[幸运素材:小图:占用高宽]\\dimg[等级素材:小图:占用高宽]<br>" + 
				"";
				
	// > 『字符主流程』 - 绘制文本【窗口字符 - 窗口字符核心】
	temp_window.drill_COWC_drawText( text, options );
}


