//=============================================================================
// Drill_GaugeButton.js
//=============================================================================

/*:
 * @plugindesc [v1.4]        地图UI - 地图按钮集
 * @author Drill_up
 * 
 * @Drill_LE_param "按钮-%d"
 * @Drill_LE_parentKey ""
 * @Drill_LE_var "DrillUp.g_GBu_style_length"
 * 
 * 
 * @help  
 * =============================================================================
 * +++ Drill_GaugeButton +++
 * 作者：Drill_up
 * 如果你有兴趣，也可以来看看更多我写的drill插件哦ヽ(*。>Д<)o゜
 * https://rpg.blue/thread-409713-1-1.html
 * =============================================================================
 * 使得你可以在地图界面放置按钮，点击后执行公共事件。
 * 
 * -----------------------------------------------------------------------------
 * ----插件扩展
 * 该插件 不能 单独使用。
 * 必须基于核心插件才能运行。
 * 基于：
 *   - Drill_CoreOfBallistics       数学模型-弹道核心★★v2.2及以上★★
 *   - Drill_CoreOfInput            系统-输入设备核心
 *   - Drill_LayerCommandThread     地图-多线程
 * 
 * -----------------------------------------------------------------------------
 * ----设定注意事项
 * 1.插件的作用域：地图界面。
 *   作用于地图。
 * 2.详细内容可以去看看 "11.地图UI > 关于地图按钮集.docx"。
 * 3.该插件的指令较多且使用频繁，建议使用小工具：插件信息查看器。
 *   在开启游戏编辑器时，可以并行使用读取器复制指令。
 * 地图层级：
 *   (1.你只可以将按钮放置在地图层级的 图片层 或 最顶层 中。
 *   (2.你可以在对话框进行时，按钮可按，但是要注意公共事件必须要等
 *      对话执行完结束阻塞之后才能运行。
 * 点击触发：
 *   (1.按钮添加后，点击可以执行公共事件。
 *      公共事件在地图界面中并行执行。
 *   (2.你配置的资源图片的矩形大小，决定你按钮的大小。
 *      如果你打算用在移动端，建议使用大图片，不然手指会按不到位置。
 *   (3.如果点击了两个按钮重叠的部分，则高亮的那个按钮执行。
 * 公共事件：
 *   (1.公共事件的执行通过 地图-多线程 插件来控制。
 *      可选择串行与并行，具体看看 "31.公共事件 > 关于公共事件与并行.docx"。
 *   (2.注意，对话框事件指令 是特殊的指令体，只要执行对话框，就会强
 *      制串行，阻塞其他所有事件的线程。
 * 细节：
 *   (1.由于在地图界面中不考虑键盘与手柄，所以按钮没有选中状态。
 *   (2.封印状态的按钮，无法被按下，并且点击后会播放错误提示音。
 *   (3.你可以隐藏按钮，隐藏效果与其他按钮插件中的”禁用”原理一样。
 * 设计：
 *   (1.你可以制作地图UI中一些简单的按钮，比如执行某技能效果、
 *      弹丸发射、舞蹈动作、物品机关等功能。
 *      但注意，该插件的功能范围非常局限，只是方便做简单的，
 *      不建议以此来做 虚拟按键、技能按键 等特别复杂的功能。
 * 
 * -----------------------------------------------------------------------------
 * ----关联文件
 * 资源路径：img/Map__ui_gaugeButton （Map后面有两个下划线）
 * 先确保项目img文件夹下是否有Map__ui_gaugeButton文件夹！
 * 要查看所有关联资源文件的插件，可以去看看"插件清单.xlsx"。
 * 如果没有，需要自己建立。需要配置资源文件：
 *
 * 按钮1 资源-按钮
 * 按钮2 资源-按钮
 * ……
 *
 * 所有素材都放在Map__ui_gaugeButton文件夹下。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 激活/封印
 * 你可以通过插件指令手动修改按钮的状态：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 激活
 * 插件指令：>地图按钮集 : 按钮[11] : 封印
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 按钮属性
 * 你还可以通过插件指令操作：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 播放一次自移动效果
 * 插件指令：>地图按钮集 : 按钮[11] : 强制播放一次自移动效果
 * 
 * 1."强制播放一次自移动效果" 会无视 自移动效果 是否开启，强制播放。
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 修改单属性
 * 你可以通过插件指令手动修改各个属性：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 显示
 * 插件指令：>地图按钮集 : 按钮变量[21] : 显示
 * 插件指令：>地图按钮集 : 批量按钮[7,8] : 显示
 * 插件指令：>地图按钮集 : 批量按钮变量[21,22] : 显示
 *
 * 插件指令：>地图按钮集 : 按钮[11] : 显示
 * 插件指令：>地图按钮集 : 按钮[11] : 隐藏
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停
 * 插件指令：>地图按钮集 : 按钮[11] : 继续
 * 插件指令：>地图按钮集 : 按钮[11] : 切换混合模式[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原混合模式
 * 插件指令：>地图按钮集 : 按钮[11] : 切换地图层级[最顶层]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原地图层级
 * 插件指令：>地图按钮集 : 按钮[11] : 切换图片层级[10]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原图片层级
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 透明度[255] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 透明度变量[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 旋转[90] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 旋转变量[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 转速[10.0] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 转速变量[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 缩放X[1.2] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 缩放X变量%[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 缩放Y[1.2] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 缩放Y变量%[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 斜切X[0.2] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 斜切X变量%[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 斜切Y[0.2] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性 : 斜切Y变量%[21] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 立即还原所有单属性
 * 
 * 1.前半部分（按钮变量[21]）和 后半部分（显示）
 *   的参数可以随意组合。一共有4*25种组合方式。
 * 2.注意，如果你想永久保持插件指令的改变结果，则需要开启 参数存储 。
 *   参数存储默认关闭，即 插件指令 的所有改变在读取存档后都会复原。
 * 3."旋转"、"转速"的变化效果可以叠加。
 *   "切换地图层级["能切换的层级为：图片层、最顶层。按钮只能切换这两个层级。
 * 4.插件指令的变化是永久性的。
 * 5.由于底层变化较大，插件不再支持以前版本的旧指令。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 移动到
 * 你可以通过插件指令手动设置移动：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-匀速移动 : 位置[100,100] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-匀速移动 : 位置变量[25,26] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-弹性移动 : 位置[100,100] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-弹性移动 : 位置变量[25,26] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-增减速移动 : 位置[100,100] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-增减速移动 : 位置变量[25,26] : 时间[60]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到-立即归位
 * 
 * 1.前半部分（按钮[11]）和 后半部分（移动到-匀速移动 : 位置[100,100] : 时间[60]）
 *   的参数可以随意组合。一共有4*7种组合方式。
 * 2.移动的初始位置以显示在地图界面的具体位置为基准，在基准位置上再进行移动到。
 *   指令中不含相对移动，比如多次执行移动到[20,20]，贴图只会到达一个固定的位置。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 获取属性
 * 你可以通过插件指令来获取 地图按钮 的属性值：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 位置X : 变量[21]
 * 插件指令：>地图按钮集 : 按钮变量[21] : 获取属性 : 位置X : 变量[21]
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 位置X : 变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 位置Y : 变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 透明度 : 变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 旋转 : 变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 转速 : 变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 缩放X : 变量%[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 缩放Y : 变量%[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 斜切X : 变量%[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 获取属性 : 斜切Y : 变量%[21]
 * 
 * 1.前半部分（按钮[11]）和 后半部分（获取属性 : 位置X : 变量[21]）
 *   的参数可以随意组合。一共有2*9种组合方式。
 * 2."变量%["表示该变量获取到属性时，会乘以100倍。因为变量只能存整数。
 *   比如缩放值为1.2时，则获取到： 1.2 * 100 = 120。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 修改中心锚点
 * 你可以通过插件指令手动修改中心锚点：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 修改中心锚点 : 锚点[0.5,0.5]
 * 插件指令：>地图按钮集 : 按钮变量[21] : 修改中心锚点 : 锚点[0.5,0.5]
 * 插件指令：>地图按钮集 : 批量按钮[7,8] : 修改中心锚点 : 锚点[0.5,0.5]
 * 插件指令：>地图按钮集 : 批量按钮变量[21,22] : 修改中心锚点 : 锚点[0.5,0.5]
 * 
 * 1.注意，由于中心锚点会影响缩放、旋转效果，
 *   最好在创建后，修改一次中心锚点，就不要再动了。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - GIF播放
 * 你还可以通过插件指令控制按钮播放：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 锁定帧
 * 插件指令：>地图按钮集 : 按钮[11] : 解锁帧
 * 插件指令：>地图按钮集 : 按钮[11] : 设置当前帧 : 当前帧[1]
 * 插件指令：>地图按钮集 : 按钮[11] : 设置当前帧 : 当前帧变量[21]
 * 插件指令：>地图按钮集 : 按钮[11] : 正向播放一次并停留在末尾帧
 * 插件指令：>地图按钮集 : 按钮[11] : 反向播放一次并停留在起始帧
 * 
 * 1.前半部分（按钮[11]）和 后半部分（锁定帧）
 *   的参数可以随意组合，一共有4*6种组合方式。
 * 2."设置当前帧"的 当前帧，1表示第1帧。
 *   你可以设置按钮锁定在某一帧，帧数与资源配置的id对应。
 * 3."正向播放一次并停留在末尾帧"表示强制该按钮播放重头到尾播放一次。
 *   播放完毕后，自动锁定到末尾帧。
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 延迟修改单属性
 * 上述的插件指令中，部分插件指令可以延迟执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 隐藏(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮变量[21] : 隐藏(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 批量按钮[7,8] : 隐藏(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 批量按钮变量[21,22] : 隐藏(延迟) : 延迟执行时间[20]
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 显示(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 隐藏(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 继续(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 切换混合模式(延迟)[0] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原混合模式(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 切换地图层级(延迟)[最顶层] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原地图层级(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 切换图片层级(延迟)[10] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原图片层级(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 透明度[255] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 透明度变量[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 旋转[90] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 旋转变量[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 转速[10.0] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 转速变量[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 缩放X[1.2] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 缩放X变量%[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 缩放Y[1.2] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 缩放Y变量%[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 斜切X[0.2] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 斜切X变量%[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 斜切Y[0.2] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 修改单属性(延迟) : 斜切Y变量%[21] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 还原所有单属性(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 立即取消全部延迟指令
 * 
 * 1.前半部分（按钮[11]）和 后半部分（隐藏(延迟) : 延迟执行时间[20]）
 *   的参数可以随意组合。一共有4*26种组合方式。
 * 2.设置延迟指令后，指令会被暂存到延迟队列中，等待延迟时间结束之后，执行指令。
 *   "立即取消全部延迟指令"可以清空排在队列中的所有延迟指令。
 * 3.此功能可以简化 并行事件 的设计，你可以在串行事件中执行延迟，延迟后并行变化贴图。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 延迟移动到
 * 上述的插件指令中，移动到的插件指令也可以延迟执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-匀速移动 : 位置[100,100] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-匀速移动 : 位置变量[25,26] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-弹性移动 : 位置[100,100] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-弹性移动 : 位置变量[25,26] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-增减速移动 : 位置[100,100] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-增减速移动 : 位置变量[25,26] : 时间[60] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 移动到(延迟)-延迟归位 : 延迟执行时间[20]
 * 
 * 1.前半部分（按钮[11]）和 后半部分（移动到(延迟)-匀速移动 : 位置[100,100] : 时间[60] : 延迟执行时间[20]）
 *   的参数可以随意组合。一共有4*7种组合方式。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 延迟GIF播放
 * 上述的插件指令中，按钮播放也可以延迟执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 锁定帧(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 解锁帧(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 设置帧(延迟) : 当前帧[1] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 设置帧(延迟) : 当前帧变量[21] : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 正向播放一次并停留在末尾帧(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 反向播放一次并停留在起始帧(延迟) : 延迟执行时间[20]
 * 
 * 1.前半部分（按钮[11]）和 后半部分（锁定帧(延迟) : 延迟执行时间[20]）
 *   的参数可以随意组合，一共有4*6种组合方式。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 增加延迟
 * 上述的插件指令中，你还可以设置增加延迟：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 全部延迟指令增加延迟 : 时间[10]
 * 插件指令：>地图按钮集 : 按钮[11] : 全部延迟指令增加延迟 : 时间[周期播放完的时间]
 * 
 * 1.前半部分（按钮[11]）和 后半部分（全部延迟指令增加延迟 : 时间[10]）
 *   的参数可以随意组合。一共有4*2种组合方式。
 * 2.如果在此之前没有设置任何延迟指令，则增加延迟没有效果。
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 周期修改单属性
 * 上述的插件指令中，部分插件指令可以周期执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-隐藏(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮变量[21] : 添加周期-隐藏(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 批量按钮[7,8] : 添加周期-隐藏(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 批量按钮变量[21,22] : 添加周期-隐藏(周期) : 周期时长[90] : 周期内开始时间[0]
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-显示(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-隐藏(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-暂停(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-继续(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-切换混合模式(周期)[0] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-还原混合模式(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-切换地图层级(周期)[最顶层] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-还原地图层级(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-切换图片层级(周期)[10] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-还原图片层级(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 透明度[255] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 透明度变量[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 旋转[90] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 旋转变量[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 转速[10.0] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 转速变量[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 缩放X[1.2] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 缩放X变量%[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 缩放Y[1.2] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 缩放Y变量%[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 斜切X[0.2] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 斜切X变量%[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 斜切Y[0.2] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-修改单属性(周期) : 斜切Y变量%[21] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-还原所有单属性(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 继续周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 清空周期指令(立刻)
 * 
 * 1.前半部分（按钮[11]）和 后半部分（ 添加周期-隐藏(周期) ）
 *   的参数可以随意组合。一共有4*28种组合方式。
 * 2."添加周期"后，指令会根据"周期时长"和"开始时间"，持续循环执行。
 *   "清空周期指令"可以清空添加的指令。
 * 3.你可以塞入多条周期指令，每个周期指令控制不同的属性，实现复杂的变换效果。
 * 4."变量%["表示该变量修改属性值时，会缩小100倍。因为变量只能存整数。
 *   比如缩放的变量值为120时，则表示赋值： 120 / 100 = 1.2。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 周期移动到
 * 上述的插件指令中，移动到的插件指令也可以周期执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-匀速移动 : 位置[100,100] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-匀速移动 : 位置变量[25,26] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-弹性移动 : 位置[100,100] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-弹性移动 : 位置变量[25,26] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-增减速移动 : 位置[100,100] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-增减速移动 : 位置变量[25,26] : 时间[60] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-移动到(周期)-执行归位 : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 继续周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 清空周期指令(立刻)
 * 
 * 1.前半部分（按钮[11]）和 后半部分（ 添加周期-移动到(周期)-匀速移动 ）
 *   的参数可以随意组合。一共有4*10种组合方式。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 周期GIF播放
 * 上述的插件指令中，按钮播放也可以周期执行：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-锁定帧(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-解锁帧(周期) : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-设置帧(周期) : 当前帧[1] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 添加周期-设置帧(周期) : 当前帧变量[21] : 周期时长[90] : 周期内开始时间[0]
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 继续周期指令
 * 插件指令：>地图按钮集 : 按钮[11] : 清空周期指令(立刻)
 * 
 * 1.前半部分（按钮[11]）和 后半部分（ 添加周期-锁定帧(周期) ）
 *   的参数可以随意组合，一共有4*7种组合方式。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 周期的延迟
 * 上述的插件指令中，可以设置：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停周期指令(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 继续周期指令(延迟) : 延迟执行时间[20]
 * 插件指令：>地图按钮集 : 按钮[11] : 清空周期指令(延迟) : 延迟执行时间[20]
 * 
 * 1.前半部分（按钮[11]）和 后半部分（ 暂停周期指令(延迟) : 延迟执行时间[20] ）
 *   的参数可以随意组合。一共有5*3种组合方式。
 * 2.注意，周期指令添加后，就开始循环了，
 *   你如果一开始不想立即执行，可以使用"暂停周期指令"，而后再"继续周期指令(延迟)"。
 * 3.注意，没有"添加周期(延迟)"的功能，
 *   只能一次性添加，不能并行延迟添加，这样是为了防止过度设计。
 * 4.如果一个装饰贴图真的有 两套周期指令，（比如先周期放大后周期缩小）
 *   那你应该考虑把它合并成一套，增加周期时长，修改周期内开始时间；
 *   或者使用两个不同的装饰贴图，分别执行不同周期指令，然后通过延迟指令显示隐藏贴图。
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - 周期末尾时
 * 上述的插件指令中，可以设置：
 * 
 * 插件指令：>地图按钮集 : 按钮[11] : 暂停周期指令(周期末尾时)
 * 插件指令：>地图按钮集 : 按钮[11] : 清空周期指令(周期末尾时)
 * 插件指令：>地图按钮集 : 按钮[11] : 执行等待(周期末尾时)
 * 
 * 1.注意，指令 "执行等待" 会阻塞事件的执行。（不要写多条相同的指令）
 *   等待后，可以让周期指令的变换停留在播放结束的时候。
 *   因为是串行阻塞，所以批量和不批量的等待时长一样。
 * 2.设计时建议多个贴图一起变换时，使用相同的周期时长，
 *   这样再执行等待就不会出现周期时间错位的问题。
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----可选设定 - Debug查看
 * 你可以通过插件指令Debug查看：
 * 
 * 插件指令：>地图按钮集 : DEBUG碰撞体+悬停查看 : 开启
 * 插件指令：>地图按钮集 : DEBUG碰撞体+悬停查看 : 关闭
 * 
 * -----------------------------------------------------------------------------
 * ----插件性能
 * 测试仪器：   4G 内存，Intel Core i5-2520M CPU 2.5GHz 处理器
 *              Intel(R) HD Graphics 3000 集显 的垃圾笔记本
 *              (笔记本的3dmark综合分：571，鲁大师综合分：48456)
 * 总时段：     20000.00ms左右
 * 对照表：     0.00ms  - 40.00ms （几乎无消耗）
 *              40.00ms - 80.00ms （低消耗）
 *              80.00ms - 120.00ms（中消耗）
 *              120.00ms以上      （高消耗）
 * 工作类型：   持续执行
 * 时间复杂度： o(n^2)*o(贴图处理) 每帧
 * 测试方法：   去各个管理层跑一圈测试就可以了。
 * 测试结果：   200个事件的地图中，平均消耗为：【42.50ms】
 *              100个事件的地图中，平均消耗为：【20.52ms】
 *               50个事件的地图中，平均消耗为：【13.00ms】
 * 
 * 1.插件只在自己作用域下工作消耗性能，在其它作用域下是不工作的。
 *   测试结果并不是精确值，范围在给定值的10ms范围内波动。
 *   更多性能介绍，去看看 "0.性能测试报告 > 关于插件性能.docx"。
 * 2.每个按钮都对应各种状态的贴图，鼠标靠近会即时切换，所以相对
 *   有一些消耗，不过影响不大。
 * 
 * -----------------------------------------------------------------------------
 * ----更新日志
 * [v1.0]
 * 完成插件ヽ(*。>Д<)o゜
 * [v1.1]
 * 优化了内部结构，修复了镜头缩放时按钮被缩小的bug。
 * [v1.2]
 * 优化了旧存档的识别与兼容。
 * [v1.3]
 * 修复了 图片切换 功能无效的bug。
 * [v1.4]
 * 整体翻新了控制器与贴图的按钮结构。
 * 
 * 
 * 
 * @param ----按钮集----
 * @default 
 * 
 * @param 按钮-1
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-2
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-3
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-4
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-5
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-6
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-7
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-8
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-9
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-10
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-11
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-12
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-13
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-14
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-15
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-16
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-17
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-18
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-19
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-20
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-21
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-22
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-23
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-24
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-25
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-26
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-27
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-28
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-29
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-30
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-31
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-32
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-33
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-34
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-35
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-36
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-37
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-38
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-39
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-40
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-41
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-42
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-43
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-44
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-45
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-46
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-47
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-48
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-49
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-50
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-51
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-52
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-53
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-54
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-55
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-56
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-57
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-58
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-59
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default 
 * 
 * @param 按钮-60
 * @parent ----按钮集----
 * @type struct<GBuButton>
 * @desc 按钮的详细配置信息。
 * @default
 * 
 */
/*~struct~GBuButton:
 * 
 * @param 标签
 * @desc 只用于方便区分查看的标签，不作用在插件中。
 * @default ==新的按钮==
 * 
 * 
 * @param ---贴图---
 * @default 
 *
 * @param 初始是否显示
 * @parent ---贴图---
 * @type boolean
 * @on 显示
 * @off 隐藏
 * @desc true - 显示，false - 隐藏
 * @default true
 * 
 * @param 初始是否锁定帧
 * @parent ---贴图---
 * @type boolean
 * @on 锁定
 * @off 不锁定
 * @desc true - 锁定，false - 不锁定
 * @default false
 * 
 * @param 锁定帧数
 * @parent 初始是否锁定帧
 * @type number
 * @min 1
 * @desc 该GIF在游戏初始时锁定的帧数id，对应 资源 中的序号。
 * @default 1
 * 
 * @param 资源-按钮
 * @parent ---贴图---
 * @desc 按钮的图片资源。
 * @default ["(需配置)按钮图片资源"]
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file[]
 *
 * @param 预加载类型
 * @parent ---贴图---
 * @type select
 * @option 关闭预加载
 * @value 关闭预加载
 * @option 固定预加载数量
 * @value 固定预加载数量
 * @option 全部预加载
 * @value 全部预加载
 * @desc 预加载的类型，详细去看看文档说明："1.系统 > 关于预加载.docx"。
 * @default 固定预加载数量
 *
 * @param 固定预加载的数量
 * @parent 预加载类型
 * @type number
 * @min 0
 * @desc 如果你配置的GIF资源数量非常多，可以设置固定预加载数量，减少内存消耗。剩下的在播放时边播放边加载。
 * @default 6
 *
 * @param 帧间隔
 * @parent ---贴图---
 * @type number
 * @min 1
 * @desc 按钮每帧播放间隔时间，单位帧。（1秒60帧）
 * @default 4
 *
 * @param 是否倒放
 * @parent ---贴图---
 * @type boolean
 * @on 倒放
 * @off 不倒放
 * @desc true - 倒放，false - 不倒放
 * @default false
 *
 * @param 图像-色调值
 * @parent ---贴图---
 * @type number
 * @min 0
 * @max 360
 * @desc 资源图像的色调值。
 * @default 0
 *
 * @param 图像-模糊边缘
 * @parent ---贴图---
 * @type boolean
 * @on 模糊
 * @off 关闭
 * @desc 此参数可以看看："0.基本定义 > 缩放模式.docx"。设置模糊后，缩放时可以模糊资源图像的边缘，防止出现像素锯齿。
 * @default false
 *
 *
 * @param 平移-按钮 X
 * @parent ---贴图---
 * @desc x轴方向平移，单位像素，0为圆心贴在最左边。正数向右，负数向左。
 * @default 0
 *
 * @param 平移-按钮 Y
 * @parent ---贴图---
 * @desc y轴方向平移，单位像素，0为圆心贴在最上面。正数向下，负数向上。
 * @default 0
 *
 * @param 旋转速度
 * @parent ---贴图---
 * @desc 正数逆时针，负数顺时针，单位 角度/帧。(1秒60帧，360.0为一周)
 * @default 0.0
 *
 * @param 透明度
 * @parent ---贴图---
 * @type number
 * @min 0
 * @max 255
 * @desc 0为完全透明，255为完全不透明。
 * @default 255
 *
 * @param 混合模式
 * @parent ---贴图---
 * @type select
 * @option 普通
 * @value 0
 * @option 发光
 * @value 1
 * @option 实色混合(正片叠底)
 * @value 2
 * @option 浅色
 * @value 3
 * @option 叠加
 * @value 4
 * @desc 此参数可以看看："0.基本定义 > 混合模式.docx"。pixi的渲染混合模式。0-普通,1-发光,2-实色混合,3-浅色,4-叠加。
 * @default 0
 *
 * @param 地图层级
 * @parent ---贴图---
 * @type select
 * @option 图片层
 * @value 图片层
 * @option 最顶层
 * @value 最顶层
 * @desc 地图所在的层级位置，具体关系看看插件说明。
 * @default 图片层
 *
 * @param 图片层级
 * @parent ---贴图---
 * @type number
 * @min 0
 * @desc 同一个地图层级中，先后排序的位置，0表示最后面。
 * @default 10
 * 
 * 
 * @param ---3d效果---
 * @desc 
 * 
 * @param 缩放 X
 * @parent ---3d效果---
 * @desc GIF的缩放X值，默认比例1.0。缩放将会使得GIF看起来旋转具有一定透视。
 * @default 1.0
 * 
 * @param 缩放 Y
 * @parent ---3d效果---
 * @desc GIF的缩放Y值，默认比例1.0。缩放将会使得GIF看起来旋转具有一定透视。
 * @default 1.0
 * 
 * @param 斜切 X
 * @parent ---3d效果---
 * @desc GIF的斜切X值，默认比例0.0。斜切将会使得GIF看起来旋转具有一定角度。
 * @default 0.0
 * 
 * @param 斜切 Y
 * @parent ---3d效果---
 * @desc GIF的斜切Y值，默认比例0.0。斜切将会使得GIF看起来旋转具有一定角度。
 * @default 0.0
 * 
 * 
 * @param ---自变化效果---
 * @default 
 *
 * @param 浮动效果
 * @parent ---自变化效果---
 * @type select
 * @option 关闭
 * @value 关闭
 * @option 左右浮动
 * @value 左右浮动
 * @option 上下浮动
 * @value 上下浮动
 * @option 左上右下斜向浮动
 * @value 左上右下斜向浮动
 * @option 右上左下斜向浮动
 * @value 右上左下斜向浮动
 * @desc 当前贴图，会来回浮动。
 * @default 关闭
 * 
 * @param 浮动速度
 * @parent 浮动效果
 * @desc 浮动变化的速度。
 * @default 1.0
 *
 * @param 浮动偏移量
 * @parent 浮动效果
 * @type number
 * @min 1
 * @desc 使用左右或者上下浮动时，浮动偏移的位置量，单位像素。
 * @default 15
 *
 * @param 闪烁效果
 * @parent ---自变化效果---
 * @type select
 * @option 关闭
 * @value 关闭
 * @option 开启
 * @value 开启
 * @desc 当前贴图，会来回闪烁。
 * @default 关闭
 * 
 * @param 闪烁速度
 * @parent 闪烁效果
 * @desc 闪烁明亮变化的速度。
 * @default 6.0
 * 
 * @param 闪烁幅度范围
 * @parent 闪烁效果
 * @type number
 * @min 1
 * @max 255
 * @desc 闪烁变化的透明度幅度范围。
 * @default 35
 * 
 * @param 摇晃效果
 * @parent ---自变化效果---
 * @type select
 * @option 关闭
 * @value 关闭
 * @option 开启
 * @value 开启
 * @desc 当前贴图，会来回摇晃。
 * @default 关闭
 * 
 * @param 摇晃速度
 * @parent 摇晃效果
 * @desc 来回摇晃变化的速度。
 * @default 4.0
 * 
 * @param 摇晃幅度范围
 * @parent 摇晃效果
 * @type number
 * @min 1
 * @desc 来回摇晃的幅度范围。单位角度。
 * @default 12
 *
 * @param 缩放效果
 * @parent ---自变化效果---
 * @type select
 * @option 关闭
 * @value 关闭
 * @option 左右缩放
 * @value 左右缩放
 * @option 上下缩放
 * @value 上下缩放
 * @option 整体缩放
 * @value 整体缩放
 * @desc 当前贴图，会来回缩放。
 * @default 关闭
 * 
 * @param 缩放速度
 * @parent 缩放效果
 * @desc 缩放大小变化的速度。
 * @default 1.0
 * 
 * @param 缩放幅度范围
 * @parent 缩放效果
 * @desc 缩放变化的比例幅度范围。
 * @default 0.2
 *
 *
 * @param ---自移动效果---
 * @default 
 *
 * @param 初始是否开启自移动效果
 * @parent ---自移动效果---
 * @type boolean
 * @on 开启
 * @off 关闭
 * @desc true - 开启，false - 关闭。按钮会从某个点跑回自己的原位置。
 * @default true
 *
 * @param 自移动效果
 * @parent 初始是否开启自移动效果
 * @type struct<DrillWindowMoving>
 * @desc 按钮会从某个点跑回自己的原位置。
 * @default {"移动类型":"弹性移动","移动时长":"30","移动延迟":"0","---起点---":"","坐标类型":"相对坐标","起点-相对坐标 X":"-100","起点-相对坐标 Y":"0","起点-绝对坐标 X":"0","起点-绝对坐标 Y":"0"}
 *
 *
 * @param ---按钮功能---
 * @default 
 * 
 * @param 执行的公共事件
 * @parent ---按钮功能---
 * @type common_event
 * @desc 按钮按下后执行的公共事件。
 * @default 0
 *
 * @param 公共事件执行方式
 * @parent ---按钮功能---
 * @type select
 * @option 串行
 * @value 串行
 * @option 并行
 * @value 并行
 * @desc 公共事件的执行方式。
 * @default 并行
 * 
 * 
 * @param ---按钮管理---
 * @default 
 * 
 * @param 高亮时设置
 * @parent ---按钮管理---
 * @type select
 * @option 关闭效果
 * @value 关闭效果
 * @option 贴图切换
 * @value 贴图切换
 * @option 贴图叠加
 * @value 贴图叠加
 * @desc 鼠标悬停高亮时，"贴图切换"将替换按钮贴图。"贴图叠加"将在按钮贴图上叠加新贴图。
 * @default 关闭效果
 *
 * @param 资源-高亮时
 * @parent 高亮时设置
 * @desc 按钮高亮时的图片资源。
 * @default (需配置)按钮-高亮时
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file
 * 
 * @param 高亮时音效设置
 * @parent 高亮时设置
 * @type select
 * @option 关闭音效
 * @value 关闭音效
 * @option 使用'选择'音效
 * @value 使用'选择'音效
 * @option 使用自定义音效
 * @value 使用自定义音效
 * @desc 高亮时的音效模式。
 * @default 使用'选择'音效
 *
 * @param 高亮时的自定义音效
 * @parent 高亮时音效设置
 * @type struct<SoundData>
 * @desc 模式为"使用自定义音效"时，声音的详细配置信息。
 * @default {}
 * 
 * @param 按下时设置
 * @parent ---按钮管理---
 * @type select
 * @option 关闭效果
 * @value 关闭效果
 * @option 贴图切换
 * @value 贴图切换
 * @option 贴图叠加
 * @value 贴图叠加
 * @desc 鼠标悬停按下时，"贴图切换"将替换按钮贴图。"贴图叠加"将在按钮贴图上叠加新贴图。
 * @default 关闭效果
 *
 * @param 资源-按下时
 * @parent 按下时设置
 * @desc 按钮按下时的图片资源。
 * @default (需配置)按钮-按下时
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file
 * 
 * @param 按下时音效设置
 * @parent 按下时设置
 * @type select
 * @option 关闭音效
 * @value 关闭音效
 * @option 使用'确定'音效
 * @value 使用'确定'音效
 * @option 使用自定义音效
 * @value 使用自定义音效
 * @desc 按下时的音效模式。
 * @default 使用'确定'音效
 *
 * @param 按下时的自定义音效
 * @parent 按下时音效设置
 * @type struct<SoundData>
 * @desc 模式为"使用自定义音效"时，声音的详细配置信息。
 * @default {}
 * 
 * 
 * @param 初始是否封印
 * @parent ---按钮管理---
 * @type boolean
 * @on 封印
 * @off 关闭
 * @desc true - 封印，false - 关闭
 * @default false
 * 
 * @param 封印时设置
 * @parent 初始是否封印
 * @type select
 * @option 贴图切换
 * @value 贴图切换
 * @option 贴图叠加
 * @value 贴图叠加
 * @desc 按钮处于封印状态时，"贴图切换"将替换按钮贴图。"贴图叠加"将在按钮贴图上叠加新贴图。
 * @default 贴图切换
 * 
 * @param 资源-封印时
 * @parent 初始是否封印
 * @desc 按钮封印时的图片资源。
 * @default (需配置)按钮-封印时
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file
 * 
 * @param 封印且高亮时设置
 * @parent 初始是否封印
 * @type select
 * @option 关闭效果
 * @value 关闭效果
 * @option 贴图切换
 * @value 贴图切换
 * @option 贴图叠加
 * @value 贴图叠加
 * @option 透明度切换
 * @value 透明度切换
 * @desc 封印状态下，鼠标悬停高亮时，"贴图切换"将替换按钮贴图。"贴图叠加"将在按钮贴图上叠加新贴图。
 * @default 关闭效果
 *
 * @param 资源-封印且高亮时
 * @parent 封印且高亮时设置
 * @desc 按钮高亮的图片资源。
 * @default (需配置)按钮-封印且高亮时
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file
 *
 * @param 封印时的未高亮透明度
 * @parent 封印且高亮时设置
 * @type number
 * @min 0
 * @max 255
 * @desc 高亮设置为"透明度切换"时，鼠标未悬停在按钮上的透明度。
 * @default 160
 *
 * @param 封印时的高亮透明度
 * @parent 封印且高亮时设置
 * @type number
 * @min 0
 * @max 255
 * @desc 高亮设置为"透明度切换"时，鼠标悬停在按钮上的透明度。
 * @default 255
 * 
 * @param 封印且高亮时音效设置
 * @parent 封印且高亮时设置
 * @type select
 * @option 关闭音效
 * @value 关闭音效
 * @option 使用'选择'音效
 * @value 使用'选择'音效
 * @option 使用自定义音效
 * @value 使用自定义音效
 * @desc 按下时的音效模式。
 * @default 使用'选择'音效
 *
 * @param 封印且高亮时的自定义音效
 * @parent 封印且高亮时音效设置
 * @type struct<SoundData>
 * @desc 模式为"使用自定义音效"时，声音的详细配置信息。
 * @default {}
 * 
 * @param 封印且按下时设置
 * @parent 初始是否封印
 * @type select
 * @option 关闭效果
 * @value 关闭效果
 * @option 贴图切换
 * @value 贴图切换
 * @option 贴图叠加
 * @value 贴图叠加
 * @desc 封印状态下，鼠标按下时，"贴图切换"将替换按钮贴图。"贴图叠加"将在按钮贴图上叠加新贴图。
 * @default 关闭效果
 *
 * @param 资源-封印且按下时
 * @parent 封印且按下时设置
 * @desc 按钮高亮的图片资源。
 * @default (需配置)按钮-封印且按下时
 * @require 1
 * @dir img/Map__ui_gaugeButton/
 * @type file
 * 
 * @param 封印且按下时错误音设置
 * @parent 封印且按下时设置
 * @type select
 * @option 关闭音效
 * @value 关闭音效
 * @option 使用'错误'音效
 * @value 使用'错误'音效
 * @option 使用自定义音效
 * @value 使用自定义音效
 * @desc 按下时的音效模式。
 * @default 使用'错误'音效
 *
 * @param 封印且按下时的自定义错误音
 * @parent 封印且按下时错误音设置
 * @type struct<SoundData>
 * @desc 模式为"使用自定义音效"时，声音的详细配置信息。
 * @default {}
 *
 *
 */
/*~struct~DrillWindowMoving:
 *
 * @param 移动类型
 * @type select
 * @option 不移动
 * @value 不移动
 * @option 匀速移动
 * @value 匀速移动
 * @option 增减速移动
 * @value 增减速移动
 * @option 弹性移动
 * @value 弹性移动
 * @desc 移动类型基于 弹道核心-两点式 移动。更多内容可以去看看 "32.数学模型 > 关于弹道.docx"。
 * @default 匀速移动
 *
 * @param 移动时长
 * @type number
 * @min 1
 * @desc 起点位置回到原位置所需的时间，单位帧。（1秒60帧）
 * @default 20
 *
 * @param 移动延迟
 * @type number
 * @min 0
 * @desc 开始移动前的等待时间，单位帧。（1秒60帧）
 * @default 0
 *
 * @param ---起点---
 * @default 
 *
 * @param 坐标类型
 * @parent ---起点---
 * @type select
 * @option 相对坐标
 * @value 相对坐标
 * @option 绝对坐标
 * @value 绝对坐标
 * @desc 起点的坐标类型。
 * @default 相对坐标
 *
 * @param 起点-相对坐标 X
 * @parent ---起点---
 * @desc 起点位置回到原位置，负数从左向右移动，正数从右向左移动，单位像素。
 * @default -100
 * 
 * @param 起点-相对坐标 Y
 * @parent ---起点---
 * @desc 起点位置回到原位置，负数从上向下移动，正数从下向上移动，单位像素。
 * @default 0
 * 
 * @param 起点-绝对坐标 X
 * @parent ---起点---
 * @desc 绝对坐标以屏幕的位置为准，0表示贴在最左边，单位像素。
 * @default 0
 * 
 * @param 起点-绝对坐标 Y
 * @parent ---起点---
 * @desc 绝对坐标以屏幕的位置为准，0表示贴在最上面，单位像素。
 * @default 0
 * 
 */
/*~struct~SoundData:
 * 
 * @param 资源-声音
 * @desc 声音的资源文件。
 * @default (需配置)默认声音
 * @require 1
 * @dir audio/se/
 * @type file
 * 
 * @param 音量
 * @type number
 * @min 0
 * @max 100
 * @desc 声音的音量大小，范围为 0至100 。
 * @default 80
 * 
 * @param 音调
 * @type number
 * @min 50
 * @max 150
 * @desc 声音的音调值，范围为 50至150 。
 * @default 100
 * 
 * @param 声像
 * @desc 声音的左右声像，范围为 -100至100 。
 * @default 0
 * 
 */
 
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//
//		插件简称		GBu（Gauge_Button）
//		覆盖重写方法	无
//
//<<<<<<<<性能记录<<<<<<<<
//
//		★工作类型		持续执行
//		★时间复杂度		o(n^2)*o(贴图处理)  每帧
//		★性能测试因素	地图管理层
//		★性能测试消耗	2026/4/25：
//							》42.5ms（Drill_GBu_Sprite.update）4.8ms（drill_sprite_updateCommandChange）13.0ms（drill_sprite_updateChange）
//		★最坏情况		暂无
//		★备注			贴图数量不多，消耗不大。
//		
//		★优化记录		暂无
//
//<<<<<<<<插件记录<<<<<<<<
//
//		★功能结构树：
//			->☆提示信息
//			->☆静态数据
//			->☆插件指令
//				->『变换特性-单贴图』
//					->修改单属性
//					->移动到
//					->获取属性
//					->修改中心锚点
//					->延迟修改单属性
//					->延迟移动到
//					->周期修改单属性
//					->周期移动到
//				->其它特性
//					->GIF播放
//					->延迟GIF播放
//					->周期GIF播放
//			->☆预加载
//			->☆存储数据
//			->☆地图层级
//			
//			->☆地图点击拦截
//			->☆控制器与贴图
//			->☆唯一悬停
//			
//			->按钮控制器【Drill_GBu_Controller】
//			->按钮贴图【Drill_GBu_Sprite】
//			->按钮GIF子贴图【Drill_GBu_ChildGIFSprite】
//			
//			->☆DEBUG悬停范围
//		
//		
//		★家谱：
//			无
//		
//		★脚本文档：
//			无
//		
//		★插件私有类：
//			* 按钮控制器【Drill_GBu_Controller】
//			* 按钮贴图【Drill_GBu_Sprite】
//			* 按钮GIF子贴图【Drill_GBu_ChildGIFSprite】
//		
//		★必要注意事项：
//			暂无
//
//		★其它说明细节：
//			1.【镜头兼容】该插件的按钮如果放在 图片层 ，需要对其进行相关的镜头缩放控制。
//
//		★存在的问题：
//			暂无
//

//=============================================================================
// ** ☆提示信息
//=============================================================================
	//==============================
	// * 提示信息 - 参数
	//==============================
	var DrillUp = DrillUp || {}; 
	DrillUp.g_GBu_PluginTip_curName = "Drill_GaugeButton.js 地图UI-地图按钮集";
	DrillUp.g_GBu_PluginTip_baseList = [
		"Drill_CoreOfBallistics.js 数学模型-弹道核心",
		"Drill_CoreOfInput.js 系统-输入设备核心",
		"Drill_LayerCommandThread.js 地图-多线程"
	];
	//==============================
	// * 提示信息 - 报错 - 缺少基础插件
	//			
	//			说明：	> 此函数只提供提示信息，不校验真实的插件关系。
	//==============================
	DrillUp.drill_GBu_getPluginTip_NoBasePlugin = function(){
		if( DrillUp.g_GBu_PluginTip_baseList.length == 0 ){ return ""; }
		var message = "【" + DrillUp.g_GBu_PluginTip_curName + "】\n缺少基础插件，去看看下列插件是不是 未添加 / 被关闭 / 顺序不对：";
		for(var i=0; i < DrillUp.g_GBu_PluginTip_baseList.length; i++){
			message += "\n- ";
			message += DrillUp.g_GBu_PluginTip_baseList[i];
		}
		return message;
	};
	//==============================
	// * 提示信息 - 报错 - 找不到样式
	//==============================
	DrillUp.drill_GBu_getPluginTip_StyleNotFind = function( style_id ){
		return "【" + DrillUp.g_GBu_PluginTip_curName + "】\n对象创建失败，id为"+style_id+"的样式配置为空或不存在。";
	};
	//==============================
	// * 提示信息 - 报错 - NaN校验值
	//==============================
	DrillUp.drill_GBu_getPluginTip_ParamIsNaN = function( param_name, check_tank ){
		var text = "【" + DrillUp.g_GBu_PluginTip_curName + "】\n检测到参数"+param_name+"出现了NaN值，请及时检查你的函数。";
		if( check_tank ){
			var keys = Object.keys( check_tank );
			for( var i=0; i < keys.length; i++ ){
				text += "\n" + keys[i] + "的值：" + check_tank[ keys[i] ] ;
			}
		}
		return text;
	};
	//==============================
	// * 提示信息 - 报错 - 底层版本过低
	//==============================
	DrillUp.drill_GBu_getPluginTip_LowVersion = function(){
		return "【" + DrillUp.g_GBu_PluginTip_curName + "】\n游戏底层版本过低，插件基本功能无法执行。\n你可以去看\"rmmv软件版本（必看）.docx\"中的 \"旧工程升级至1.6版本\" 章节，来升级你的游戏底层版本。";
	};
	//==============================
	// * 提示信息 - 报错 - 强制更新提示
	//==============================
	DrillUp.drill_GBu_getPluginTip_NeedUpdate_Ballistics = function(){
		return "【" + DrillUp.g_GBu_PluginTip_curName + "】\n弹道核心插件版本过低，你需要更新 弹道核心 至少v2.2及以上版本。";
	};
	//==============================
	// * 提示信息 - 报错 - 控制器的非数字参数
	//==============================
	DrillUp.drill_GBu_getPluginTip_controllerData_NotId = function( class_name ){
		return "【" + DrillUp.g_GBu_PluginTip_curName + "】\n错误，类对象 "+class_name+" 获取到了非数字参数，数据初始化失败。";
	};
	//==============================
	// * 提示信息 - 报错 - 强制更新提示
	//==============================
	DrillUp.drill_GBu_getPluginTip_NeedUpdate_Camera = function(){
		return "【" + DrillUp.g_GBu_PluginTip_curName + "】\n活动地图镜头插件版本过低，你需要更新 镜头插件 至少v2.2及以上版本。";
	};
	
	
//=============================================================================
// ** ☆静态数据
//=============================================================================
	var Imported = Imported || {};
	Imported.Drill_GaugeButton = true;
	var DrillUp = DrillUp || {}; 
	DrillUp.parameters = PluginManager.parameters('Drill_GaugeButton');
	
	
	//==============================
	// * 静态数据 - 按钮参数
	//				（~struct~GBuButton）
	//==============================
	DrillUp.drill_GBu_initParam = function( dataFrom ){
		var data = {};
		
		// > P预加载GIF管理
		data['preloadType'] = String( dataFrom["预加载类型"] || "关闭预加载");
		data['preloadNum'] = Number( dataFrom["固定预加载的数量"] || 35);
		
		
		// > A主体 - 基础特性
		if( dataFrom["资源-按钮"] != "" &&
			dataFrom["资源-按钮"] != undefined ){
			data['src_img_gif'] = JSON.parse( dataFrom["资源-按钮"] );
		}else{
			data['src_img_gif'] = [];
		}
		data['src_img_file'] = "img/Map__ui_gaugeButton/";
		data['interval'] = Number( dataFrom["帧间隔"] || 4);
		data['back_run'] = String( dataFrom["是否倒放"] || "false") === "true";	
		
		data['tint'] = Number( dataFrom["图像-色调值"] || 0);
		data['smooth'] = String( dataFrom["图像-模糊边缘"] || "false") == "true";
		
		data['visible'] = String( dataFrom["初始是否显示"] || "false") === "true";	
		data['pause'] = false;
		data['blendMode'] = Number( dataFrom["混合模式"] || 0);
		data['layerIndex'] = String( dataFrom["地图层级"] || "图片层");
		data['zIndex'] = Number( dataFrom["图片层级"] || 0);
		
		
		// > A主体 - 其它特性
		data['commonEventId'] = Number( dataFrom["执行的公共事件"] || 0);
		data['pipeType'] = String( dataFrom["公共事件执行方式"] || "并行");
		
		
		// > B变换特性
		data['x'] = Number( dataFrom["平移-按钮 X"] || 0);
		data['y'] = Number( dataFrom["平移-按钮 Y"] || 0);
		data['rotate'] = Number( dataFrom["旋转速度"] || 0.0);
		data['opacity'] = Number( dataFrom["透明度"] || 255);
		data['anchor_x'] = 0.5;
		data['anchor_y'] = 0.5;
		
		// > B变换特性 - 3d效果
		data['scale_x'] = Number( dataFrom["缩放 X"] || 1.0);
		data['scale_y'] = Number( dataFrom["缩放 Y"] || 1.0);
		data['skew_x'] = Number( dataFrom["斜切 X"] || 0);
		data['skew_y'] = Number( dataFrom["斜切 Y"] || 0);
		data['parentRotate'] = 0;
		
		
		// > G自变化效果
		data['effect_float'] = String( dataFrom["浮动效果"] || "关闭");
		data['effect_floatSpeed'] = Number( dataFrom["浮动速度"] || 1.0);
		data['effect_floatRange'] = Number( dataFrom["浮动偏移量"] || 15);
		data['effect_flicker'] = String( dataFrom["闪烁效果"] || "关闭");
		data['effect_flickerSpeed'] = Number( dataFrom["闪烁速度"] || 6.0);
		data['effect_flickerRange'] = Number( dataFrom["闪烁幅度范围"] || 20);
		data['effect_swing'] = String( dataFrom["摇晃效果"] || "关闭");
		data['effect_swingSpeed'] = Number( dataFrom["摇晃速度"] || 4.0);
		data['effect_swingRange'] = Number( dataFrom["摇晃幅度范围"] || 12);
		data['effect_zoom'] = String( dataFrom["缩放效果"] || "关闭");
		data['effect_zoomSpeed'] = Number( dataFrom["缩放速度"] || 1.0);
		data['effect_zoomRange'] = Number( dataFrom["缩放幅度范围"] || 0.2);
		
		// > O播放GIF
		data['gif_lock'] = String( dataFrom["初始是否锁定帧"] || "false") == "true";
		data['gif_initFrame'] = Number( dataFrom["锁定帧数"] || 0);
		
		// > Q随机位置
		data['randomPos_enable'] = false;
		
		
		// > 2A激活与封印
		data['deactive_enabled'] = String( dataFrom["初始是否封印"] || "false") == "true";
		data['deactive_mode'] = String( dataFrom["封印时设置"] || "贴图切换");
		data['deactive_src_img'] = String( dataFrom["资源-封印时"] || "");
		data['deactive_src_img_file'] = "img/Map__ui_gaugeButton/";
		
		// > 2B自移动效果
		data['slideAnim_enabled'] = String( dataFrom["初始是否开启自移动效果"] || "true") == "true";
		if( dataFrom["自移动效果"] != "" &&
			dataFrom["自移动效果"] != undefined ){
			var slideAnim = JSON.parse( dataFrom["自移动效果"] );
			data['slideAnim'] = DrillUp.drill_GBu_initWindowMoving( slideAnim );
		}else{
			data['slideAnim'] = DrillUp.drill_GBu_initWindowMoving( {} );
		}
		
		// > 2E高亮与按下 - 高亮
		data['highlight_mode'] = String( dataFrom["高亮时设置"] || "关闭效果");
		data['highlight_src_img'] = String( dataFrom["资源-高亮时"] || "");
		data['highlight_src_img_file'] = "img/Map__ui_gaugeButton/";
		data['highlight_soundMode'] = String( dataFrom["高亮时音效设置"] || "关闭音效");
		if( dataFrom["高亮时的自定义音效"] != "" &&
			dataFrom["高亮时的自定义音效"] != undefined ){
			var sound = JSON.parse( dataFrom["高亮时的自定义音效"] );
			data['highlight_sound'] = DrillUp.drill_GBu_initSound( sound );
		}else{
			data['highlight_sound'] = DrillUp.drill_GBu_initSound( {} );
		}
		
		// > 2E高亮与按下 - 按下
		data['pushdown_mode'] = String( dataFrom["按下时设置"] || "关闭效果");
		data['pushdown_src_img'] = String( dataFrom["资源-按下时"] || "");
		data['pushdown_src_img_file'] = "img/Map__ui_gaugeButton/";
		data['pushdown_soundMode'] = String( dataFrom["按下时音效设置"] || "关闭音效");
		if( dataFrom["按下时的自定义音效"] != "" &&
			dataFrom["按下时的自定义音效"] != undefined ){
			var sound = JSON.parse( dataFrom["按下时的自定义音效"] );
			data['pushdown_sound'] = DrillUp.drill_GBu_initSound( sound );
		}else{
			data['pushdown_sound'] = DrillUp.drill_GBu_initSound( {} );
		}
		
		// > 2E高亮与按下 - 封印且高亮
		data['highlightD_mode'] = String( dataFrom["封印且高亮时设置"] || "关闭效果");
		data['highlightD_src_img'] = String( dataFrom["资源-封印且高亮时"] || "");
		data['highlightD_src_img_file'] = "img/Map__ui_gaugeButton/";
		data['highlightD_opacity1'] = Number( dataFrom["封印时的未高亮透明度"] || 160);
		data['highlightD_opacity2'] = Number( dataFrom["封印时的高亮透明度"] || 255);
		data['highlightD_soundMode'] = String( dataFrom["封印且高亮时音效设置"] || "关闭音效");
		if( dataFrom["封印且高亮时的自定义音效"] != "" &&
			dataFrom["封印且高亮时的自定义音效"] != undefined ){
			var sound = JSON.parse( dataFrom["封印且高亮时的自定义音效"] );
			data['highlightD_sound'] = DrillUp.drill_GBu_initSound( sound );
		}else{
			data['highlightD_sound'] = DrillUp.drill_GBu_initSound( {} );
		}
		
		// > 2E高亮与按下 - 封印且按下
		data['pushdownD_mode'] = String( dataFrom["封印且按下时设置"] || "关闭效果");
		data['pushdownD_src_img'] = String( dataFrom["资源-封印且按下时"] || "");
		data['pushdownD_src_img_file'] = "img/Map__ui_gaugeButton/";
		data['pushdownD_soundMode'] = String( dataFrom["封印且按下时错误音设置"] || "关闭音效");
		if( dataFrom["封印且按下时的自定义错误音"] != "" &&
			dataFrom["封印且按下时的自定义错误音"] != undefined ){
			var sound = JSON.parse( dataFrom["封印且按下时的自定义错误音"] );
			data['pushdownD_sound'] = DrillUp.drill_GBu_initSound( sound );
		}else{
			data['pushdownD_sound'] = DrillUp.drill_GBu_initSound( {} );
		}
		
		
		// > 控制器 初始化数据『控制器与贴图的样式-静态数据-指针初始化』
		Drill_GBu_Controller.drill_controller_initData( data );
		
		return data;
	};
	//==============================
	// * 静态数据 - 自移动效果
	//				（~struct~DrillWindowMoving）
	//==============================
	DrillUp.drill_GBu_initWindowMoving = function( dataFrom ){
		var data = {};
		data['slideMoveType'] = String( dataFrom["移动类型"] || "匀速移动");
		data['slideTime'] = Number( dataFrom["移动时长"] || 20);
		data['slideDelay'] = Number( dataFrom["移动延迟"] || 0);
		data['slidePosType'] = String( dataFrom["坐标类型"] || "相对坐标");
		data['slideX'] = Number( dataFrom["起点-相对坐标 X"] || 0);
		data['slideY'] = Number( dataFrom["起点-相对坐标 Y"] || 0);
		data['slideAbsoluteX'] = Number( dataFrom["起点-绝对坐标 X"] || 0);
		data['slideAbsoluteY'] = Number( dataFrom["起点-绝对坐标 Y"] || 0);
		return data;
	};
	//==============================
	// * 静态数据 - 声音
	//				（~struct~SoundData）
	//==============================
	DrillUp.drill_GBu_initSound = function( dataFrom ){
		var data = {};
		data['name'] = String( dataFrom["资源-声音"] || "");	//『完整声音数据』
		data['volume'] = Number( dataFrom["音量"] || 100);
		data['pitch'] = Number( dataFrom["音调"] || 100);
		data['pan'] = Number( dataFrom["声像"] || 0);
		return data;
	};
	//==============================
	// * 静态数据 - 最后继承1级
	//==============================
	var _drill_GBu_scene_initialize = SceneManager.initialize;
	SceneManager.initialize = function() {
		_drill_GBu_scene_initialize.call(this);
		
		/*-----------------按钮------------------*/
		for( var i = 0; i < DrillUp.g_GBu_style_length; i++ ){
			var temp = DrillUp.g_GBu_style[i];
			if( temp != undefined ){
				DrillUp.g_GBu_style[i] = DrillUp.drill_GBu_initParam( temp );
				DrillUp.g_GBu_style[i]['id'] = Number(i);
			}
		}
	}
	/*-----------------按钮------------------*/
	DrillUp.g_GBu_style_length = 60;
	DrillUp.g_GBu_style = [];
	for( var i = 0; i < DrillUp.g_GBu_style_length; i++ ){
		if( DrillUp.parameters["按钮-" + String(i+1) ] != undefined &&
			DrillUp.parameters["按钮-" + String(i+1) ] != "" ){
			DrillUp.g_GBu_style[i] = JSON.parse(DrillUp.parameters["按钮-" + String(i+1) ]);
		}else{
			DrillUp.g_GBu_style[i] = undefined;		//（设为空值，节约静态数据占用容量）
		}
	}


//=============================================================================
// * >>>>基于插件检测>>>>
//=============================================================================
if( Imported.Drill_CoreOfBallistics &&
	Imported.Drill_CoreOfInput &&
	Imported.Drill_LayerCommandThread ){
	
	if( typeof(Drill_COBa_ExtendTool) == "undefined" ){	//（弹道核心版本检测）
		alert( DrillUp.drill_GBu_getPluginTip_NeedUpdate_Ballistics() );
	}
	
	
//=============================================================================
// ** ☆插件指令
//=============================================================================
//==============================
// * 插件指令 - 指令绑定
//==============================
var _drill_GBu_pluginCommand = Game_Interpreter.prototype.pluginCommand
Game_Interpreter.prototype.pluginCommand = function( command, args ){
	_drill_GBu_pluginCommand.call(this, command, args);
	this.drill_GBu_pluginCommand( command, args );
}
//==============================
// * 插件指令 - 指令执行
//==============================
Game_Interpreter.prototype.drill_GBu_pluginCommand = function( command, args ){
	DrillUp.drill_GBu_globalPluginCommand( command, args, this );
}
//==============================
// * 插件指令 - 『作用全局的插件指令』
//
//			参数：	> command 字符串
//					> args 字符串列表
//					> gameInterpreter 解释器对象
//
//			说明：	> 该函数不能有 this 对象。
//					> 该函数不依赖解释器对象，gameInterpreter 可以为 null。函数可跨界面调用。
//==============================
DrillUp.drill_GBu_globalPluginCommand = function( command, args, gameInterpreter ){
	if( command === ">地图按钮集" ){ // >地图按钮集 : 按钮[1] : 显示
		
		/*-----------------DEBUG------------------*/
		if( args.length == 4 ){
			var temp1 = String(args[1]);
			var temp2 = String(args[3]);
			if( temp1 == "DEBUG碰撞体+悬停查看" ){
				if( temp2 == "启用" || temp2 == "开启" || temp2 == "打开" || temp2 == "启动" ){
					$gameSystem._drill_GBu_DebugEnabled = true;
					return;
				}
				if( temp2 == "关闭" || temp2 == "禁用" ){
					$gameSystem._drill_GBu_DebugEnabled = false;
					return;
				}
			}
		}
		
		/*-----------------对象组获取------------------*/
		var controllers = null;
		if( args.length >= 2 ){
			var unit = String(args[1]);
			if( controllers == null && unit.indexOf("批量按钮[") != -1 ){
				unit = unit.replace("批量按钮[","");
				unit = unit.replace("]","");
				controllers = [];
				var temp_arr = unit.split(/[,，]/);
				for( var k=0; k < temp_arr.length; k++ ){
					var controller_id = Number(temp_arr[k]);
					var temp_controller = $gameSystem._drill_GBu_dataTank_curController[ controller_id -1 ];
					if( temp_controller == undefined ){ continue; }
					controllers.push( temp_controller );
				}
			}
			if( controllers == null && unit.indexOf("批量按钮变量[") != -1 ){
				unit = unit.replace("批量按钮变量[","");
				unit = unit.replace("]","");
				controllers = [];
				var temp_arr = unit.split(/[,，]/);
				for( var k=0; k < temp_arr.length; k++ ){
					var controller_id = $gameVariables.value(Number(temp_arr[k]));
					var temp_controller = $gameSystem._drill_GBu_dataTank_curController[ controller_id -1 ];
					if( temp_controller == undefined ){ continue; }
					controllers.push( temp_controller );
				}
			}
			if( controllers == null && unit.indexOf("按钮变量[") != -1 ){
				unit = unit.replace("按钮变量[","");
				unit = unit.replace("]","");
				var controller_id = $gameVariables.value(Number(unit));
				var temp_controller = $gameSystem._drill_GBu_dataTank_curController[ controller_id -1 ];
				if( temp_controller == undefined ){ return; }
				controllers = [ temp_controller ];
			}
			if( controllers == null && unit.indexOf("按钮[") != -1 ){
				unit = unit.replace("按钮[","");
				unit = unit.replace("]","");
				var controller_id = Number(unit);
				var temp_controller = $gameSystem._drill_GBu_dataTank_curController[ controller_id -1 ];
				if( temp_controller == undefined ){ return; }
				controllers = [ temp_controller ];
			}
		}
		if( controllers == null ){ return; }
		
		/*-----------------激活/封印------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "激活" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setActive( true );
				}
			}
			if( type == "封印" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setActive( false );
				}
			}
		}
		
		/*-----------------按钮属性------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "播放一次自移动效果" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_playSlideAnim();
				}
			}
			if( type == "强制播放一次自移动效果" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_playSlideAnim_Private();
				}
			}
		}
		
		/*-----------------常规指令------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "显示" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setVisible( true );
				}
			}
			if( type == "隐藏" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setVisible( false );
				}
			}
			if( type == "暂停" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPause( true );
				}
			}
			if( type == "继续" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPause( false );
				}
			}
			if( type.indexOf("切换混合模式[") != -1 ){
				type = type.replace("切换混合模式[","");
				type = type.replace("]","");
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setBlendMode( Number(type) );
				}
			}
			if( type.indexOf("切换地图层级[") != -1 ){
				type = type.replace("切换地图层级[","");
				type = type.replace("]","");
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setLayerIndex( String(type) );
				}
			}
			if( type.indexOf("切换图片层级[") != -1 ){
				type = type.replace("切换图片层级[","");
				type = type.replace("]","");
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setZIndex( Number(type) );
				}
			}
			if( type == "还原混合模式" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_restoreBlendMode();
				}
			}
			if( type == "还原地图层级" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_restoreLayerIndex();
				}
			}
			if( type == "还原图片层级" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_restoreZIndex();
				}
			}
		}
		if( args.length == 6 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			if( type == "修改中心锚点" && temp1.indexOf("锚点[") != -1 ){
				temp1 = temp1.replace("锚点[","");
				temp1 = temp1.replace("]","");
				var temp_arr = temp1.split(/[,，]/);
				if( temp_arr.length >= 2 ){
					for( var k=0; k < controllers.length; k++ ){
						controllers[k]._drill_change_anchor_x = Number(temp_arr[0]);
						controllers[k]._drill_change_anchor_y = Number(temp_arr[1]);
					}
				}
			}
		}
		
		/*-----------------获取属性------------------*/
		if( args.length == 8 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var temp2 = String(args[7]);
			if( type == "获取属性" ){
				temp2 = temp2.replace("变量[","");
				temp2 = temp2.replace("变量%[","");
				temp2 = temp2.replace("]","");
				if( temp1 == "位置X" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_x );
				}
				if( temp1 == "位置Y" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_y );
				}
				if( temp1 == "透明度" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_opacity );
				}
				if( temp1 == "旋转" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_rotate );
				}
				if( temp1 == "转速" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_childGIF_rotateSpeed );
				}
				if( temp1 == "缩放X" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_scaleX *100 );
				}
				if( temp1 == "缩放Y" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_scaleY *100 );
				}
				if( temp1 == "斜切X" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_skewX *100 );
				}
				if( temp1 == "斜切Y" ){
					$gameVariables.setValue( Number(temp2), controllers[0]._drill_change_skewY *100 );
				}
			}
		}
		
		/*-----------------D指令叠加变化------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "立即还原所有单属性" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_commandChange_restoreAttr();
				}
			}
			if( type == "移动到-立即归位" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_commandChange_restoreMove();
				}
			}
		}
		if( args.length == 8 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var temp2 = String(args[7]);
			if( type == "修改单属性" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				
				if( temp1.indexOf("透明度[") != -1 ||
					temp1.indexOf("透明度变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setOpacity(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("旋转[") != -1 ||
					temp1.indexOf("旋转变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setRotate(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("转速[") != -1 ||
					temp1.indexOf("转速变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setRotateSpeed(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("缩放X[") != -1 ||
					temp1.indexOf("缩放X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setScaleX(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("缩放Y[") != -1 ||
					temp1.indexOf("缩放Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setScaleY(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("斜切X[") != -1 ||
					temp1.indexOf("斜切X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setSkewX(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
				if( temp1.indexOf("斜切Y[") != -1 ||
					temp1.indexOf("斜切Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setSkewY(
							"匀速变化", num_list[0], Number(temp2)
						);
					}
				}
			}
			if( type == "移动到-匀速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setMove(
							"匀速变化", num_list[0], num_list[1], Number(temp2)
						);
					}
				}
			}
			if( type == "移动到-弹性移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setMove(
							"弹性变化", num_list[0], num_list[1], Number(temp2)
						);
					}
				}
			}
			if( type == "移动到-增减速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_commandChange_setMove(
							"增减速变化", num_list[0], num_list[1], Number(temp2)
						);
					}
				}
			}
		}
		
		/*-----------------E延迟指令------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "立即取消全部延迟指令" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_clearDelayingCommand();
				}
			}
		}
		if( args.length == 6 ){
			var type = String(args[3]);
			var delay_time = String(args[5]);
			if( type == "全部延迟指令增加延迟" ){
				delay_time = delay_time.replace("时间[","");
				delay_time = delay_time.replace("]","");
				for( var k=0; k < controllers.length; k++ ){
					var temp_controller = controllers[k];
					var temp_time = 0;
					if( delay_time == "周期播放完的时间" ){
						temp_time = temp_controller.drill_controller_periodizeCommand_getWaitAndClearTime();
					}else{
						temp_time = Number(delay_time);
					}
					temp_controller.drill_controller_addDelayingTime( temp_time );
				}
			}
		}
		if( args.length == 6 ){
			var type = String(args[3]);
			var delay_time = String(args[5]);
			if( type == "显示(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setVisible, [true], delay_time
					);
				}
			}
			if( type == "隐藏(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setVisible, [false], delay_time
					);
				}
			}
			if( type == "暂停(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setPause, [true], delay_time
					);
				}
			}
			if( type == "继续(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setPause, [false], delay_time
					);
				}
			}
			if( type == "暂停周期指令(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_setPause, [true], delay_time
					);
				}
			}
			if( type == "继续周期指令(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_setPause, [false], delay_time
					);
				}
			}
			if( type == "清空周期指令(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_clear, [], delay_time
					);
				}
			}
			
			if( type.indexOf("切换混合模式(延迟)[") != -1 ){
				type = type.replace("切换混合模式(延迟)[","");
				type = type.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setBlendMode, [Number(type)], delay_time
					);
				}
			}
			if( type.indexOf("切换地图层级(延迟)[") != -1 ){
				type = type.replace("切换地图层级(延迟)[","");
				type = type.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex, [String(type)], delay_time
					);
				}
			}
			if( type.indexOf("切换图片层级(延迟)[") != -1 ){
				type = type.replace("切换图片层级(延迟)[","");
				type = type.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setZIndex, [Number(type)], delay_time
					);
				}
			}
			if( type == "还原混合模式(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode, [], delay_time
					);
				}
			}
			if( type == "还原地图层级(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex, [], delay_time
					);
				}
			}
			if( type == "还原图片层级(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex, [], delay_time
					);
				}
			}
			if( type == "还原所有单属性(延迟)" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr, [], delay_time
					);
				}
			}
			if( type == "移动到(延迟)-延迟归位" ){
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove, [], delay_time
					);
				}
			}
		}
		if( args.length == 10 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var temp2 = String(args[7]);
			var delay_time = String(args[9]);
			if( type == "修改单属性(延迟)" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				
				if( temp1.indexOf("透明度[") != -1 ||
					temp1.indexOf("透明度变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity, 
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("旋转[") != -1 ||
					temp1.indexOf("旋转变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate,
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("转速[") != -1 ||
					temp1.indexOf("转速变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed,
							["匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("缩放X[") != -1 ||
					temp1.indexOf("缩放X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX,
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("缩放Y[") != -1 ||
					temp1.indexOf("缩放Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY,
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("斜切X[") != -1 ||
					temp1.indexOf("斜切X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX,
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
				if( temp1.indexOf("斜切Y[") != -1 ||
					temp1.indexOf("斜切Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY,
							[ "匀速变化", num_list[0], Number(temp2) ], delay_time
						);
					}
				}
			}
			if( type == "移动到(延迟)-匀速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "匀速变化", num_list[0], num_list[1], Number(temp2) ], delay_time
						);
					}
				}
			}
			if( type == "移动到(延迟)-弹性移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "弹性变化", num_list[0], num_list[1], Number(temp2) ], delay_time
						);
					}
				}
			}
			if( type == "移动到(延迟)-增减速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				delay_time = delay_time.replace("延迟执行时间[","");
				delay_time = delay_time.replace("]","");
				delay_time = Number( delay_time );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setDelayingCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "增减速变化", num_list[0], num_list[1], Number(temp2) ], delay_time
						);
					}
				}
			}
		}
		/*-----------------E延迟指令 + O播放GIF------------------*/
		if( args.length == 6 ){
			var type = String(args[3]);
			var delay_time = String(args[5]);
			delay_time = delay_time.replace("延迟执行时间[","");
			delay_time = delay_time.replace("]","");
			delay_time = Number( delay_time );
			if( type == "锁定帧(延迟)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked,
						[ true ], delay_time
					);
				}
			}
			if( type == "解锁帧(延迟)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked,
						[ false ], delay_time
					);
				}
			}
			if( type == "正向播放一次并停留在末尾帧(延迟)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay,
						[ "forwardRun" ], delay_time
					);
				}
			}
			if( type == "反向播放一次并停留在起始帧(延迟)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay,
						[ "backRun" ], delay_time
					);
				}
			}
		}
		if( args.length == 8 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var delay_time = String(args[7]);
			delay_time = delay_time.replace("延迟执行时间[","");
			delay_time = delay_time.replace("]","");
			delay_time = Number( delay_time );
			var num_list = DrillUp.drill_GBu_getArgNumList( temp1 );
			
			if( type == "设置帧(延迟)" || type == "设置当前帧(延迟)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setDelayingCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame,
						[ num_list[0]-1 ], delay_time
					);
				}
			}
		}
		
		/*-----------------F周期指令------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "暂停周期指令" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_periodizeCommand_setPause( true );
				}
			}
			if( type == "继续周期指令" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_periodizeCommand_setPause( false );
				}
			}
			if( type == "清空周期指令(立刻)" || type == "清空周期指令" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_periodizeCommand_clear();
				}
			}
			if( type == "暂停周期指令(周期末尾时)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_periodizeCommand_waitAndPause();
				}
			}
			if( type == "清空周期指令(周期末尾时)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_periodizeCommand_waitAndClear();
				}
			}
			if( type == "执行等待(周期末尾时)" ){
				if( controllers.length > 0 ){	//（只取第一个控制器的时间，因为批量控制器不需要叠加等待时间）
					var result_time = controllers[0].drill_controller_periodizeCommand_getWaitAndClearTime();
					if( gameInterpreter != undefined ){
						gameInterpreter.wait(result_time);		//『强制等待』
					}
				}
			}
		}
		if( args.length == 8 ){
			var type = String(args[3]);
			var time_period = String(args[5]);
			var time_start = String(args[7]);
			if( type == "添加周期-显示(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setVisible, [true], time_period, time_start
					);
				}
			}
			if( type == "添加周期-隐藏(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setVisible, [false], time_period, time_start
					);
				}
			}
			if( type == "添加周期-暂停(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setPause, [true], time_period, time_start
					);
				}
			}
			if( type == "添加周期-继续(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setPause, [false], time_period, time_start
					);
				}
			}
			if( type.indexOf("添加周期-切换混合模式(周期)[") != -1 ){
				type = type.replace("添加周期-切换混合模式(周期)[","");
				type = type.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setBlendMode, [Number(type)], time_period, time_start
					);
				}
			}
			if( type.indexOf("添加周期-切换地图层级(周期)[") != -1 ){
				type = type.replace("添加周期-切换地图层级(周期)[","");
				type = type.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex, [String(type)], time_period, time_start
					);
				}
			}
			if( type.indexOf("添加周期-切换图片层级(周期)[") != -1 ){
				type = type.replace("添加周期-切换图片层级(周期)[","");
				type = type.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_setZIndex, [Number(type)], time_period, time_start
					);
				}
			}
			if( type == "添加周期-还原混合模式(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode, [], time_period, time_start
					);
				}
			}
			if( type == "添加周期-还原地图层级(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex, [], time_period, time_start
					);
				}
			}
			if( type == "添加周期-还原图片层级(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex, [], time_period, time_start
					);
				}
			}
			if( type == "添加周期-还原所有单属性(周期)" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr, [], time_period, time_start
					);
				}
			}
			if( type == "添加周期-移动到(周期)-执行归位" ){
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove, [], time_period, time_start
					);
				}
			}
		}
		if( args.length == 12 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var temp2 = String(args[7]);
			var time_period = String(args[9]);
			var time_start = String(args[11]);
			if( type == "添加周期-修改单属性(周期)" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				
				if( temp1.indexOf("透明度[") != -1 ||
					temp1.indexOf("透明度变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity, 
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("旋转[") != -1 ||
					temp1.indexOf("旋转变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate,
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("转速[") != -1 ||
					temp1.indexOf("转速变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed,
							["匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("缩放X[") != -1 ||
					temp1.indexOf("缩放X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX,
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("缩放Y[") != -1 ||
					temp1.indexOf("缩放Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY,
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("斜切X[") != -1 ||
					temp1.indexOf("斜切X变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX,
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
				if( temp1.indexOf("斜切Y[") != -1 ||
					temp1.indexOf("斜切Y变量%[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY,
							[ "匀速变化", num_list[0], Number(temp2) ], time_period, time_start
						);
					}
				}
			}
			if( type == "添加周期-移动到(周期)-匀速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "匀速变化", num_list[0], num_list[1], Number(temp2) ], time_period, time_start
						);
					}
				}
			}
			if( type == "添加周期-移动到(周期)-弹性移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "弹性变化", num_list[0], num_list[1], Number(temp2) ], time_period, time_start
						);
					}
				}
			}
			if( type == "添加周期-移动到(周期)-增减速移动" ){
				temp2 = temp2.replace("时间[","");
				temp2 = temp2.replace("]","");
				time_period = time_period.replace("周期时长[","");
				time_period = time_period.replace("]","");
				time_period = Number( time_period );
				time_start = time_start.replace("周期内开始时间[","");
				time_start = time_start.replace("]","");
				time_start = Number( time_start );
				if( temp1.indexOf("位置[") != -1 ||
					temp1.indexOf("位置变量[") != -1 ){
					var num_list = DrillUp.drill_GBu_getArgNumList(temp1);
					for( var k=0; k < controllers.length; k++ ){
						controllers[k].drill_controller_setPeriodizeCommand(
							Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove,
							[ "增减速变化", num_list[0], num_list[1], Number(temp2) ], time_period, time_start
						);
					}
				}
			}
		}
		/*-----------------F周期指令 + O播放GIF------------------*/
		if( args.length == 8 ){
			var type = String(args[3]);
			var time_period = String(args[5]);
			var time_start = String(args[7]);
			time_period = time_period.replace("周期时长[","");
			time_period = time_period.replace("]","");
			time_period = Number( time_period );
			time_start = time_start.replace("周期内开始时间[","");
			time_start = time_start.replace("]","");
			time_start = Number( time_start );
			if( type == "添加周期-锁定帧(周期)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked,
						[ true ], time_period, time_start
					);
				}
			}
			if( type == "添加周期-解锁帧(周期)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked,
						[ false ], time_period, time_start
					);
				}
			}
		}
		if( args.length == 10 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var time_period = String(args[7]);
			var time_start = String(args[9]);
			time_period = time_period.replace("周期时长[","");
			time_period = time_period.replace("]","");
			time_period = Number( time_period );
			time_start = time_start.replace("周期内开始时间[","");
			time_start = time_start.replace("]","");
			time_start = Number( time_start );
			var num_list = DrillUp.drill_GBu_getArgNumList( temp1 );
			
			if( type == "添加周期-设置帧(周期)" || type == "添加周期-设置当前帧(周期)" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_setPeriodizeCommand(
						Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame,
						[ num_list[0]-1 ], time_period, time_start
					);
				}
			}
		}
		
		/*-----------------O播放GIF------------------*/
		if( args.length == 4 ){
			var type = String(args[3]);
			if( type == "锁定帧" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_GIF_setLocked( true );
				}
			}
			if( type == "解锁帧" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_GIF_setLocked( false );
				}
			}
			if( type == "正向播放一次并停留在末尾帧" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_GIF_setOncePlay( "forwardRun" );
				}
			}
			if( type == "反向播放一次并停留在起始帧" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_GIF_setOncePlay( "backRun" );
				}
			}
		}
		if( args.length == 6 ){
			var type = String(args[3]);
			var temp1 = String(args[5]);
			var num_list = DrillUp.drill_GBu_getArgNumList( temp1 );
			
			if( type == "设置帧" || type == "设置当前帧" ){
				for( var k=0; k < controllers.length; k++ ){
					controllers[k].drill_controller_GIF_setFrame( num_list[0]-1 );
				}
			}
		}
	}
};
//==============================
// * 插件指令 - 获取方括号中的数字
//
//			参数：	> arg_str 字符串
//			返回：	> 数字数组
//
//			说明：	> 能获取到字符串中的数字，且包含 变量 转换情况。
//==============================
DrillUp.drill_GBu_getArgNumList = function( arg_str ){
	var arr = arg_str.match( /([^\[]+)\[([^\]]+)\]/ );
	if( arr != undefined && arr.length >= 3 ){
	// > 有方括号
		var data_name = arr[1];
		var data_list = arr[2].split(",");
		var result_list = [];
		
		if( data_name.contains("变量%") ){	//（将变量值赋值给目标，需要*0.01）
			for(var i=0; i < data_list.length; i++){ result_list.push( $gameVariables.value(Number(data_list[i]))*0.01 ); }
			return result_list;
		}else if( data_name.contains("变量") ){
			for(var i=0; i < data_list.length; i++){ result_list.push( $gameVariables.value(Number(data_list[i])) ); }
			return result_list;
		}else{
			for(var i=0; i < data_list.length; i++){ result_list.push( Number(data_list[i]) ); }
			return result_list;
		}
	}else{
	// > 没有方括号
		var data_list = arg_str.split(",");
		var result_list = [];
		for(var i=0; i < data_list.length; i++){ result_list.push( Number(data_list[i]) ); }
		return result_list;
	}
};


//=============================================================================
// ** ☆预加载
//
//			说明：	> 对指定资源贴图标记不删除，可以防止重建导致的浪费资源，以及资源显示时闪烁问题。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 预加载 - 初始化
//==============================
var _drill_GBu_preload_initialize = Game_Temp.prototype.initialize;
Game_Temp.prototype.initialize = function() {
	_drill_GBu_preload_initialize.call(this);
	this.drill_GBu_preloadInit();
}
//==============================
// * 预加载 - 版本校验
//==============================
if( Utils.generateRuntimeId == undefined ){
	alert( DrillUp.drill_GBu_getPluginTip_LowVersion() );
}
//==============================
// * 预加载 - 执行资源预加载
//
//			说明：	> 遍历全部资源，提前预加载标记过的资源。
//==============================
Game_Temp.prototype.drill_GBu_preloadInit = function() {
	this._drill_GBu_cacheId = Utils.generateRuntimeId();	//资源缓存id
	this._drill_GBu_preloadTank = [];						//bitmap容器
	for( var i = 0; i < DrillUp.g_GBu_style.length; i++ ){
		var temp_data = DrillUp.g_GBu_style[i];
		if( temp_data == undefined ){ continue; }
		
		// > P预加载GIF管理
		if( temp_data['preloadType'] == "全部预加载" ){
			var src_img_num = temp_data['src_img_gif'].length;
			for( var k = 0; k < src_img_num; k++ ){
				this._drill_GBu_preloadTank.push( 
					ImageManager.reserveBitmap( temp_data['src_img_file'], temp_data['src_img_gif'][k], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
				);
			}
		}
		if( temp_data['preloadType'] == "固定预加载数量" ){
			var src_img_num = temp_data['preloadNum'];
			if( src_img_num >= temp_data['src_img_gif'].length ){ src_img_num = temp_data['src_img_gif'].length; }
			for( var k = 0; k < src_img_num; k++ ){
				this._drill_GBu_preloadTank.push( 
					ImageManager.reserveBitmap( temp_data['src_img_file'], temp_data['src_img_gif'][k], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
				);
			}
		}
		
		// > 2A激活与封印
		if( temp_data['deactive_enabled'] == true ){
			this._drill_GBu_preloadTank.push( 
				ImageManager.reserveBitmap( temp_data['deactive_src_img_file'], temp_data['deactive_src_img'], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
			);
		}
		
		// > 2E高亮与按下
		if( temp_data['highlight_mode'].indexOf("关闭") == -1 ){	//（不关闭时，需要预加载）
			this._drill_GBu_preloadTank.push( 
				ImageManager.reserveBitmap( temp_data['highlight_src_img_file'], temp_data['highlight_src_img'], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
			);
		}
		if( temp_data['pushdown_mode'].indexOf("关闭") == -1 ){		//（不关闭时，需要预加载）
			this._drill_GBu_preloadTank.push( 
				ImageManager.reserveBitmap( temp_data['pushdown_src_img_file'], temp_data['pushdown_src_img'], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
			);
		}
		if( temp_data['highlightD_mode'].indexOf("关闭") == -1 ){	//（不关闭时，需要预加载）
			this._drill_GBu_preloadTank.push( 
				ImageManager.reserveBitmap( temp_data['highlightD_src_img_file'], temp_data['highlightD_src_img'], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
			);
		}
		if( temp_data['pushdownD_mode'].indexOf("关闭") == -1 ){	//（不关闭时，需要预加载）
			this._drill_GBu_preloadTank.push( 
				ImageManager.reserveBitmap( temp_data['pushdownD_src_img_file'], temp_data['pushdownD_src_img'], temp_data['tint'], temp_data['smooth'], this._drill_GBu_cacheId ) 
			);
		}
	}
}


//#############################################################################
// ** 【标准模块】存储数据 ☆存储数据
//#############################################################################
//##############################
// * 存储数据 - 参数存储 开关
//          
//			说明：	> 如果该插件开放了用户可以修改的参数，就注释掉。
//##############################
DrillUp.g_GBu_saveEnabled = true;
//##############################
// * 存储数据 - 初始化
//          
//			说明：	> 下方为固定写法，不要动。
//##############################
var _drill_GBu_sys_initialize = Game_System.prototype.initialize;
Game_System.prototype.initialize = function() {
    _drill_GBu_sys_initialize.call(this);
	this.drill_GBu_initSysData();
};
//##############################
// * 存储数据 - 载入存档
//          
//			说明：	> 下方为固定写法，不要动。
//##############################
var _drill_GBu_sys_extractSaveContents = DataManager.extractSaveContents;
DataManager.extractSaveContents = function( contents ){
	_drill_GBu_sys_extractSaveContents.call( this, contents );
	
	// > 参数存储 启用时（检查数据）
	if( DrillUp.g_GBu_saveEnabled == true ){	
		$gameSystem.drill_GBu_checkSysData();
		
	// > 参数存储 关闭时（直接覆盖）
	}else{
		$gameSystem.drill_GBu_initSysData();
	}
};
//##############################
// * 存储数据 - 初始化数据【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，执行数据初始化，并存入存档数据中。
//##############################
Game_System.prototype.drill_GBu_initSysData = function() {
	this.drill_GBu_initSysData_Private();
};
//##############################
// * 存储数据 - 载入存档时检查数据【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，载入存档时执行的数据检查操作。
//##############################
Game_System.prototype.drill_GBu_checkSysData = function() {
	this.drill_GBu_checkSysData_Private();
};
//=============================================================================
// ** 存储数据（接口实现）
//=============================================================================
//==============================
// * 存储数据 - 初始化数据（私有）
//==============================
Game_System.prototype.drill_GBu_initSysData_Private = function() {
	
	this._drill_GBu_dataTank_curController = [];							//按钮数据容器
	for( var i = 0; i < DrillUp.g_GBu_style.length; i++ ){
		var temp_data = DrillUp.g_GBu_style[i];
		if( temp_data == undefined ){ continue; }
		
		var temp_controller = new Drill_GBu_Controller( i );
		this._drill_GBu_dataTank_curController[i] = temp_controller;
	}
};
//==============================
// * 存储数据 - 载入存档时检查数据（私有）
//==============================
Game_System.prototype.drill_GBu_checkSysData_Private = function() {
	
	// > 旧存档数据自动补充
	if( this._drill_GBu_dataTank_curController == undefined ){
		this.drill_GBu_initSysData();
	}
	
	// > 容器的 空数据 检查
	for( var i = 0; i < DrillUp.g_GBu_style.length; i++ ){
		var temp_data = DrillUp.g_GBu_style[i];
		
		// > 已配置（undefined表示未配置的空数据）
		if( temp_data != undefined ){
			
			// > 未存储的，重新初始化
			if( this._drill_GBu_dataTank_curController[i] == undefined ){
				var temp_controller = new Drill_GBu_Controller( i );
				this._drill_GBu_dataTank_curController[i] = temp_controller;
			
			// > 已存储的，跳过
			}else{
				//（不操作）
			}
		}
	}
};


//#############################################################################
// ** 【标准模块】地图层级 ☆地图层级
//#############################################################################
//##############################
// * 地图层级 - 添加贴图到层级【标准函数】
//				
//			参数：	> sprite 贴图        （添加的贴图对象）
//					> layer_index 字符串 （添加到的层级名，下层/中层/上层/图片层/最顶层）
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，将指定贴图添加到目标层级中。
//##############################
Scene_Map.prototype.drill_GBu_layerAddSprite = function( sprite, layer_index ){
	this.drill_GBu_layerAddSprite_Private( sprite, layer_index );
}
//##############################
// * 地图层级 - 去除贴图【标准函数】
//				
//			参数：	> sprite 贴图（添加的贴图对象）
//			返回：	> 无
//          
//			说明：	> 强行规范的接口，将指定贴图从地图层级中移除。
//##############################
Scene_Map.prototype.drill_GBu_layerRemoveSprite = function( sprite ){
	//（无）
}
//##############################
// * 地图层级 - 图片层级排序【标准函数】
//				
//			参数：	> 无
//			返回：	> 无
//          
//			说明：	> 执行该函数后，地图层级的子贴图，按照zIndex属性来进行先后排序。值越大，越靠前。
//##############################
Scene_Map.prototype.drill_GBu_sortByZIndex = function(){
    this.drill_GBu_sortByZIndex_Private();
}
//=============================================================================
// ** 地图层级（接口实现）
//=============================================================================
//==============================
// * 地图层级 - 图片层
//==============================
var _drill_GBu_layer_createPictures = Spriteset_Map.prototype.createPictures;
Spriteset_Map.prototype.createPictures = function() {
	_drill_GBu_layer_createPictures.call(this);		//图片对象层 < 图片层 < 对话框集合
	if(!this._drill_mapPicArea ){
		this._drill_mapPicArea = new Sprite();
		this.addChild(this._drill_mapPicArea);	
	}
}
//==============================
// * 地图层级 - 最顶层
//==============================
var _drill_GBu_layer_createAllWindows = Scene_Map.prototype.createAllWindows;
Scene_Map.prototype.createAllWindows = function() {
	_drill_GBu_layer_createAllWindows.call(this);	//对话框集合 < 最顶层
	if( !this._drill_SenceTopArea ){
		this._drill_SenceTopArea = new Sprite();
		this.addChild(this._drill_SenceTopArea);	
	}
}
//==============================
// * 地图层级 - 参数定义
//
//			说明：	> 所有drill插件的贴图都用唯一参数：zIndex（可为小数、负数），其它插件没有此参数定义。
//==============================
if( typeof(_drill_sprite_zIndex) == "undefined" ){						//（防止重复定义）
	var _drill_sprite_zIndex = true;
	Object.defineProperty( Sprite.prototype, 'zIndex', {
		set: function( value ){
			this.__drill_zIndex = value;
		},
		get: function(){
			if( this.__drill_zIndex == undefined ){ return 20250701; }	//（如果未定义则放最上面）
			return this.__drill_zIndex;
		},
		configurable: true
	});
};
//==============================
// * 地图层级 - 图片层级排序（私有）
//==============================
Scene_Map.prototype.drill_GBu_sortByZIndex_Private = function() {
	this._spriteset._drill_mapPicArea.children.sort(function(a, b){return a.zIndex-b.zIndex});
	this._drill_SenceTopArea.children.sort(function(a, b){return a.zIndex-b.zIndex});
};
//==============================
// * 地图层级 - 添加贴图到层级（私有）
//==============================
Scene_Map.prototype.drill_GBu_layerAddSprite_Private = function( sprite, layer_index ){
	if( layer_index == "图片层" ){
		this._spriteset._drill_mapPicArea.addChild( sprite );
	}
	if( layer_index == "最顶层" ){
		this._drill_SenceTopArea.addChild( sprite );
	}
}



//=============================================================================
// ** ☆地图点击拦截
//
//			说明：	> 此模块专门管理 地图点击拦截，只要有鼠标悬停时，就阻止地图点击功能。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 地图点击拦截 - 点击监听
//==============================
var _drill_GBu_processMapTouch = Scene_Map.prototype.processMapTouch;
Scene_Map.prototype.processMapTouch = function() {	
	if( this.drill_GBu_isOnGaugeButton() ){ return; }	//ui按钮按下（阻止目的地+鼠标辅助面板）
	_drill_GBu_processMapTouch.call(this);
};
//==============================
// * 地图点击拦截 - 条件
//==============================
Scene_Map.prototype.drill_GBu_isOnGaugeButton = function() {
	for(var i = 0; i < $gameSystem._drill_GBu_dataTank_curController.length; i++ ){
		var temp_controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( temp_controller == undefined ){ continue; }
		if( temp_controller.drill_controller_isOnHover() == true ){
			return true;
		}
	}
	return false;	
};


//=============================================================================
// ** ☆控制器与贴图
//
//			说明：	> 此模块专门管理 贴图 的创建与销毁。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 控制器与贴图 - 容器初始化
//==============================
var _drill_GBu_temp_initialize2 = Game_Temp.prototype.initialize;
Game_Temp.prototype.initialize = function(){
	_drill_GBu_temp_initialize2.call(this);
	this._drill_GBu_spriteTank = [];			//贴图容器
};
//==============================
// * 控制器与贴图 - 销毁时（地图界面）
//==============================
var _drill_GBu_smap_terminate = Scene_Map.prototype.terminate;
Scene_Map.prototype.terminate = function(){
	_drill_GBu_smap_terminate.call(this);
	$gameTemp._drill_GBu_spriteTank = [];		//贴图容器
};
//==============================
// * 控制器与贴图 - 帧刷新（地图界面）
//==============================
var _drill_GBu_smap_update = Scene_Map.prototype.update;
Scene_Map.prototype.update = function(){
	_drill_GBu_smap_update.call(this);
	this.drill_GBu_updateControllerCamera();	//帧刷新 - 控制器
	this.drill_GBu_updateAttr();				//帧刷新 - 基础特性
	this.drill_GBu_updateDestroy();				//帧刷新 - 销毁
	this.drill_GBu_updateOnlyHover();			//帧刷新 - 唯一悬停
};
//==============================
// * 控制器与贴图 - 界面创建时（地图界面）
//==============================
var _drill_GBu_smap_createAllWindows = Scene_Map.prototype.createAllWindows;
Scene_Map.prototype.createAllWindows = function(){
	_drill_GBu_smap_createAllWindows.call(this);
	this.drill_GBu_create();
};
//==============================
// * 控制器与贴图 - 界面创建
//==============================
Scene_Map.prototype.drill_GBu_create = function(){
	$gameTemp._drill_GBu_spriteTank = [];			//贴图容器（不允许出现null值）
	
	for(var i=0; i< $gameSystem._drill_GBu_dataTank_curController.length; i++){
		var temp_controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( temp_controller == undefined ){ continue; }
		
		
		// > 创建贴图
		var temp_sprite = new Drill_GBu_Sprite();
		temp_sprite.drill_sprite_setController( temp_controller );
		temp_sprite.drill_sprite_initChild();
		
		
		// > 添加贴图到层级
		$gameTemp._drill_GBu_spriteTank.push( temp_sprite );
		this.drill_GBu_layerAddSprite( temp_sprite, temp_controller._drill_layerIndex );
	}
	
	// > 层级排序
	this.drill_GBu_sortByZIndex();
	
	
	// > 开始播放（2B自移动效果）
	for(var i=0; i< $gameSystem._drill_GBu_dataTank_curController.length; i++){
		var temp_controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( temp_controller == undefined ){ continue; }
		temp_controller.drill_controller_playSlideAnim();
	}
}
//==============================
// * 控制器与贴图 - 帧刷新 控制器
//==============================
Scene_Map.prototype.drill_GBu_updateControllerCamera = function(){
	for(var i = 0; i < $gameSystem._drill_GBu_dataTank_curController.length; i++ ){
		var temp_controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( temp_controller == undefined ){ continue; }
		
		// > 控制器帧刷新
		temp_controller.drill_controller_update();
	}
}
//==============================
// * 控制器与贴图 - 帧刷新 基础特性
//==============================
Scene_Map.prototype.drill_GBu_updateAttr = function(){
	var has_layerChange = false;
	for(var i = 0; i < $gameTemp._drill_GBu_spriteTank.length; i++){
		var temp_sprite = $gameTemp._drill_GBu_spriteTank[i];
		if( temp_sprite == undefined ){ continue; }
		var temp_controller = temp_sprite._drill_controller;
		if( temp_controller == undefined ){ continue; }
		
		// > 基础特性 - 地图层级
		if( temp_sprite.layerIndex != temp_controller._drill_layerIndex ){
			temp_sprite.layerIndex =  temp_controller._drill_layerIndex;
			this.drill_GBu_layerAddSprite( temp_sprite, temp_controller._drill_layerIndex );
			has_layerChange = true;
		}
		// > 基础特性 - 图片层级
		if( temp_sprite.zIndex != temp_controller._drill_zIndex ){
			temp_sprite.zIndex =  temp_controller._drill_zIndex;
			has_layerChange = true;
		}
	};
	
	// > 层级排序
	if( has_layerChange == true ){
		this.drill_GBu_sortByZIndex();
	}
}
//==============================
// * 控制器与贴图 - 帧刷新 销毁
//==============================
Scene_Map.prototype.drill_GBu_updateDestroy = function(){
	
	// > 自动销毁 - 控制器
	for(var i = $gameSystem._drill_GBu_dataTank_curController.length-1; i >= 0; i--){
		var temp_controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( temp_controller == undefined ){ continue; }
		if( temp_controller.drill_controller_isDead() ){
			$gameSystem._drill_GBu_dataTank_curController.splice(i,1);
		}
	}
	
	// > 自动销毁 - 贴图
	for(var i = $gameTemp._drill_GBu_spriteTank.length-1; i >= 0; i--){
		var temp_sprite = $gameTemp._drill_GBu_spriteTank[i];
		if( temp_sprite.drill_sprite_isNeedDestroy() ){
			this.drill_GBu_layerRemoveSprite( temp_sprite );	//（销毁贴图）
			$gameTemp._drill_GBu_spriteTank.splice(i,1);
			temp_sprite.drill_sprite_destroy();
		}
	}
};


//=============================================================================
// ** ☆唯一悬停
//
//			说明：	> 此模块确保 多个按钮之间互斥，不能同时按多个按钮。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * 唯一悬停 - 初始化
//==============================
var _drill_GBu_temp_initialize3 = Game_Temp.prototype.initialize;
Game_Temp.prototype.initialize = function(){
	_drill_GBu_temp_initialize3.call(this);
	this._drill_GBu_curControllerSerial = -1;
};
//==============================
// * 唯一悬停 - 帧刷新
//==============================
Scene_Map.prototype.drill_GBu_updateOnlyHover = function(){
	var has_hover = false;
	for(var i = 0; i < $gameSystem._drill_GBu_dataTank_curController.length; i++ ){
		var controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( controller.drill_controller_isOnHover() == true ){
			has_hover = true;
			$gameTemp._drill_GBu_curControllerSerial = controller._drill_controllerSerial;
			break;
		}
	}
	if( has_hover == false ){
		$gameTemp._drill_GBu_curControllerSerial = -1;
	}
};



//=============================================================================
// ** 按钮控制器【Drill_GBu_Controller】
// **		
// **		作用域：	地图界面
// **		主功能：	定义一个专门控制按钮的数据类。
// **		子功能：	
// **					->控制器『控制器与贴图』
// **						->帧刷新
// **						->重设数据
// **							->序列号
// **						->显示/隐藏
// **						->暂停/继续
// **						->销毁
// **					
// **					->A主体『界面装饰最终变换值』『变换特性的规范』
// **						->基础特性
// **							>  资源名
// **							>  显示/隐藏
// **							>  暂停/继续
// **							>  混合模式
// **							>  层级
// **							>  堆叠级
// **						->其它特性
// **					->B变换特性『变换特性-单贴图』
// **						>  锚点X
// **						>  锚点Y
// **						>  位置X
// **						>  位置Y
// **						>  缩放X
// **						>  缩放Y
// **						>  透明度
// **						>  斜切X
// **						>  斜切Y
// **						>  旋转
// **						>  转速
// **					->C校验值
// **					->D指令叠加变化
// **						> 主体贴图>移动到
// **						> 主体贴图>透明度
// **						> 主体贴图>旋转
// **						> 圈贴图>转速
// **						> 层贴图>缩放X
// **						> 层贴图>缩放Y
// **						> 层贴图>斜切X
// **						> 层贴图>斜切Y
// **					->E延迟指令
// **					->F周期指令
// **					->G自变化效果
// **						> 主体贴图>浮动效果
// **						> 主体贴图>闪烁效果
// **						> 圈贴图>摇晃效果
// **						> 层贴图>缩放效果
// **					
// **					->O播放GIF
// **						->设置帧
// **						->锁定帧/解锁帧
// **						->单次播放
// **					->P预加载GIF管理
// **					->Q随机位置
// **					
// **					->Z镜头参数
// **					
// **					->2A激活与封印『按钮的控制器与贴图』
// **					->2B自移动效果
// **					->2C碰撞体
// **					->2D鼠标判定
// **						->图片层/最顶层（不考虑镜头影响）
// **					->2E高亮与按下
// **					->2F按钮执行
// **					
// **		说明：	> 注意，该类不能放 物体指针、贴图指针 。
//=============================================================================
//==============================
// * 控制器 - 定义
//==============================
function Drill_GBu_Controller(){
    this.initialize.apply(this, arguments);
};
//==============================
// * 控制器 - 初始化
//==============================
Drill_GBu_Controller.prototype.initialize = function( data_id ){
	this._drill_data_id = data_id;											//样式ID（控制器与样式 多对一 或 一对一）
	this._drill_controllerSerial = new Date().getTime() + Math.random();	//『随机因子-生成一个不重复的序列号』
	//this.drill_controller_initData();										//初始化数据
	this.drill_controller_initChild();										//初始化子功能
	this.drill_controller_resetData( data_id );
}
//##############################
// * 控制器 - 帧刷新【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//			
//			说明：	> 此函数必须在 帧刷新 中手动调用执行。
//##############################
Drill_GBu_Controller.prototype.drill_controller_update = function(){
	this.drill_controller_updateDelayingCommandImportant();		//帧刷新 - E延迟指令 - 时间流逝
	this.drill_controller_updatePeriodizeCommandImportant();	//帧刷新 - F周期指令 - 时间流逝
	if( this.drill_controller_isPause() == true ){ return; }
	this.drill_controller_updateAttr();							//帧刷新 - A主体
	this.drill_controller_updateChange_Rotation();				//帧刷新 - B变换特性 - 旋转
	this.drill_controller_updateCommandChange();				//帧刷新 - D指令叠加变化
	this.drill_controller_updateDelayingCommand();				//帧刷新 - E延迟指令 - 执行延迟指令
	this.drill_controller_updatePeriodizeCommand();				//帧刷新 - F周期指令 - 执行延迟指令
	this.drill_controller_updateEffect();						//帧刷新 - G自变化效果
	
	this.drill_controller_updateGIF();							//帧刷新 - O播放GIF
																//帧刷新 - P预加载GIF管理（无）
	this.drill_controller_updateRandomPos();					//帧刷新 - Q随机位置
	
																//帧刷新 - Z镜头参数（无）
	
																//帧刷新 - 2A激活与封印（无）
	this.drill_controller_updateSlideAnim();					//帧刷新 - 2B自移动效果
																//帧刷新 - 2C碰撞体（无）
																//帧刷新 - 2D鼠标判定（无）
																//帧刷新 - 2E高亮与按下（无）
	this.drill_controller_updateButtonExecute();				//帧刷新 - 2F按钮执行
	
	this.drill_controller_updateCheckNaN();						//帧刷新 - C校验值
}
//##############################
// * 控制器 - 重设数据【标准函数】
//			
//			参数：	> data_id 数字
//			返回：	> 无
//			
//			说明：	> 通过此函数，你不需要再重新创建一个数据对象，并且贴图能直接根据此数据来变化。
//##############################
Drill_GBu_Controller.prototype.drill_controller_resetData = function( data_id ){
	this.drill_controller_resetData_Private( data_id );
};
//##############################
// * 控制器 - 显示/隐藏【标准函数】
//
//			参数：	> visible 布尔（是否显示）
//			返回：	> 无
//			
//			说明：	> 可放在帧刷新函数中实时调用。
//##############################
Drill_GBu_Controller.prototype.drill_controller_setVisible = function( visible ){
	this._drill_visible = visible;
};
//##############################
// * 控制器 - 暂停/继续【标准函数】
//
//			参数：	> pause 布尔
//			返回：	> 无
//			
//			说明：	> 可放在帧刷新函数中实时调用。
//##############################
Drill_GBu_Controller.prototype.drill_controller_setPause = function( pause ){
	this._drill_pause = pause;
};
//##############################
// * 控制器 - 设置销毁【标准函数】
//
//			参数：	> 无
//			返回：	> 布尔
//##############################
Drill_GBu_Controller.prototype.drill_controller_destroy = function(){
	this._drill_needDestroy = true;
};
//##############################
// * 控制器 - 判断销毁【标准函数】
//
//			参数：	> 无
//			返回：	> 布尔
//##############################
Drill_GBu_Controller.prototype.drill_controller_isDead = function(){
	return this._drill_needDestroy == true;
};
//==============================
// * 控制器 - 函数枚举
//
//			说明：	> 使用枚举要比字符串比较快很多，适用于大量 延迟指令、周期指令 。
//==============================
Drill_GBu_Controller.METHOD__drill_controller_setVisible                   = 11;
Drill_GBu_Controller.METHOD__drill_controller_setPause                     = 12;
Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_setPause    = 13;
Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_clear       = 14;

Drill_GBu_Controller.METHOD__drill_controller_setBlendMode                 = 21;
Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex                = 22;
Drill_GBu_Controller.METHOD__drill_controller_setZIndex                    = 23;
Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode             = 24;
Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex            = 25;
Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex                = 26;

Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity     = 31;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate      = 34;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed = 35;

Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX      = 41;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY      = 42;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX       = 43;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY       = 44;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr    = 45;

Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove        = 51;
Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove    = 52;

Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked                = 61;
Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay              = 62;
Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame                 = 63;

//##############################
// * A主体 - 切换混合模式【标准函数】
//
//			参数：	> blendMode 数字
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_setBlendMode = function( blendMode ){
	this._drill_blendMode = blendMode;
};
//##############################
// * A主体 - 切换地图层级【标准函数】
//
//			参数：	> layerIndex 字符串
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_setLayerIndex = function( layerIndex ){
	this._drill_layerIndex = layerIndex;
};
//##############################
// * A主体 - 切换图片层级【标准函数】
//
//			参数：	> zIndex 数字
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_setZIndex = function( zIndex ){
	this._drill_zIndex = zIndex;
};
//##############################
// * A主体 - 还原混合模式【标准函数】
//
//			参数：	> 无
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_restoreBlendMode = function(){
	var data = this.drill_data();
	this._drill_blendMode = data['blendMode'];
};
//##############################
// * A主体 - 还原地图层级【标准函数】
//
//			参数：	> 无
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_restoreLayerIndex = function(){
	var data = this.drill_data();
	this._drill_layerIndex = data['layerIndex'];
};
//##############################
// * A主体 - 还原图片层级【标准函数】
//
//			参数：	> 无
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_restoreZIndex = function(){
	var data = this.drill_data();
	this._drill_zIndex = data['zIndex'];
};


//##############################
// * O播放GIF - 设置帧【标准函数】
//
//			参数：	> cur_frame 数字（当前帧）
//			返回：	> 无
//			
//			说明：	> 从帧数0开始计数。
//##############################
Drill_GBu_Controller.prototype.drill_controller_GIF_setFrame = function( cur_frame ){
	var data = this.drill_data();
	
	// > 设置帧
	this._drill_GIF_time = cur_frame * data['interval'];
	if( this._drill_GIF_time < 0 ){ this._drill_GIF_time = 0; }
	
	// > 刷新索引
	var inter = this._drill_GIF_time;
	inter = inter / data['interval'];
	inter = Math.floor(inter);
	inter = inter % data['src_img_gif'].length;
	if( data['back_run'] == true ){
		inter = data['src_img_gif'].length - 1 - inter;
	}
	this._drill_GIF_index = Math.floor(inter);
};
//##############################
// * O播放GIF - 锁定帧/解锁帧【标准函数】
//
//			参数：	> locked 布尔
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_GIF_setLocked = function( locked ){
	this._drill_GIF_lockEnabled = locked;
	this._drill_GIF_oncePlay = false;
};
//##############################
// * O播放GIF - 单次播放【标准函数】
//
//			参数：	> once_type 字符串（forwardRun正向播放/backRun反向播放）
//			返回：	> 无
//##############################
Drill_GBu_Controller.prototype.drill_controller_GIF_setOncePlay = function( once_type ){
	var data = this.drill_data();
	this._drill_GIF_oncePlay = true;
	this._drill_GIF_onceType = once_type;
	this._drill_GIF_time = 0;
	this._drill_GIF_onceTarTime = data['src_img_gif'].length * data['interval'];
};

//##############################
// * 控制器 - 初始化数据『控制器与贴图』【标准默认值】
//
//			参数：	> data 对象
//			返回：	> 无
//			
//			说明：	> 该对象初始化 静态数据，提供所需的所有默认值。
//##############################
Drill_GBu_Controller.drill_controller_initData = function( data ){
	//	（该函数是静态函数，直接修改 静态数据 的指针值）
	//	（参数会有细微区别，因为此处针对 控制器 的参数，而静态数据针对 接收数据 的参数）
	
	// > A主体 - 基础特性
	if( data['src_img_gif'] == undefined ){ data['src_img_gif'] = [] };								//A主体 - 资源
	if( data['src_img_file'] == undefined ){ data['src_img_file'] = "img/Map__ui_gaugeButton/" };	//A主体 - 文件夹
	if( data['interval'] == undefined ){ data['interval'] = 4 };									//A主体 - 帧间隔
	if( data['back_run'] == undefined ){ data['back_run'] = false };								//A主体 - 是否倒放
	
	if( data['tint'] == undefined ){ data['tint'] = 0 };											//A主体 - 图像-色调值
	if( data['smooth'] == undefined ){ data['smooth'] = false };									//A主体 - 图像-模糊边缘
	
	if( data['visible'] == undefined ){ data['visible'] = true };									//A主体 - 显示/隐藏
	if( data['pause'] == undefined ){ data['pause'] = false };										//A主体 - 暂停/继续
	if( data['blendMode'] == undefined ){ data['blendMode'] = 0 };									//A主体 - 混合模式
	if( data['layerIndex'] == undefined ){ data['layerIndex'] = "图片层" };							//A主体 - 地图层级
	if( data['zIndex'] == undefined ){ data['zIndex'] = 0 };										//A主体 - 图片层级
	
	// > A主体 - 其它特性
	//...
	
	
	// > B变换特性
	if( data['x'] == undefined ){ data['x'] = 0 };													//B变换特性 - 平移X
	if( data['y'] == undefined ){ data['y'] = 0 };													//B变换特性 - 平移Y
	if( data['rotate'] == undefined ){ data['rotate'] = 0 };										//B变换特性 - 转速（单位角度）
	if( data['opacity'] == undefined ){ data['opacity'] = 255 };									//B变换特性 - 透明度
	if( data['anchor_x'] == undefined ){ data['anchor_x'] = 0.5 };									//B变换特性 - 锚点X
	if( data['anchor_y'] == undefined ){ data['anchor_y'] = 0.5 };									//B变换特性 - 锚点Y
	
	// > B变换特性 - 3d效果
	if( data['scale_x'] == undefined ){ data['scale_x'] = 1.0 };									//B变换特性 - 3d效果 - 整体缩放X
	if( data['scale_y'] == undefined ){ data['scale_y'] = 1.0 };									//B变换特性 - 3d效果 - 整体缩放Y
	if( data['skew_x'] == undefined ){ data['skew_x'] = 0 };										//B变换特性 - 3d效果 - 整体斜切X
	if( data['skew_y'] == undefined ){ data['skew_y'] = 0 };										//B变换特性 - 3d效果 - 整体斜切Y
	if( data['parentRotate'] == undefined ){ data['parentRotate'] = 0 };							//B变换特性 - 3d效果 - 整体再旋转角度（单位角度）
	
	
	// > C校验值（无）
	
	// > D指令叠加变化（无）
	
	// > E延迟指令（无）
	
	// > F周期指令（无）
	
	// > G自变化效果
	if( data['effect_float'] == undefined ){ data['effect_float'] = "关闭" };						//G自变化效果 - 浮动效果
	if( data['effect_floatSpeed'] == undefined ){ data['effect_floatSpeed'] = 1.0 };				//G自变化效果 - 浮动速度
	if( data['effect_floatRange'] == undefined ){ data['effect_floatRange'] = 15 };					//G自变化效果 - 浮动偏移量
	if( data['effect_flicker'] == undefined ){ data['effect_flicker'] = "关闭" };					//G自变化效果 - 闪烁效果
	if( data['effect_flickerSpeed'] == undefined ){ data['effect_flickerSpeed'] = 6.0 };			//G自变化效果 - 闪烁速度
	if( data['effect_flickerRange'] == undefined ){ data['effect_flickerRange'] = 20 };				//G自变化效果 - 闪烁幅度范围
	if( data['effect_swing'] == undefined ){ data['effect_swing'] = "关闭" };						//G自变化效果 - 摇晃效果
	if( data['effect_swingSpeed'] == undefined ){ data['effect_swingSpeed'] = 4.0 };				//G自变化效果 - 摇晃速度
	if( data['effect_swingRange'] == undefined ){ data['effect_swingRange'] = 12 };					//G自变化效果 - 摇晃幅度范围
	if( data['effect_zoom'] == undefined ){ data['effect_zoom'] = "关闭" };							//G自变化效果 - 缩放效果
	if( data['effect_zoomSpeed'] == undefined ){ data['effect_zoomSpeed'] = 1.0 };					//G自变化效果 - 缩放速度
	if( data['effect_zoomRange'] == undefined ){ data['effect_zoomRange'] = 0.2 };					//G自变化效果 - 缩放幅度范围
	
	// > O播放GIF
	if( data['gif_lock'] == undefined ){ data['gif_lock'] = false };								//O播放GIF - 初始是否锁定帧
	if( data['gif_initFrame'] == undefined ){ data['gif_initFrame'] = 0 };							//O播放GIF - 锁定帧数
	
	// > P预加载GIF管理
	if( data['preloadType'] == undefined ){ data['preloadType'] = "关闭预加载" };					//P预加载GIF管理 - 预加载类型
	if( data['preloadNum'] == undefined ){ data['preloadNum'] = 35 };								//P预加载GIF管理 - 固定预加载的数量
	
	// > Q随机位置
	if( data['randomPos_enable'] == undefined ){ data['randomPos_enable'] = false };				//Q随机位置 - 是否启用随机位置
	if( data['randomPos_width'] == undefined ){ data['randomPos_width'] = 50 };						//Q随机位置 - 随机位置的范围宽度
	if( data['randomPos_height'] == undefined ){ data['randomPos_height'] = 50 };					//Q随机位置 - 随机位置的范围高度
	if( data['randomPos_autoChange'] == undefined ){ data['randomPos_autoChange'] = false };		//Q随机位置 - 是否在每次播放GIF完毕后变化位置
	if( data['randomPos_gifFrame'] == undefined ){ data['randomPos_gifFrame'] = false };			//Q随机位置 - 是否随机GIF初始帧
	
	// > Z镜头参数（无）
	
	
	// > 2A激活与封印
	if( data['deactive_enabled'] == undefined ){ data['deactive_enabled'] = false };									//2A激活与封印 - 初始是否封印
	if( data['deactive_mode'] == undefined ){ data['deactive_mode'] = "贴图切换" };										//2A激活与封印 - 封印时设置
	if( data['deactive_src_img'] == undefined ){ data['deactive_src_img'] = "" };										//2A激活与封印 - 资源-封印时
	if( data['deactive_src_img_file'] == undefined ){ data['deactive_src_img_file'] = "img/Map__ui_gaugeButton/" };		//2A激活与封印 - 文件夹
	
	// > 2B自移动效果
	if( data['slideAnim_enabled'] == undefined ){ data['slideAnim_enabled'] = false };									//2B自移动效果 - 初始是否开启自移动效果
	if( data['slideAnim'] == undefined ){ data['slideAnim'] = {} };														//2B自移动效果 - 自移动效果
	
	// > 2C碰撞体（无）
	
	// > 2D鼠标判定（无）
	
	// > 2E高亮与按下 - 高亮
	if( data['highlight_mode'] == undefined ){ data['highlight_mode'] = "关闭效果" };									//2E高亮与按下 - 高亮时设置
	if( data['highlight_src_img'] == undefined ){ data['highlight_src_img'] = "" };										//2E高亮与按下 - 资源-高亮时
	if( data['highlight_src_img_file'] == undefined ){ data['highlight_src_img_file'] = "img/Map__ui_gaugeButton/" };	//2E高亮与按下 - 文件夹
	if( data['highlight_soundMode'] == undefined ){ data['highlight_soundMode'] = "关闭音效" };							//2E高亮与按下 - 高亮时音效设置
	if( data['highlight_sound'] == undefined ){ data['highlight_sound'] = {} };											//2E高亮与按下 - 高亮时的自定义音效
	
	// > 2E高亮与按下 - 按下
	if( data['pushdown_mode'] == undefined ){ data['pushdown_mode'] = "关闭效果" };										//2E高亮与按下 - 按下时设置
	if( data['pushdown_src_img'] == undefined ){ data['pushdown_src_img'] = "" };										//2E高亮与按下 - 资源-按下时
	if( data['pushdown_src_img_file'] == undefined ){ data['pushdown_src_img_file'] = "img/Map__ui_gaugeButton/" };		//2E高亮与按下 - 文件夹
	if( data['pushdown_soundMode'] == undefined ){ data['pushdown_soundMode'] = "关闭音效" };							//2E高亮与按下 - 按下时音效设置
	if( data['pushdown_sound'] == undefined ){ data['pushdown_sound'] = {} };											//2E高亮与按下 - 按下时的自定义音效
	
	// > 2E高亮与按下 - 封印且高亮
	if( data['highlightD_mode'] == undefined ){ data['highlightD_mode'] = "关闭效果" };									//2E高亮与按下 - 封印且高亮时设置
	if( data['highlightD_src_img'] == undefined ){ data['highlightD_src_img'] = "" };									//2E高亮与按下 - 资源-封印且高亮时
	if( data['highlightD_src_img_file'] == undefined ){ data['highlightD_src_img_file'] = "img/Map__ui_gaugeButton/" };	//2E高亮与按下 - 文件夹
	if( data['highlightD_opacity1'] == undefined ){ data['highlightD_opacity1'] = 160 };								//2E高亮与按下 - 封印时的未高亮透明度
	if( data['highlightD_opacity2'] == undefined ){ data['highlightD_opacity2'] = 255 };								//2E高亮与按下 - 封印时的高亮透明度
	if( data['highlightD_soundMode'] == undefined ){ data['highlightD_soundMode'] = "关闭音效" };						//2E高亮与按下 - 封印且高亮时音效设置
	if( data['highlightD_sound'] == undefined ){ data['highlightD_sound'] = {} };										//2E高亮与按下 - 封印且高亮时的自定义音效
	
	// > 2E高亮与按下 - 封印且按下
	if( data['pushdownD_mode'] == undefined ){ data['pushdownD_mode'] = "关闭效果" };									//2E高亮与按下 - 封印且按下时设置
	if( data['pushdownD_src_img'] == undefined ){ data['pushdownD_src_img'] = "" };										//2E高亮与按下 - 资源-封印且按下时
	if( data['pushdownD_src_img_file'] == undefined ){ data['pushdownD_src_img_file'] = "img/Map__ui_gaugeButton/" };	//2E高亮与按下 - 文件夹
	if( data['pushdownD_soundMode'] == undefined ){ data['pushdownD_soundMode'] = "关闭音效" };							//2E高亮与按下 - 封印且按下时错误音设置
	if( data['pushdownD_sound'] == undefined ){ data['pushdownD_sound'] = {} };											//2E高亮与按下 - 封印且按下时的自定义错误音
	
	// > 2F按钮执行（无）
}
//==============================
// * 控制器 - 初始化子功能『控制器与贴图』
//==============================
Drill_GBu_Controller.prototype.drill_controller_initChild = function(){
	this.drill_controller_initAttr();				//初始化子功能 - A主体
	this.drill_controller_initChange();				//初始化子功能 - B变换特性
	this.drill_controller_initCheck();				//初始化子功能 - C校验值
	this.drill_controller_initCommandChange();		//初始化子功能 - D指令叠加变化
	this.drill_controller_initDelayingCommand();	//初始化子功能 - E延迟指令
	this.drill_controller_initPeriodizeCommand();	//初始化子功能 - F周期指令
	this.drill_controller_initEffect();				//初始化子功能 - G自变化效果
	
	this.drill_controller_initGIF();				//初始化子功能 - O播放GIF
	this.drill_controller_initPreload();			//初始化子功能 - P预加载GIF管理
	this.drill_controller_initRandomPos();			//初始化子功能 - Q随机位置
	
	this.drill_controller_initCamera();				//初始化子功能 - Z镜头参数
	
	this.drill_controller_initDeactive();			//初始化子功能 - 2A激活与封印
	this.drill_controller_initSlideAnim();			//初始化子功能 - 2B自移动效果
	this.drill_controller_initCollision();			//初始化子功能 - 2C碰撞体
	this.drill_controller_initMouse();				//初始化子功能 - 2D鼠标判定
	this.drill_controller_initHoverAndPress();		//初始化子功能 - 2E高亮与按下
	this.drill_controller_initButtonExecute();		//初始化子功能 - 2F按钮执行
}
//==============================
// * 控制器 - 重设数据（私有）
//==============================
Drill_GBu_Controller.prototype.drill_controller_resetData_Private = function( data_id ){
	
	// > 参数检查
	if( typeof data_id != "number" ){
		alert( DrillUp.drill_GBu_getPluginTip_controllerData_NotId("Drill_GBu_Controller") );
		throw Error( DrillUp.drill_GBu_getPluginTip_controllerData_NotId("Drill_GBu_Controller") );
		return;
	}
	
	// > 执行重置
	this._drill_data_id = data_id;											//样式ID（控制器与样式 多对一 或 一对一）
	this._drill_controllerSerial = new Date().getTime() + Math.random();	//『随机因子-生成一个不重复的序列号』
	//this.drill_controller_initData();										//初始化数据
	this.drill_controller_initChild();										//初始化子功能
}
//##############################
// * 控制器 - 『控制器与贴图的样式-静态数据』校验标记
//##############################
DrillUp.g_GBu_notFindStyleAlertOnce = true;
//##############################
// * 控制器 - 『控制器与贴图的样式-静态数据』空的静态数据
//			
//			说明：	> 空数据会在initData时会进行默认值初始化，在其他地方只读。
//##############################
Drill_GBu_Controller.emptyData = {};
//##############################
// * 控制器 - 『控制器与贴图的样式-静态数据』获取静态数据【标准函数】
//			
//			参数：	> 无
//			返回：	> 对象指针
//			
//			说明：	> 由于数据量巨大，不要存储到存档中，也不要直接挂载到Controller身上。
//					> 静态数据会在initData时会进行默认值初始化，在其他地方只读。
//					> 【此函数不含遍历，而是直接获取值，可以放在帧刷新中使用】
//##############################
Drill_GBu_Controller.prototype.drill_data = function(){
	var cur_styleId   = this._drill_data_id +1;
	var cur_styleData = DrillUp.g_GBu_style[ this._drill_data_id ];
	if( cur_styleData == undefined ){
		
		// > 『控制器与贴图的样式-静态数据』 - 校验+提示信息（只执行一次）
		if( DrillUp.g_GBu_notFindStyleAlertOnce == true ){
			DrillUp.g_GBu_notFindStyleAlertOnce = false;
			alert( DrillUp.drill_GBu_getPluginTip_StyleNotFind(cur_styleId) );
		}
		return Drill_GBu_Controller.emptyData;
	}
	return cur_styleData;
};


//==============================
// * A主体 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initAttr = function(){
	var data = this.drill_data();
	
	// > A主体 - 基础特性
	this._drill_visible = data['visible'];			//控制器 - 显示/隐藏
	this._drill_pause = data['pause'];				//控制器 - 暂停/继续
	this._drill_blendMode = data['blendMode'];		//控制器 - 混合模式
	this._drill_layerIndex = data['layerIndex'];	//控制器 - 层级
	this._drill_zIndex = data['zIndex'];			//控制器 - 堆叠级
	
	// > A主体 - 其它特性
	//...
	
	// > 常规
	this._drill_curTime = 0;			//常规 - 当前时间
	this._drill_needDestroy = false;	//常规 - 销毁
}
//==============================
// * A主体 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateAttr = function(){
	
	// > 时间流逝
	this._drill_curTime += 1;
}
//==============================
// * A主体 - 是否 显示/隐藏（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_isVisible = function(){
	return this._drill_visible;
}
//==============================
// * A主体 - 是否 暂停/继续（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_isPause = function(){
	return this._drill_pause;
}

//==============================
// * B变换特性 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initChange = function(){
	var data = this.drill_data();
	
	// > 变换值 - 锚点
	this._drill_change_anchor_x = data['anchor_x'];
	this._drill_change_anchor_y = data['anchor_y'];
	
	// > 变换值 - 位置
	this._drill_change_x = data['x'];
	this._drill_change_y = data['y'];
	
	
	// > 变换值 - 缩放
	this._drill_change_scaleX = data['scale_x'];	//（3d效果）
	this._drill_change_scaleY = data['scale_y'];
	
	// > 变换值 - 缩放（圈贴图）
	//	（无）
	
	
	// > 变换值 - 透明度
	this._drill_change_opacity = data['opacity'];
	
	
	// > 变换值 - 斜切
	this._drill_change_skewX = data['skew_x'];		//（3d效果）
	this._drill_change_skewY = data['skew_y'];
	
	// > 变换值 - 斜切（圈贴图）
	//	（无）
	
	
	// > 变换值 - 旋转
	this._drill_change_rotate = data['parentRotate'];		//（整体再旋转角度）
	
	// > 变换值 - 旋转（圈贴图）
	this._drill_childGIF_rotation = 0;					//（自旋转）
	this._drill_childGIF_rotateSpeed = data['rotate'];	//（自旋转速度）
}
//==============================
// * B变换特性 - 帧刷新 旋转
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateChange_Rotation = function(){
	
	// > 变换值 - 帧刷新 旋转（圈贴图）
	this._drill_childGIF_rotation += this._drill_childGIF_rotateSpeed;
}
//##############################
// * B变换特性 - 数据最终变换值 - 位置X（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_x = function(){
	return this._drill_change_x + this._drill_slideAnim_x;	//（叠加 2B自移动效果）
}
//##############################
// * B变换特性 - 数据最终变换值 - 位置Y（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_y = function(){
	return this._drill_change_y + this._drill_slideAnim_y;	//（叠加 2B自移动效果）
}
//##############################
// * B变换特性 - 数据最终变换值 - 缩放X（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_scaleX = function(){
	return this._drill_change_scaleX;
}
//##############################
// * B变换特性 - 数据最终变换值 - 缩放Y（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_scaleY = function(){
	return this._drill_change_scaleY;
}
//##############################
// * B变换特性 - 数据最终变换值 - 透明度（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_opacity = function(){
	return this._drill_change_opacity;
}
//##############################
// * B变换特性 - 数据最终变换值 - 斜切X（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_skewX = function(){
	return this._drill_change_skewX;
}
//##############################
// * B变换特性 - 数据最终变换值 - 斜切Y（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_skewY = function(){
	return this._drill_change_skewY;
}
//##############################
// * B变换特性 - 数据最终变换值 - 旋转（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_rotate = function(){
	return this._drill_change_rotate;
}
//##############################
// * B变换特性 - 数据最终变换值 - 转速（可继承，开放函数）
//##############################
Drill_GBu_Controller.prototype.drill_controller_finalTransform_rotateSpeed = function(){
	return this._drill_childGIF_rotateSpeed;
}

//==============================
// * C校验值 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initCheck = function(){
	//（无）
}
//==============================
// * C校验值 - 校验标记
//==============================
DrillUp.g_GBu_checkNaN = true;
//==============================
// * C校验值 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateCheckNaN = function(){
	if( $gameTemp == undefined ){ return; }		//（测试版开启功能，发布版关闭功能）
	if( $gameTemp.isPlaytest() != true ){ return; }
	
	// > 校验值
	if( DrillUp.g_GBu_checkNaN == true ){
		if( isNaN( this.drill_controller_finalTransform_x() ) ){
			DrillUp.g_GBu_checkNaN = false;
			var check_tank = {};
			check_tank["_drill_change_x"] = this._drill_change_x;
			alert( DrillUp.drill_GBu_getPluginTip_ParamIsNaN( "drill_controller_finalTransform_x", check_tank ) );
		}
		if( isNaN( this.drill_controller_finalTransform_y() ) ){
			DrillUp.g_GBu_checkNaN = false;
			var check_tank = {};
			check_tank["_drill_change_y"] = this._drill_change_y;
			alert( DrillUp.drill_GBu_getPluginTip_ParamIsNaN( "drill_controller_finalTransform_y", check_tank ) );
		}
		if( isNaN( this.drill_controller_finalTransform_opacity() ) ){
			DrillUp.g_GBu_checkNaN = false;
			alert( DrillUp.drill_GBu_getPluginTip_ParamIsNaN( "drill_controller_finalTransform_opacity" ) );
		}
		if( isNaN( this.drill_controller_finalTransform_rotate() ) ){
			DrillUp.g_GBu_checkNaN = false;
			alert( DrillUp.drill_GBu_getPluginTip_ParamIsNaN( "drill_controller_finalTransform_rotate" ) );
		}
	}
}


//==============================
// * D指令叠加变化 - 初始化子功能
//
//			说明：	> 此处使用弹道核心提供的 弹道扩展工具-A叠加变化宏定义 控制器部分。
//					> 参数使用字符串进行控制，默认为 null 值。
//==============================
Drill_GBu_Controller.prototype.drill_controller_initCommandChange = function(){
	
	// > 控制器参数 - 移动到
	this["_drill_command_move_data"] = undefined;
	
	// > 控制器参数 - 透明度
	this["_drill_command_opacity_data"] = undefined;
	
	// > 控制器参数 - 旋转
	this["_drill_command_rotate_data"] = undefined;
	// > 控制器参数 - 转速
	this["_drill_command_rotateSpeed_data"] = undefined;
	
	// > 控制器参数 - 缩放X
	this["_drill_command_scaleX_data"] = undefined;
	// > 控制器参数 - 缩放Y
	this["_drill_command_scaleY_data"] = undefined;
	
	// > 控制器参数 - 斜切X
	this["_drill_command_skewX_data"] = undefined;
	// > 控制器参数 - 斜切Y
	this["_drill_command_skewY_data"] = undefined;
}
//==============================
// * D指令叠加变化 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateCommandChange = function(){
	
	// > 帧刷新 - 移动到（二维弹道）
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_controller_update( this, "_drill_command_move_data" );
	
	// > 帧刷新 - 透明度
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_opacity_data" );
	
	// > 帧刷新 - 旋转
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_rotate_data" );
	// > 帧刷新 - 转速
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_rotateSpeed_data" );
	
	// > 帧刷新 - 缩放X
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_scaleX_data" );
	// > 帧刷新 - 缩放Y
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_scaleY_data" );
	
	// > 帧刷新 - 斜切X
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_skewX_data" );
	// > 帧刷新 - 斜切Y
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_update( this, "_drill_command_skewY_data" );
}
//==============================
// * D指令叠加变化 - 立即还原所有单属性
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_restoreAttr = function(){
	
	// > 控制器参数 - 移动到
	//	（这里不含）
	
	// > 控制器参数 - 透明度
	this["_drill_command_opacity_data"] = undefined;
	
	// > 控制器参数 - 旋转
	this["_drill_command_rotate_data"] = undefined;
	// > 控制器参数 - 转速
	this["_drill_command_rotateSpeed_data"] = undefined;
	
	// > 控制器参数 - 缩放X
	this["_drill_command_scaleX_data"] = undefined;
	// > 控制器参数 - 缩放Y
	this["_drill_command_scaleY_data"] = undefined;
	
	// > 控制器参数 - 斜切X
	this["_drill_command_skewX_data"] = undefined;
	// > 控制器参数 - 斜切Y
	this["_drill_command_skewY_data"] = undefined;
}
//==============================
// * D指令叠加变化 - 立即归位
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_restoreMove = function(){
	this["_drill_command_move_data"] = undefined;
}
//==============================
// * D指令叠加变化 - 修改单属性 - 移动到
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setMove = function( change_type, tar_valueA, tar_valueB, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_controller_setTarget(
		this, "_drill_command_move_data", data['x'], data['y'],		//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_valueA, tar_valueB, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 透明度
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setOpacity = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_opacity_data", data['opacity'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 旋转
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setRotate = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_rotate_data", data['parentRotate'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 转速
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setRotateSpeed = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_rotateSpeed_data", data['rotate'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 缩放X
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setScaleX = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_scaleX_data", data['scale_x'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 缩放Y
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setScaleY = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_scaleY_data", data['scale_y'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 斜切X
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setSkewX = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_skewX_data", data['skew_x'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}
//==============================
// * D指令叠加变化 - 修改单属性 - 斜切Y
//==============================
Drill_GBu_Controller.prototype.drill_controller_commandChange_setSkewY = function( change_type, tar_value, tar_time ){
	var data = this.drill_data();
	Drill_COBa_ExtendTool.drill_COBa_Common_controller_setTarget(
		this, "_drill_command_skewY_data", data['skew_y'],	//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_value, tar_time
	);
}


//==============================
// * E延迟指令 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initDelayingCommand = function(){
	this._drill_curDelayingCommandTank = [];
}
//==============================
// * E延迟指令 - 帧刷新 - 时间流逝
//
//			说明：	> 此处的时间流逝不会因为 暂停 而停止流逝。
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateDelayingCommandImportant = function(){
	if( this._drill_curDelayingCommandTank.length == 0 ){ return; }
	
	// > 帧刷新 时间流逝
	for(var i = 0; i < this._drill_curDelayingCommandTank.length; i++ ){
		var dc_data = this._drill_curDelayingCommandTank[i];
		
		// > 时间-1
		dc_data['left_time'] -= 1;
		
	}
	
	// > 执行延迟指令（暂停/继续）
	for(var i = 0; i < this._drill_curDelayingCommandTank.length; i++ ){
		var dc_data = this._drill_curDelayingCommandTank[i];
		if( dc_data['left_time'] < 0 ){
			var method = dc_data['method'];
			var paramList = dc_data['paramList'];
			
			if( method == Drill_GBu_Controller.METHOD__drill_controller_setPause ){
				this.drill_controller_setPause( paramList[0] );
			}else if( method == Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_setPause ){  //暂停周期指令(延迟)
				this.drill_controller_periodizeCommand_setPause( paramList[0] );
			}else if( method == Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_clear ){  //清空周期指令(延迟)
				this.drill_controller_periodizeCommand_clear();
			}
		}
	}
}
//==============================
// * E延迟指令 - 帧刷新 - 执行延迟指令
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateDelayingCommand = function(){
	if( this._drill_curDelayingCommandTank.length == 0 ){ return; }
	
	// > 执行延迟指令
	for(var i = 0; i < this._drill_curDelayingCommandTank.length; i++ ){
		var dc_data = this._drill_curDelayingCommandTank[i];
		if( dc_data['left_time'] < 0 ){
			var method = dc_data['method'];
			var paramList = dc_data['paramList'];
			
			switch( method ){
				case Drill_GBu_Controller.METHOD__drill_controller_setVisible:
					this.drill_controller_setVisible( paramList[0] );
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_setBlendMode:
					this.drill_controller_setBlendMode( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex:
					this.drill_controller_setLayerIndex( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_setZIndex:
					this.drill_controller_setZIndex( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode:
					this.drill_controller_restoreBlendMode();
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex:
					this.drill_controller_restoreLayerIndex();
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex:
					this.drill_controller_restoreZIndex();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity:
					this.drill_controller_commandChange_setOpacity( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate:
					this.drill_controller_commandChange_setRotate( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed:
					this.drill_controller_commandChange_setRotateSpeed( paramList[0], paramList[1], paramList[2] );
					break;
					
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX:
					this.drill_controller_commandChange_setScaleX( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY:
					this.drill_controller_commandChange_setScaleY( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX:
					this.drill_controller_commandChange_setSkewX( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY:
					this.drill_controller_commandChange_setSkewY( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr:
					this.drill_controller_commandChange_restoreAttr();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove:
					this.drill_controller_commandChange_setMove( paramList[0], paramList[1], paramList[2], paramList[3] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove:
					this.drill_controller_commandChange_restoreMove();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked:
					this.drill_controller_GIF_setLocked( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay:
					this.drill_controller_GIF_setOncePlay( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame:
					this.drill_controller_GIF_setFrame( paramList[0] );
					break;
				
				default:
					break;
			}
		}
	}
	
	// > 销毁延迟指令
	for(var i = this._drill_curDelayingCommandTank.length-1; i >= 0; i-- ){
		var dc_data = this._drill_curDelayingCommandTank[i];
		if( dc_data['left_time'] < 0 ){
			this._drill_curDelayingCommandTank.splice( i, 1 );
		}
	}
}
//==============================
// * E延迟指令 - 设置指令（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_setDelayingCommand = function( method, paramList, delay_time ){
	var enable = false;
	switch( method ){
		case Drill_GBu_Controller.METHOD__drill_controller_setVisible:
		case Drill_GBu_Controller.METHOD__drill_controller_setPause:
		case Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_setPause:
		case Drill_GBu_Controller.METHOD__drill_controller_periodizeCommand_clear:
		
		case Drill_GBu_Controller.METHOD__drill_controller_setBlendMode:
		case Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_setZIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove:
		
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked:
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay:
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame:
			enable = true;
			break;
		
		default:
			break;
	}
	if( enable == false ){ return; }
	
	var dc_data = {};
	dc_data['method'] = method;
	dc_data['paramList'] = paramList;
	dc_data['left_time'] = delay_time;
	this._drill_curDelayingCommandTank.push( dc_data );
}
//==============================
// * E延迟指令 - 增加延迟（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_addDelayingTime = function( time ){
	if( isNaN(time) ){ return; }
	for(var i = 0; i < this._drill_curDelayingCommandTank.length; i++ ){
		var dc_data = this._drill_curDelayingCommandTank[i];
		dc_data['left_time'] += Number( time );
	}
}
//==============================
// * E延迟指令 - 清空全部（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_clearDelayingCommand = function(){
	this._drill_curDelayingCommandTank = [];
}


//==============================
// * F周期指令 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initPeriodizeCommand = function(){
	this._drill_curPeriodizeCommandTank = [];
	this._drill_periodizeCommand_pause = undefined;				//暂停周期指令
	this._drill_periodizeCommand_waitAndPauseTime = undefined;	//一次性计时器（暂停周期指令-周期末尾时）
	this._drill_periodizeCommand_waitAndClearTime = undefined;	//一次性计时器（清空周期指令-周期末尾时）
}
//==============================
// * F周期指令 - 帧刷新 - 时间流逝
//
//			说明：	> 此处的时间流逝不会因为 暂停 而停止流逝。
//==============================
Drill_GBu_Controller.prototype.drill_controller_updatePeriodizeCommandImportant = function(){
	if( this._drill_curPeriodizeCommandTank.length == 0 ){ return; }
	
	// > 暂停周期指令
	if( this._drill_periodizeCommand_pause == true ){ return; }
	
	// > 一次性计时器
	if( this._drill_periodizeCommand_waitAndPauseTime !== undefined ){
		this._drill_periodizeCommand_waitAndPauseTime -= 1;
		if( this._drill_periodizeCommand_waitAndPauseTime == 0 ){
			this.drill_controller_periodizeCommand_setPause(true);  //（暂停周期指令-周期末尾时）
		}
	}
	if( this._drill_periodizeCommand_waitAndClearTime !== undefined ){
		this._drill_periodizeCommand_waitAndClearTime -= 1;
		if( this._drill_periodizeCommand_waitAndClearTime == 0 ){
			this.drill_controller_periodizeCommand_clear();  //（清空周期指令-周期末尾时）
		}
	}
	
	
	// > 帧刷新 时间流逝
	for(var i = 0; i < this._drill_curPeriodizeCommandTank.length; i++ ){
		var pc_data = this._drill_curPeriodizeCommandTank[i];
		
		// > 时间-1
		pc_data['cur_time'] += 1;
	}
	
	// > 执行周期指令（暂停/继续）
	for(var i = 0; i < this._drill_curPeriodizeCommandTank.length; i++ ){
		var pc_data = this._drill_curPeriodizeCommandTank[i];
		var time =  pc_data['cur_time'] % pc_data['time_period'];
		if( time == pc_data['time_start'] ){
			var method = pc_data['method'];
			var paramList = pc_data['paramList'];
			
			if( method == Drill_GBu_Controller.METHOD__drill_controller_setPause ){
				this.drill_controller_setPause( paramList[0] );
			}
		}
	}
}
//==============================
// * F周期指令 - 帧刷新 - 执行周期指令
//==============================
Drill_GBu_Controller.prototype.drill_controller_updatePeriodizeCommand = function(){
	if( this._drill_curPeriodizeCommandTank.length == 0 ){ return; }
	
	// > 执行周期指令
	for(var i = 0; i < this._drill_curPeriodizeCommandTank.length; i++ ){
		var pc_data = this._drill_curPeriodizeCommandTank[i];
		var time =  pc_data['cur_time'] % pc_data['time_period'];
		if( time == pc_data['time_start'] ){
			var method = pc_data['method'];
			var paramList = pc_data['paramList'];
			
			switch( method ){
				case Drill_GBu_Controller.METHOD__drill_controller_setVisible:
					this.drill_controller_setVisible( paramList[0] );
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_setBlendMode:
					this.drill_controller_setBlendMode( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex:
					this.drill_controller_setLayerIndex( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_setZIndex:
					this.drill_controller_setZIndex( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode:
					this.drill_controller_restoreBlendMode();
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex:
					this.drill_controller_restoreLayerIndex();
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex:
					this.drill_controller_restoreZIndex();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity:
					this.drill_controller_commandChange_setOpacity( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate:
					this.drill_controller_commandChange_setRotate( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed:
					this.drill_controller_commandChange_setRotateSpeed( paramList[0], paramList[1], paramList[2] );
					break;
					
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX:
					this.drill_controller_commandChange_setScaleX( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY:
					this.drill_controller_commandChange_setScaleY( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX:
					this.drill_controller_commandChange_setSkewX( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY:
					this.drill_controller_commandChange_setSkewY( paramList[0], paramList[1], paramList[2] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr:
					this.drill_controller_commandChange_restoreAttr();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove:
					this.drill_controller_commandChange_setMove( paramList[0], paramList[1], paramList[2], paramList[3] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove:
					this.drill_controller_commandChange_restoreMove();
					break;
				
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked:
					this.drill_controller_GIF_setLocked( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay:
					this.drill_controller_GIF_setOncePlay( paramList[0] );
					break;
				case Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame:
					this.drill_controller_GIF_setFrame( paramList[0] );
					break;
				
				default:
					break;
			}
		}
	}
	
}
//==============================
// * F周期指令 - 设置指令（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_setPeriodizeCommand = function( method, paramList, time_period, time_start ){
	var enable = false;
	switch( method ){
		case Drill_GBu_Controller.METHOD__drill_controller_setVisible:
		case Drill_GBu_Controller.METHOD__drill_controller_setPause:
		
		case Drill_GBu_Controller.METHOD__drill_controller_setBlendMode:
		case Drill_GBu_Controller.METHOD__drill_controller_setLayerIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_setZIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreBlendMode:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreLayerIndex:
		case Drill_GBu_Controller.METHOD__drill_controller_restoreZIndex:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setOpacity:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotate:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setRotateSpeed:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleX:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setScaleY:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewX:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setSkewY:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreAttr:
		
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_setMove:
		case Drill_GBu_Controller.METHOD__drill_controller_commandChange_restoreMove:
		
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setLocked:
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setOncePlay:
		case Drill_GBu_Controller.METHOD__drill_controller_GIF_setFrame:
			enable = true;
			break;
		
		default:
			break;
	}
	if( enable == false ){ return; }
	
	var pc_data = {};
	pc_data['method'] = method;
	pc_data['paramList'] = paramList;
	pc_data['time_period'] = time_period;
	pc_data['time_start'] = time_start;
	pc_data['cur_time'] = -1;			//（时间先+1后判断，所以取-1）
	this._drill_curPeriodizeCommandTank.push( pc_data );
}
//==============================
// * F周期指令 - 获取 周期剩余时间（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_periodizeCommand_getWaitAndClearTime = function(){
	if( this._drill_curPeriodizeCommandTank.length == 0 ){ return 0; }
	var pc_data = this._drill_curPeriodizeCommandTank[0];				//（只取第一个周期指令的时间）
	var cur_period_time = pc_data['cur_time'] % pc_data['time_period'];	//（周期内的当前时间）
	return pc_data['time_period'] - cur_period_time;					//（周期内的剩余时间）
}
//==============================
// * F周期指令 - 暂停周期指令-立刻（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_periodizeCommand_setPause = function( enabled ){
	this._drill_periodizeCommand_pause = enabled;				//（暂停周期指令）
	this.drill_controller_setPause( enabled );					//（暂停变换）
	this._drill_periodizeCommand_waitAndPauseTime = undefined;	//（删除 一次性计时器）
}
//==============================
// * F周期指令 - 暂停周期指令-周期末尾时（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_periodizeCommand_waitAndPause = function(){
	this._drill_periodizeCommand_waitAndPauseTime = this.drill_controller_periodizeCommand_getWaitAndClearTime();
}
//==============================
// * F周期指令 - 清空周期指令-立刻（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_periodizeCommand_clear = function(){
	this._drill_curPeriodizeCommandTank = [];
	this._drill_periodizeCommand_waitAndClearTime = undefined;	//（删除 一次性计时器）
}
//==============================
// * F周期指令 - 清空周期指令-周期末尾时（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_periodizeCommand_waitAndClear = function(){
	this._drill_periodizeCommand_waitAndClearTime = this.drill_controller_periodizeCommand_getWaitAndClearTime();
}


//==============================
// * G自变化效果 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initEffect = function(){
	this._drill_curEffectTime = 0;
}
//==============================
// * G自变化效果 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateEffect = function(){
	this._drill_curEffectTime += 1;
}


//==============================
// * O播放GIF - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initGIF = function(){
	var data = this.drill_data();
	
	// > 播放GIF
	this.drill_controller_GIF_setFrame( data['gif_initFrame'] -1 );		//播放GIF - 当前时间
	this._drill_GIF_index = 0;											//播放GIF - 当前索引
	this._drill_GIF_lockEnabled = data['gif_lock'];						//播放GIF - 是否锁定帧
	
	// > 单次播放
	this._drill_GIF_oncePlay = false;
	this._drill_GIF_onceType = "forwardRun";	//（forwardRun正向播放/backRun反向播放）
	this._drill_GIF_onceTarTime = 0;
}
//==============================
// * O播放GIF - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateGIF = function(){
	var data = this.drill_data();
	
	// > 单次播放
	if( this._drill_GIF_oncePlay == true ){
		
		// > 播放GIF
		var inter = this._drill_GIF_time;
		inter = inter / data['interval'];
		inter = Math.floor(inter);
		inter = inter % data['src_img_gif'].length;
		if( this._drill_GIF_onceType == "backRun" ){
			inter = data['src_img_gif'].length - 1 - inter;
		}
		this._drill_GIF_index = Math.floor(inter);
		
		// > 时间+1（放后面）
		this._drill_GIF_time += 1;
		
		// > 播放完毕后，锁定帧
		if( this._drill_GIF_time > this._drill_GIF_onceTarTime ){
			this._drill_GIF_oncePlay = false;
			this.drill_controller_GIF_setLocked( true );
		}
		return;
	}
	
	
	// > 锁定帧时（注意，锁定帧时 _drill_GIF_index 不刷新）
	if( this._drill_GIF_lockEnabled == true ){ return; }
	
	// > 播放GIF
	var inter = this._drill_GIF_time;
	inter = inter / data['interval'];
	inter = Math.floor(inter);
	inter = inter % data['src_img_gif'].length;
	if( data['back_run'] == true ){
		inter = data['src_img_gif'].length - 1 - inter;
	}
	this._drill_GIF_index = Math.floor(inter);
	
	// > 时间+1（放后面）
	this._drill_GIF_time += 1;
}

//==============================
// * P预加载GIF管理 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initPreload = function(){
	//	（无）
}

//==============================
// * Q随机位置 - 初始化子功能
//
//			说明：	> 此功能对 B变换特性 和 O播放GIF 进行组合控制。
//==============================
Drill_GBu_Controller.prototype.drill_controller_initRandomPos = function(){
	var data = this.drill_data();
	
	// > 随机位置
	this._drill_randomPos_x = 0;			//随机位置 - 位置X
	this._drill_randomPos_y = 0;			//随机位置 - 位置Y
	this._drill_randomPos_lastInter = 0;	//随机位置 - 上一次时间
	if( data['randomPos_enable'] == true ){
		this._drill_randomPos_x = Math.floor( data['randomPos_width'] *( Math.random()-0.5 ));	//『随机因子-图像用』
		this._drill_randomPos_y = Math.floor( data['randomPos_height']*( Math.random()-0.5 ));	//『随机因子-图像用』
	}
	if( data['randomPos_gifFrame'] == true ){
		this._drill_GIF_time = Math.floor( data['interval']*data['src_img_gif'].length * Math.random() );	//『随机因子-图像用』
	}
}
//==============================
// * Q随机位置 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateRandomPos = function(){
	var data = this.drill_data();
	
	// > 每次播放结束后变化
	if( data['randomPos_enable'] == true ){
		var inter = Math.floor(this._drill_GIF_time / data['interval'] / data['src_img_gif'].length);
		if( this._drill_randomPos_lastInter != inter ){
			this._drill_randomPos_lastInter = inter;
			this._drill_randomPos_x = Math.floor( data['randomPos_width'] *( Math.random()-0.5 ));	//『随机因子-图像用』
			this._drill_randomPos_y = Math.floor( data['randomPos_height']*( Math.random()-0.5 ));	//『随机因子-图像用』
		}
	}
}


//==============================
// * Z镜头参数 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initCamera = function(){
	//this._drill_cameraXAcc = 0;			//循环积累值（不存）
	//this._drill_cameraYAcc = 0;
	
	this._drill_cameraResultSpriteX = 0;	//镜头位移结果
	this._drill_cameraResultSpriteY = 0;
}
// > 强制更新提示 锁
DrillUp.g_GBu_alert = true;
//==============================
// * Z镜头参数 - 获取 循环积累值（开放函数）
//
//			说明：	> 此处直接调用函数获取值。参数不存，因为浪费 帧刷新 和 存储空间。
//==============================
Drill_GBu_Controller.prototype.drill_controller_getCameraXAcc = function(){
	if( $gameMap == undefined ){ return 0; }	//『$gameSystem优先初始化』（注意此处，调用时 $gameMap和$dataMap 都可能未创建。）
	if( $dataMap == undefined ){ return 0; }
	
	// > 循环积累值 【地图 - 活动地图镜头】
	if( Imported.Drill_LayerCamera ){
		
		// > 强制更新提示
		if( $gameSystem._drill_LCa_controller == undefined && DrillUp.g_GBu_alert == true ){ 
			alert( DrillUp.drill_GBu_getPluginTip_NeedUpdate_Camera() );
			DrillUp.g_GBu_alert = false;
			return; 
		}
		
		return $gameSystem._drill_LCa_controller._drill_cameraX_offsetAcc * $gameMap.tileWidth();
	}else{
		return $gameMap.displayX() * $gameMap.tileWidth();
	}
}
//==============================
// * Z镜头参数 - 获取 循环积累值（开放函数）
//
//			说明：	> 此处直接调用函数获取值。参数不存，因为浪费 帧刷新 和 存储空间。
//==============================
Drill_GBu_Controller.prototype.drill_controller_getCameraYAcc = function(){
	if( $gameMap == undefined ){ return 0; }	//『$gameSystem优先初始化』（注意此处，调用时 $gameMap和$dataMap 都可能未创建。）
	if( $dataMap == undefined ){ return 0; }
	
	// > 循环积累值 【地图 - 活动地图镜头】
	if( Imported.Drill_LayerCamera ){
		
		// > 强制更新提示
		if( $gameSystem._drill_LCa_controller == undefined && DrillUp.g_GBu_alert == true ){ 
			alert( DrillUp.drill_GBu_getPluginTip_NeedUpdate_Camera() );
			DrillUp.g_GBu_alert = false;
			return; 
		}
		
		return $gameSystem._drill_LCa_controller._drill_cameraY_offsetAcc * $gameMap.tileHeight();
	}else{
		return $gameMap.displayY() * $gameMap.tileHeight();
	}
}

//==============================
// * 2A激活与封印 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initDeactive = function(){
	var data = this.drill_data();
	if( data['deactive_enabled'] == true ){  //（active激活，deactive封印）
		this._drill_active = false;
	}else{
		this._drill_active = true;
	}
}
//==============================
// * 2A激活与封印 - 是否激活（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_isActive = function(){
	return this._drill_active;
}
//==============================
// * 2A激活与封印 - 设置激活（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_setActive = function( active ){
	this._drill_active = active;
}

//==============================
// * 2B自移动效果 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initSlideAnim = function(){
	var data = this.drill_data();
	this._drill_slideAnim_enabled = data['slideAnim_enabled'];
	this._drill_slideAnim_x = 0;			//（注意，该坐标为叠加值）
	this._drill_slideAnim_y = 0;			//
	
	// > 控制器参数
	this["_drill_slideAnim_move_data"] = undefined;
}
//==============================
// * 2B自移动效果 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateSlideAnim = function(){
	
	// > 帧刷新（二维弹道）
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_controller_update( this, "_drill_slideAnim_move_data" );
}
//==============================
// * 2B自移动效果 - 开始播放（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_playSlideAnim = function(){
	if( this._drill_slideAnim_enabled != true ){ return; }
	this.drill_controller_playSlideAnim_Private();
}
//==============================
// * 2B自移动效果 - 开始播放（私有）
//==============================
Drill_GBu_Controller.prototype.drill_controller_playSlideAnim_Private = function(){
	var data = this.drill_data();
	var cur_x = data['slideAnim']['slideAbsoluteX'] - data['x'];	//（注意，该坐标为叠加值）
	var cur_y = data['slideAnim']['slideAbsoluteY'] - data['y'];	//
	if( data['slideAnim']['slidePosType'] == "相对坐标" ){			//
		cur_x = data['slideAnim']['slideX'];						//
		cur_y = data['slideAnim']['slideY'];						//
	}
	var change_type = data['slideAnim']['slideMoveType'];
	var tar_valueA = 0;
	var tar_valueB = 0;
	var tar_time = data['slideAnim']['slideTime'];
	var change_delay = data['slideAnim']['slideDelay'];
	var change_endDelay = 0;
	
	// > 清空目标（自移动效果是增量移动，所以每次执行都要清空）
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_controller_clearTarget( this, "_drill_slideAnim_move_data" );
	
	// > 设置目标
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_controller_setTarget(
		this, "_drill_slideAnim_move_data", cur_x, cur_y,		//（调用时要给定 初始值，虽然初始值只在第一次调用指令时有效，但必须要给）
		change_type, tar_valueA, tar_valueB, tar_time, change_delay, change_endDelay
	);
	
	// > 强制初始化
	this._drill_slideAnim_x = this["_drill_slideAnim_move_data"]['cur_valueA'];
	this._drill_slideAnim_y = this["_drill_slideAnim_move_data"]['cur_valueB'];
}


//==============================
// * 2C碰撞体 - 初始化子功能
//
//			说明：	> 此处的结构参考来自插件【图片 - 图片优化核心】（碰撞体与点变换）。
//==============================
Drill_GBu_Controller.prototype.drill_controller_initCollision = function(){
	this._drill_collision_width = 10;
	this._drill_collision_height = 10;
}
//==============================
// * 2C碰撞体 - 获取矩形的四个顶点（开放函数）
//
//			说明：	> 返回 缩放/旋转/斜切 变换后的四个顶点。如果为null表示无法获取。
//==============================
Drill_GBu_Controller.prototype.drill_controller_getRectPoint = function(){
	
	// > 缩放/旋转值
	var rotation = this.drill_controller_finalTransform_rotate() *Math.PI/180;	//（弧度值）
	var scale_x = this.drill_controller_finalTransform_scaleX();
	var scale_y = this.drill_controller_finalTransform_scaleY();
	var skew_x = this.drill_controller_finalTransform_skewX();
	var skew_y = this.drill_controller_finalTransform_skewY();
	
	// > 矩形的四个点 + 执行缩放/旋转（顺时针顺序）
	var ww = this._drill_collision_width;
	var hh = this._drill_collision_height;
	if( ww == 0 ){ return null; }
	if( hh == 0 ){ return null; }
	
	var x0 = this.drill_controller_finalTransform_x();		//（矩形的中心点，就是xy位置）
	var y0 = this.drill_controller_finalTransform_y();
	var xx = x0 - ww * this._drill_change_anchor_x;			//（矩形的左上角点）
	var yy = y0 - hh * this._drill_change_anchor_y;
	var p1 = $gameTemp.drill_GBu_Math2D_getPointWithTransform( xx+0,  yy+0,  x0,y0, rotation,scale_x,scale_y,skew_x,skew_y );
	var p2 = $gameTemp.drill_GBu_Math2D_getPointWithTransform( xx+ww, yy+0,  x0,y0, rotation,scale_x,scale_y,skew_x,skew_y );
	var p3 = $gameTemp.drill_GBu_Math2D_getPointWithTransform( xx+ww, yy+hh, x0,y0, rotation,scale_x,scale_y,skew_x,skew_y );
	var p4 = $gameTemp.drill_GBu_Math2D_getPointWithTransform( xx+0,  yy+hh, x0,y0, rotation,scale_x,scale_y,skew_x,skew_y );
	
	// > 顶点列表
	var point_list = [];
	point_list.push( p1 );
	point_list.push( p2 );
	point_list.push( p3 );
	point_list.push( p4 );
	return point_list;
}
//==============================
// * 2C碰撞体 - 数学工具 - 矩阵点的变换/点A绕点B旋转缩放斜切
//			
//			参数：	> cur_x,cur_y 数字       （需要变换的点）
//					> center_x,center_y 数字 （矩形中心点）
//					> rotation 数字          （旋转度数，弧度）
//					> scale_x,scale_y 数字   （缩放比例XY，默认1.00）
//					> skew_x,skew_y 数字     （斜切比例XY，默认0.00）
//			返回：	> { x:0, y:0 }           （变换后的坐标）
//			
//			说明：	> 矩阵内或矩阵外一个点，能够根据矩阵的 旋转+缩放+斜切 一并变换。
//					  旋转+缩放+斜切 可为负数。
//==============================
Game_Temp.prototype.drill_GBu_Math2D_getPointWithTransform = function( 
					cur_x,cur_y,						//需要变换的点 
					center_x,center_y, 					//矩形中心点 
					rotation,							//变换的值（旋转）
					scale_x, scale_y,					//变换的值（缩放）
					skew_x, skew_y  ){					//变换的值（斜切）
	
	if( scale_x == undefined ){ scale_x = 1; }
	if( scale_y == undefined ){ scale_y = 1; }
	if( skew_x == undefined ){ skew_x = 0; }
	if( skew_y == undefined ){ skew_y = 0; }
	
	// > 参数准备 （来自 Pixi.Transform）
    var _cx = 1; // cos rotation + skewY;
    var _sx = 0; // sin rotation + skewY;
    var _cy = 0; // cos rotation + Math.PI/2 - skewX;
    var _sy = 1; // sin rotation + Math.PI/2 - skewX;
	
	// > 旋转+斜切 （来自 Pixi.Transform.prototype.updateSkew）
    _cx = Math.cos( rotation + skew_y );
    _sx = Math.sin( rotation + skew_y );
    _cy = -Math.sin( rotation - skew_x ); // cos, added PI/2
    _sy = Math.cos( rotation - skew_x ); // sin, added PI/2
	
	// > 缩放 （来自 Pixi.Transform.prototype.updateLocalTransform）
    var a = _cx * scale_x;
    var b = _sx * scale_x;
    var c = _cy * scale_y;
    var d = _sy * scale_y;
	
	// > 将参数应用到坐标
	var dx = (cur_x - center_x);
	var dy = (cur_y - center_y);
    var tar_x = center_x + (dx * a + dy * c);
    var tar_y = center_y + (dx * b + dy * d);
	
	return { "x":tar_x, "y":tar_y };
}


//==============================
// * 2D鼠标判定 - 初始化子功能
//
//			说明：	> 此处的结构参考来自插件【图片 - 图片优化核心】（碰撞体判定实现）。
//==============================
Drill_GBu_Controller.prototype.drill_controller_initMouse = function(){
	this._drill_GBu_hoverLastTime = 0;			//当前帧数（悬停优化用）
	this._drill_GBu_isHover = false;			//是否悬停（悬停优化用）
}
//==============================
// * 2D鼠标判定 - 是否按下（开放函数）
//
//			说明：	> 可以在帧刷新中反复执行。
//==============================
Drill_GBu_Controller.prototype.drill_controller_isOnPress = function(){
	if( this.drill_GBu_isOnOnlyHover() ){	//（唯一悬停）
		if( TouchInput.drill_COI_isLeftPressed() ){
			return true;
		}
	}
	return false;
}
//==============================
// * 2D鼠标判定 - 是否为唯一悬停（开放函数）
//
//			说明：	> 可以在帧刷新中反复执行。
//					> 多个按钮之间互斥，不能同时按多个按钮。
//==============================
Drill_GBu_Controller.prototype.drill_GBu_isOnOnlyHover = function(){
	return this._drill_controllerSerial == $gameTemp._drill_GBu_curControllerSerial;
}
//==============================
// * 2D鼠标判定 - 是否悬停（开放函数）
//
//			说明：	> 可以在帧刷新中反复执行。
//==============================
Drill_GBu_Controller.prototype.drill_controller_isOnHover = function(){
	
	// > 悬停优化
	if( this._drill_GBu_hoverLastTime != this._drill_curTime ){
		this._drill_GBu_hoverLastTime =  this._drill_curTime;
		this._drill_GBu_isHover = this.drill_controller_isOnHover_Private();
	}
	return this._drill_GBu_isHover;
}
//==============================
// * 2D鼠标判定 - 悬停判定（私有）
//==============================
Drill_GBu_Controller.prototype.drill_controller_isOnHover_Private = function(){
	return this.drill_controller_isPointInCollision( _drill_mouse_x, _drill_mouse_y );
}
//==============================
// * 2D鼠标判定 - 悬停判定 - 点是否在当前碰撞体内（开放函数）
//==============================
Drill_GBu_Controller.prototype.drill_controller_isPointInCollision = function( x0, y0 ){
	if( this.drill_controller_isVisible() == false ){ return false; }
	
	// > 获取矩形的四个顶点
	var point_list = this.drill_controller_getRectPoint();
	if( point_list == null ){ return false; }
	
	// > 凸多边形判断
	var result = $gameTemp.drill_GBu_Math2D_isPointInConvexPolygon( x0, y0, point_list );
	if( result == true ){ return true; }
	return false;
}
//==============================
// * 2D鼠标判定 - 悬停判定 - 数学工具 - 获取两点的叉乘/向量积
//			
//			参数：	> x1,y1 数字   （第1个点）
//					> x2,y2 数字   （第2个点）
//			返回：	> 数字         （叉乘/向量积）
//			
//			说明：	> 注意点的先后顺序，另外该函数不存在无解的情况。
//==============================
Game_Temp.prototype.drill_GBu_Math2D_getCrossMultiplication = function( x1,y1,x2,y2 ){
    return x1*y2 - x2*y1;
}
//==============================
// * 2D鼠标判定 - 悬停判定 - 数学工具 - 判断点是否在凸多边形内
//			
//			参数：	> x0,y0 数字     （目标点）
//					> [{ x:0, y:0 }] （目标凸多边形，注意点的顺序，必须顺时针/逆时针）
//			返回：	> 布尔           （是/否）
//					> null           （无解）
//			
//			说明：	> 要留意无解的情况，并做相关处理。
//					> 凸多边形一定要保证点的顺序，顺序不对返回的全是false，最好先画出来看一下多边形。
//					> 多边形的连接线上也会返回true。
//==============================
Game_Temp.prototype.drill_GBu_Math2D_isPointInConvexPolygon = function( x0,y0, point_list ){
	
	// > 检查是否为合法多边形
	if( point_list.length < 3 ){ return null; }
	
	// > 多边形点遍历
	for(var i = 0; i < point_list.length; i++ ){
		var i_next =  (i+1) % point_list.length;
		var i_next2 = (i+2) % point_list.length;
		
		// > 每次往后取三个点
		var x1 = point_list[i].x;
		var y1 = point_list[i].y;
		var x2 = point_list[i_next].x;
		var y2 = point_list[i_next].y;
		var x3 = point_list[i_next2].x;
		var y3 = point_list[i_next2].y;
		
		// > 计算 目标点 到三点的向量值
		var v_x1 = x1 - x0;
		var v_y1 = y1 - y0;
		var v_x2 = x2 - x0;
		var v_y2 = y2 - y0;
		var v_x3 = x3 - x0;
		var v_y3 = y3 - y0;
		
		// > 计算是否同向
		var cross_1_2 = this.drill_GBu_Math2D_getCrossMultiplication( v_x1,v_y1, v_x2,v_y2 );
		var cross_2_3 = this.drill_GBu_Math2D_getCrossMultiplication( v_x2,v_y2, v_x3,v_y3 );
		if( cross_1_2*cross_2_3 < 0 ){
			return false;
		}
	}
	return true;
}


//==============================
// * 2E高亮与按下 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initHoverAndPress = function(){
	//	（无）
}

//==============================
// * 2F按钮执行 - 初始化子功能
//==============================
Drill_GBu_Controller.prototype.drill_controller_initButtonExecute = function(){
	this._drill_lastIsPress = false;
}
//==============================
// * 2F按钮执行 - 帧刷新
//==============================
Drill_GBu_Controller.prototype.drill_controller_updateButtonExecute = function(){
	var is_press = this.drill_controller_isOnPress();
	
	// > 释放按钮时
	if( this._drill_lastIsPress != is_press &&
		this._drill_lastIsPress == true ){
		
		// > 释放按钮时 - 执行
		if( this.drill_controller_isActive() == true ){
			this.drill_controller_buttonExecute();
		}
	}
	this._drill_lastIsPress = is_press;
}
//==============================
// * 2F按钮执行 - 执行『执行公共事件』（地图界面）
//==============================
Drill_GBu_Controller.prototype.drill_controller_buttonExecute = function(){
	var data = this.drill_data();
	
	// > 插件【地图-多线程】
	if( Imported.Drill_LayerCommandThread ){
		var e_data = {
			'type':"公共事件",
			'pipeType': data['pipeType'],
			'commonEventId': data['commonEventId'],
		};
		$gameMap.drill_LCT_addPipeEvent( e_data );
		
	// > 默认执行
	}else{
		$gameTemp.reserveCommonEvent( data['commonEventId'] );
	}
}


//=============================================================================
// ** 按钮贴图【Drill_GBu_Sprite】
// **
// **		作用域：	地图界面
// **		主功能：	定义一个按钮贴图。
// **		子功能：	
// **					->贴图『控制器与贴图』
// **						->是否就绪
// **						->优化策略
// **						->是否需要销毁（未使用）
// **						->销毁（手动）
// **					
// **					->A贴图主体
// **					->B变换特性
// **					->C对象绑定
// **						->设置控制器
// **						->贴图初始化（手动）
// **					->D指令叠加变化-控制器用
// **					->E延迟指令
// **					->F周期指令
// **					->G自变化效果
// **					
// **					->O播放GIF
// **					->P预加载GIF管理
// **					->Q随机位置
// **					
// **					->2A激活与封印『按钮的控制器与贴图』
// **					->2B自移动效果-控制器用
// **					->2C碰撞体-控制器用
// **					->2D鼠标判定
// **					->2E高亮与按下
// **					->2F按钮执行
// **					
// **		说明：	> 你必须在创建贴图后，手动初始化。（还需要先设置 控制器 ）
// **
// **		代码：	> 范围 - 该类显示单独的贴图。
// **				> 结构 - [合并/ ●分离 /混乱] 使用 控制器-贴图 结构。
// **				> 数量 - [单个/ ●多个] 
// **				> 创建 - [ ●一次性 /自延迟/外部延迟] 先创建控制器，再创建此贴图，通过 C对象绑定 进行连接。
// **				> 销毁 - [不考虑/自销毁/ ●外部销毁 ] 通过 控制器与贴图 模块来销毁。
// **				> 样式 - [ ●不可修改 /自变化/外部变化] 
//=============================================================================
//==============================
// * 按钮贴图 - 定义
//==============================
function Drill_GBu_Sprite() {
    this.initialize.apply(this, arguments);
};
Drill_GBu_Sprite.prototype = Object.create(Sprite.prototype);
Drill_GBu_Sprite.prototype.constructor = Drill_GBu_Sprite;
//==============================
// * 按钮贴图 - 初始化
//==============================
Drill_GBu_Sprite.prototype.initialize = function(){
	Sprite.prototype.initialize.call(this);
	this.drill_sprite_initSelf();				//初始化自身
};
//==============================
// * 按钮贴图 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.update = function(){
	if( this.drill_sprite_isReady() == false ){ return; }
	if( this.drill_sprite_isOptimizationPassed() == false ){ return; }
	Sprite.prototype.update.call(this);
	this.drill_sprite_updateAttr();					//帧刷新 - A贴图主体
	this.drill_sprite_updateChange();				//帧刷新 - B变换特性
													//帧刷新 - C对象绑定（无）
	this.drill_sprite_updateCommandChange();		//帧刷新 - D指令叠加变化-控制器用
													//帧刷新 - E延迟指令（无）
													//帧刷新 - F周期指令（无）
	this.drill_sprite_updateEffect();				//帧刷新 - G自变化效果
	
	this.drill_sprite_updateGIF();					//帧刷新 - O播放GIF
	this.drill_sprite_updatePreload();				//帧刷新 - P预加载GIF管理
													//帧刷新 - Q随机位置（无）
	
													//帧刷新 - 2A激活与封印（无）
	this.drill_sprite_updateSlideAnim();			//帧刷新 - 2B自移动效果-控制器用
													//帧刷新 - 2C碰撞体-控制器用（无）
													//帧刷新 - 2D鼠标判定（无）
	this.drill_sprite_updateHoverAndPress_Visible();//帧刷新 - 2E高亮与按下 - 贴图显示
	this.drill_sprite_updateHoverAndPress_Sound();	//帧刷新 - 2E高亮与按下 - 声音播放
													//帧刷新 - 2F按钮执行（无）
}

//##############################
// * C对象绑定 - 设置控制器【开放函数】
//			
//			参数：	> controller 控制器对象
//			返回：	> 无
//			
//			说明：	> 由于贴图与数据分离，贴图必须依赖一个数据对象。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_setController = function( controller ){
	this._drill_controller = controller;
	this._drill_curSerial = controller._drill_controllerSerial;
};
//##############################
// * C对象绑定 - 初始化子功能『控制器与贴图』【开放函数】
//			
//			参数：	> 无
//			返回：	> 无
//			
//			说明：	> 需要设置 控制器 之后，才能进行初始化。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_initChild = function(){
	this.drill_sprite_initAttr();				//初始化子功能 - A贴图主体
	this.drill_sprite_initChange();				//初始化子功能 - B变换特性
												//初始化子功能 - C对象绑定（无）
	this.drill_sprite_initCommandChange();		//初始化子功能 - D指令叠加变化-控制器用
	this.drill_sprite_initDelayingCommand();	//初始化子功能 - E延迟指令
	this.drill_sprite_initPeriodizeCommand();	//初始化子功能 - F周期指令
	this.drill_sprite_initEffect();				//初始化子功能 - G自变化效果
	
	this.drill_sprite_initGIF();				//初始化子功能 - O播放GIF
	this.drill_sprite_initPreload();			//初始化子功能 - P预加载GIF管理
	this.drill_sprite_initRandomPos();			//初始化子功能 - Q随机位置
	
	this.drill_sprite_initDeactive();			//初始化子功能 - 2A激活与封印
	this.drill_sprite_initSlideAnim();			//初始化子功能 - 2B自移动效果-控制器用
	this.drill_sprite_initCollision();			//初始化子功能 - 2C碰撞体-控制器用
	this.drill_sprite_initMouse();				//初始化子功能 - 2D鼠标判定
	this.drill_sprite_initHoverAndPress();		//初始化子功能 - 2E高亮与按下
	this.drill_sprite_initButtonExecute();		//初始化子功能 - 2F按钮执行
};

//##############################
// * 按钮贴图 - 是否就绪【标准函数】
//			
//			参数：	> 无
//			返回：	> 布尔（是否显示）
//			
//			说明：	> 这里完全 不考虑 延迟加载问题。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_isReady = function(){
	if( this._drill_controller == undefined ){ return false; }
    return true;
};
//##############################
// * 按钮贴图 - 优化策略【标准函数】
//			
//			参数：	> 无
//			返回：	> 布尔（是否通过）
//			
//			说明：	> 通过时，正常帧刷新；未通过时，不执行帧刷新。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_isOptimizationPassed = function(){
	return true;
};
//##############################
// * 按钮贴图 - 是否需要销毁【标准函数】
//			
//			参数：	> 无
//			返回：	> 布尔（是否需要销毁）
//			
//			说明：	> 此函数可用于监听 控制器数据 是否被销毁，数据销毁后，贴图可自动销毁。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_isNeedDestroy = function(){
	if( this._drill_controller == undefined ){ return false; }	//（未绑定时，不销毁）
	if( this._drill_controller._drill_needDestroy == true ){ return true; }
    return false;
};
//##############################
// * 按钮贴图 - 销毁【标准函数】
//			
//			参数：	> 无
//			返回：	> 无
//			
//			说明：	> 销毁不是必要的，但最好随时留意给 旧贴图 执行销毁函数。
//##############################
Drill_GBu_Sprite.prototype.drill_sprite_destroy = function(){
	this.drill_sprite_destroyChild();			//销毁 - 销毁子功能
	this.drill_sprite_destroySelf();			//销毁 - 销毁自身
};
//==============================
// * 按钮贴图 - 初始化自身『控制器与贴图』
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initSelf = function(){
	this._drill_controller = null;				//控制器对象
	this._drill_curSerial = -1;					//当前序列号
};
//==============================
// * 按钮贴图 - 销毁子功能『控制器与贴图』
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_destroyChild = function(){
	if( this._drill_controller == null ){ return; }
	
	// > 销毁 - 2A激活与封印
	this._drill_layerSprite.removeChild( this._drill_childDeactiveSprite );
	this._drill_childDeactiveSprite = null;
	
	// > 销毁 - 2B自移动效果-控制器用
	//	（无）
	
	// > 销毁 - 2C碰撞体-控制器用
	//	（无）
	
	// > 销毁 - 2D鼠标判定
	//	（无）
	
	// > 销毁 - 2E高亮与按下
	if( this._drill_childHoverSprite != undefined ){
		this._drill_layerSprite.removeChild( this._drill_childHoverSprite );
		this._drill_childHoverSprite = null;
	}
	if( this._drill_childPressSprite != undefined ){
		this._drill_layerSprite.removeChild( this._drill_childPressSprite );
		this._drill_childPressSprite = null;
	}
	if( this._drill_childDeactiveHoverSprite != undefined ){
		this._drill_layerSprite.removeChild( this._drill_childDeactiveHoverSprite );
		this._drill_childDeactiveHoverSprite = null;
	}
	if( this._drill_childDeactivePressSprite != undefined ){
		this._drill_layerSprite.removeChild( this._drill_childDeactivePressSprite );
		this._drill_childDeactivePressSprite = null;
	}
	
	
	// > 销毁 - A贴图主体
	this.visible = false;
	this._drill_layerSprite.removeChild( this._drill_childGIFSprite );
	this.removeChild( this._drill_layerSprite );
	this._drill_childGIFSprite = null;
	this._drill_layerSprite = null;
	
	// > 销毁 - B变换特性
	//	（无）
	
	// > 销毁 - C对象绑定
	//	（无）
	
	// > 销毁 - O播放GIF
	//	（无）
	// > 销毁 - P预加载GIF管理
	//	（无）
	// > 销毁 - Q随机位置
	//	（无）
};
//==============================
// * 按钮贴图 - 销毁自身『控制器与贴图』
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_destroySelf = function(){
	this._drill_controller = null;				//控制器对象
	this._drill_curSerial = -1;					//当前序列号
};


//==============================
// * A贴图主体 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initAttr = function(){
	var data = this._drill_controller.drill_data();
	/*
		贴图的层级如下：
			- 主体贴图（this）
			- - 层贴图（_drill_layerSprite）
			- - - 圈贴图（_drill_childGIFSprite）
		
		其中，圈贴图专门用于旋转（所以缩放必须为1.0），层贴图可以带遮罩，
		主体贴图和层贴图的缩放旋转效果一样，可以看情况自定义，不需要刻意区分。
	*/
	
	// > 主体贴图
	this.anchor.x = 0.5;
	this.anchor.y = 0.5;
	this.visible = this._drill_controller.drill_controller_isVisible();		//贴图 - 显示/隐藏
																			//贴图 - 暂停/继续（无）
	this.blendMode = this._drill_controller._drill_blendMode;				//贴图 - 混合模式
	this.layerIndex = this._drill_controller._drill_layerIndex;				//贴图 - 层级
	this.zIndex = this._drill_controller._drill_zIndex;						//贴图 - 堆叠级
	
	// > 圈贴图
	var temp_sprite = new Drill_GBu_ChildGIFSprite(); 
	temp_sprite.anchor.x = 0.5;
	temp_sprite.anchor.y = 0.5;
	temp_sprite.blendMode = this._drill_controller._drill_blendMode;
	temp_sprite.bitmap = this.drill_sprite_getGIFBitmapByIndex( 0 );	//（第1帧GIF）
	this._drill_childGIFSprite = temp_sprite;
	
	// > 层贴图
	var temp_layer = new Sprite();		//GIF样式两层容器
	temp_layer.anchor.x = 0.5;
	temp_layer.anchor.y = 0.5;
	temp_layer.blendMode = this._drill_controller._drill_blendMode;
	this._drill_layerSprite = temp_layer;
	
	this._drill_layerSprite.addChild( this._drill_childGIFSprite );
	this.addChild( this._drill_layerSprite );
}
//==============================
// * A贴图主体 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateAttr = function(){
	
	// > 基础特性 - 显示/隐藏
	this.visible = this._drill_controller.drill_controller_isVisible();
	
	// > 基础特性 - 暂停/继续
	//	（无）
	
	// > 基础特性 - 混合模式
	if( this.blendMode != this._drill_controller._drill_blendMode ){
		this.blendMode =  this._drill_controller._drill_blendMode;
		this._drill_layerSprite.blendMode = this._drill_controller._drill_blendMode;
		this._drill_childGIFSprite.blendMode = this._drill_controller._drill_blendMode;
	}
	
	//（其它 基础特性 的帧刷新赋值见：drill_GBu_updateAttr）
}


//==============================
// * B变换特性 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initChange = function(){
	
	// > 强制帧刷新（确保与控制器初始 变换值 同步）
	this.drill_sprite_updateChange();
}
//==============================
// * B变换特性 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateChange = function(){
	
	// > 贴图 - 锚点（圈贴图）
	//		（锚点只能放 圈贴图 才能有效）
	this._drill_childGIFSprite.anchor.x = this._drill_controller._drill_change_anchor_x;
	this._drill_childGIFSprite.anchor.y = this._drill_controller._drill_change_anchor_y;
	
	
	// > 贴图 - 位置
	var xx = this._drill_controller.drill_controller_finalTransform_x();
	var yy = this._drill_controller.drill_controller_finalTransform_y();
	this.x = xx;
	this.y = yy;
	
	
	// > 贴图 - 缩放
	this._drill_layerSprite.scale.x  = this._drill_controller.drill_controller_finalTransform_scaleX();
	this._drill_layerSprite.scale.y  = this._drill_controller.drill_controller_finalTransform_scaleY();
	
	// > 贴图 - 缩放（圈贴图）
	//	（无）
	
	
	// > 贴图 - 透明度
	this.opacity = this._drill_controller.drill_controller_finalTransform_opacity();
	
	
	// > 贴图 - 斜切
	this._drill_layerSprite.skew.x   = this._drill_controller.drill_controller_finalTransform_skewX();
	this._drill_layerSprite.skew.y   = this._drill_controller.drill_controller_finalTransform_skewY();
	
	// > 贴图 - 斜切（圈贴图）
	//	（无）
	
	
	// > 贴图 - 旋转
	this.rotation = this._drill_controller.drill_controller_finalTransform_rotate() *Math.PI/180;
	
	// > 贴图 - 旋转（圈贴图）
	this._drill_childGIFSprite.rotation = this._drill_controller._drill_childGIF_rotation *Math.PI/180;
}


//==============================
// * C对象绑定 - 初始化子功能
//==============================
//（无，此处不要赋值）


//==============================
// * D指令叠加变化-控制器用 - 初始化子功能
//
//			说明：	> 此处使用弹道核心提供的 弹道扩展工具-A叠加变化宏定义 贴图部分。
//					> 之所以把代码放这里，是因为 控制器-贴图 一对一，且可以节约弹道计算的存储空间。
//					> 参数使用字符串进行控制，默认为 null 值。
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initCommandChange = function(){
	
	// > 贴图参数 - 移动到
	this["_drill_command_move_spriteData"] = undefined;
	
	// > 贴图参数 - 透明度
	this["_drill_command_opacity_spriteData"] = undefined;
	
	// > 贴图参数 - 旋转
	this["_drill_command_rotate_spriteData"] = undefined;
	// > 贴图参数 - 转速
	this["_drill_command_rotateSpeed_spriteData"] = undefined;
	
	// > 贴图参数 - 缩放X
	this["_drill_command_scaleX_spriteData"] = undefined;
	// > 贴图参数 - 缩放Y
	this["_drill_command_scaleY_spriteData"] = undefined;
	
	// > 贴图参数 - 斜切X
	this["_drill_command_skewX_spriteData"] = undefined;
	// > 贴图参数 - 斜切Y
	this["_drill_command_skewY_spriteData"] = undefined;
}
//==============================
// * D指令叠加变化-控制器用 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateCommandChange = function(){
	var data = this._drill_controller.drill_data();
	var controller = this._drill_controller;
	
	// > 移动到 - 帧刷新
	var CDataName = "_drill_command_move_data";
	var SDataName = "_drill_command_move_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_sprite_update( this, SDataName, controller, CDataName );
	
	// > 移动到 - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_x = controller[CDataName]['cur_valueA'];
		controller._drill_change_y = controller[CDataName]['cur_valueB'];
	}else{
		controller._drill_change_x = data['x'];	//（没有数据时，赋值为 初始值）
		controller._drill_change_y = data['y'];
	}
	
	
	// > 透明度 - 帧刷新
	var CDataName = "_drill_command_opacity_data";
	var SDataName = "_drill_command_opacity_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 透明度 - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_opacity = controller[CDataName]['cur_value'];
	}else{
		controller._drill_change_opacity = data['opacity'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 旋转 - 帧刷新
	var CDataName = "_drill_command_rotate_data";
	var SDataName = "_drill_command_rotate_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 旋转 - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_rotate = controller[CDataName]['cur_value'];	//（整体再旋转角度）
	}else{
		controller._drill_change_rotate = data['parentRotate'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 转速 - 帧刷新
	var CDataName = "_drill_command_rotateSpeed_data";
	var SDataName = "_drill_command_rotateSpeed_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 转速 - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_childGIF_rotateSpeed = controller[CDataName]['cur_value'];
	}else{
		controller._drill_childGIF_rotateSpeed = data['rotate'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 缩放X - 帧刷新
	var CDataName = "_drill_command_scaleX_data";
	var SDataName = "_drill_command_scaleX_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 缩放X - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_scaleX = controller[CDataName]['cur_value'];
	}else{
		controller._drill_change_scaleX = data['scale_x'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 缩放Y - 帧刷新
	var CDataName = "_drill_command_scaleY_data";
	var SDataName = "_drill_command_scaleY_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 缩放Y - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_scaleY = controller[CDataName]['cur_value'];
	}else{
		controller._drill_change_scaleY = data['scale_y'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 斜切X - 帧刷新
	var CDataName = "_drill_command_skewX_data";
	var SDataName = "_drill_command_skewX_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 斜切X - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_skewX = controller[CDataName]['cur_value'];
	}else{
		controller._drill_change_skewX = data['skew_x'];	//（没有数据时，赋值为 初始值）
	}
	
	
	// > 斜切Y - 帧刷新
	var CDataName = "_drill_command_skewY_data";
	var SDataName = "_drill_command_skewY_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Common_sprite_update( this, SDataName, controller, CDataName );
	
	// > 斜切Y - 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_change_skewY = controller[CDataName]['cur_value'];
	}else{
		controller._drill_change_skewY = data['skew_y'];	//（没有数据时，赋值为 初始值）
	}
}


//==============================
// * E延迟指令 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initDelayingCommand = function(){
	//（无）
}

//==============================
// * F周期指令 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initPeriodizeCommand = function(){
	//（无）
}


//==============================
// * G自变化效果 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initEffect = function(){
	//（无）
}
//==============================
// * G自变化效果 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateEffect = function(){
	var data = this._drill_controller.drill_data();
	var cur_time = this._drill_controller._drill_curEffectTime;
	
	// > 浮动效果
	if( data['effect_float'] == "左右浮动" ){
		var speed = data['effect_floatSpeed'];
		var range = data['effect_floatRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this.x += value;
	}
	if( data['effect_float'] == "上下浮动" ){
		var speed = data['effect_floatSpeed'];
		var range = data['effect_floatRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this.y += value;
	}
	if( data['effect_float'] == "左上右下斜向浮动" ){
		var speed = data['effect_floatSpeed'];
		var range = data['effect_floatRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this.x += value;
		this.y += value;
	}
	if( data['effect_float'] == "右上左下斜向浮动" ){
		var speed = data['effect_floatSpeed'];
		var range = data['effect_floatRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this.x -= value;
		this.y += value;
	}
	// > 闪烁效果
	if( data['effect_flicker'] == "开启" ){
		var speed = data['effect_flickerSpeed'];
		var range = data['effect_flickerRange'];
		this.opacity += range * Math.sin( cur_time * speed /180*Math.PI );
	}
	// > 摇晃效果
	if( data['effect_swing'] == "开启" ){
		var speed = data['effect_swingSpeed'];
		var range = data['effect_swingRange'];
		var value = range / 180 * Math.PI * Math.sin( cur_time * speed /180*Math.PI );
		this._drill_childGIFSprite.rotation += value;
	}
	// > 缩放效果
	if( data['effect_zoom'] == "左右缩放" ){
		var speed = data['effect_zoomSpeed'];
		var range = data['effect_zoomRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this._drill_layerSprite.scale.x += value;
	}
	if( data['effect_zoom'] == "上下缩放" ){
		var speed = data['effect_zoomSpeed'];
		var range = data['effect_zoomRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this._drill_layerSprite.scale.y += value;
	}
	if( data['effect_zoom'] == "整体缩放" ){
		var speed = data['effect_zoomSpeed'];
		var range = data['effect_zoomRange'];
		var value = range * Math.sin( cur_time * speed /180*Math.PI );
		this._drill_layerSprite.scale.x += value;
		this._drill_layerSprite.scale.y += value;
	}
}


//==============================
// * O播放GIF - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initGIF = function(){
	//	（无）
}
//==============================
// * O播放GIF - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateGIF = function(){
	if( this.visible != true ){ return; }	//（显示时才帧刷新）
	
	// > 圈贴图 - 第N帧GIF
	this._drill_childGIFSprite.bitmap = this.drill_sprite_getGIFBitmapByIndex( this._drill_controller._drill_GIF_index );
}
//==============================
// * O播放GIF - 获取资源bitmap
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_getGIFBitmapByIndex = function( index ){
	
	// > 缓存容器 - 创建
	//		（不管有没有预加载，loadBitmap后，都要有一个容器接住，不然bitmap会被清理，导致闪）
	if( this._drill_GIF_bitmapTank == undefined ){
		this._drill_GIF_bitmapTank = [];
	}
	// > 缓存容器 - 返回缓存的资源
	if( this._drill_GIF_bitmapTank[ index ] != undefined ){
		return this._drill_GIF_bitmapTank[ index ];
	}
	
	// > 载入资源
	var data = this._drill_controller.drill_data();
	var bitmap_filename = data['src_img_gif'][ index ];
	if( bitmap_filename == undefined ){ bitmap_filename = ""; }
	var bitmap = ImageManager.loadBitmap( data['src_img_file'], bitmap_filename, data['tint'], data['smooth'] );
	
	// > 缓存容器 - 记录资源
	this._drill_GIF_bitmapTank[ index ] = bitmap;
	
	return bitmap;
}

//==============================
// * P预加载GIF管理 - 初始化子功能
//
//			说明：	> 该功能在贴图内，已经不是预加载，而是边播放边加载。
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initPreload = function(){
	this._drill_load_curTime = 0;			//当前加载时间
}
//==============================
// * P预加载GIF管理 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updatePreload = function(){
	if( this.visible != true ){ return; }	//（显示时才帧刷新）
	var data = this._drill_controller.drill_data();
	
	// > 时间+1
	this._drill_load_curTime += 1;
	
	// > 加载控制
	if( data['preloadType'] == "固定预加载数量" ){
		var index = this._drill_load_curTime + data['preloadNum'] -1 ;
		if( index < data['src_img_gif'].length ){
			this.drill_sprite_getGIFBitmapByIndex( index );	//（只要在适当的时机去激活 获取资源bitmap 即可）
			//alert( index );
		}
	}
	
	
	// > 测试 - 加载情况1
	//		（第1帧时间，加载开始时，预加载的已经有了，接下来每帧加载剩下的，这时true的数量为 固定预加载的数量 ）
	//if( this._drill_load_curTime == 1 ){
	//	var isReady_tank = this.drill_sprite_getReadyTank_ForDebug();
	//	var isReady_text = "第1帧：" + String( isReady_tank.length ) + "\n" + isReady_tank.join(",");
	//	alert( isReady_text );
	//}
	
	// > 测试 - 加载情况2
	//		（第6帧时间，已经开始加载6个，会比 情况1 多0~6个true）
	//		（注意，alert弹出时也在加载，两种情况要分别注释来测试）
	//if( this._drill_load_curTime == 6 ){
	//	var isReady_tank = this.drill_sprite_getReadyTank_ForDebug();
	//	var isReady_text = "第6帧：" + String( isReady_tank.length ) + "\n" + isReady_tank.join(",");
	//	alert( isReady_text );
	//}
}
//==============================
// * P预加载GIF管理 - 获取加载情况列表（私有）
//
//			说明：	> 该函数用于 测试 加载情况。
//					> 注意，该函数执行一次后，所有资源就开始加载了。
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_getReadyTank_ForDebug = function(){
	var data = this._drill_controller.drill_data();
	var isReady_tank = [];
	for( var i = 0; i < data['src_img_gif'].length; i++ ){
		var bitmap = this.drill_sprite_getGIFBitmapByIndex(i);
		isReady_tank.push( bitmap.isReady() );
	}
	return isReady_tank;
}

//==============================
// * Q随机位置 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initRandomPos = function(){
	//	（无）
}


//==============================
// * 2A激活与封印 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initDeactive = function(){
	var data = this._drill_controller.drill_data();
	/*
		贴图的层级如下：
			- 主体贴图（this）
			- - 层贴图（_drill_layerSprite）
			- - - 圈贴图（_drill_childGIFSprite）
			- - - 封印用贴图（_drill_childDeactiveSprite）
			
		按钮可以通过插件指令随时设置封印，所以封印贴图必须创建。
	*/
	
	this._drill_sprite_deactiveBitmap = null;
	
	// > 封印用贴图
	var temp_sprite = new Sprite();
	temp_sprite.anchor.x = this._drill_controller._drill_change_anchor_x;
	temp_sprite.anchor.y = this._drill_controller._drill_change_anchor_y;
	temp_sprite.blendMode = this._drill_controller._drill_blendMode;
	this._drill_childDeactiveSprite = temp_sprite;
	this._drill_layerSprite.addChild( this._drill_childDeactiveSprite );
}
//==============================
// * 2A激活与封印 - 帧刷新
//==============================
//	（见函数 _drill_GBu_GBu_sprite_updateGIF ）

//==============================
// * 2B自移动效果-控制器用 - 初始化子功能
//
//			说明：	> 此处使用弹道核心提供的 弹道扩展工具-A叠加变化宏定义 贴图部分。
//					> 之所以把代码放这里，是因为 控制器-贴图 一对一，且可以节约弹道计算的存储空间。
//					> 参数使用字符串进行控制，默认为 null 值。
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initSlideAnim = function(){
	
	// > 贴图参数
	this["_drill_slideAnim_move_spriteData"] = undefined;
}
//==============================
// * 2B自移动效果-控制器用 - 帧刷新
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateSlideAnim = function(){
	var data = this._drill_controller.drill_data();
	var controller = this._drill_controller;
	
	// > 帧刷新
	var CDataName = "_drill_slideAnim_move_data";
	var SDataName = "_drill_slideAnim_move_spriteData";
	Drill_COBa_ExtendTool.drill_COBa_Planimetry_sprite_update( this, SDataName, controller, CDataName );
	
	// > 控制器赋值（覆盖）
	if( controller[CDataName] != undefined ){
		controller._drill_slideAnim_x = controller[CDataName]['cur_valueA'];
		controller._drill_slideAnim_y = controller[CDataName]['cur_valueB'];
	}else{
		controller._drill_slideAnim_x = 0;	//（没有数据时，赋值为 初始值）
		controller._drill_slideAnim_y = 0;
	}
}

//==============================
// * 2C碰撞体-控制器用 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initCollision = function(){
	//（无）
	//（见贴图类 Drill_GBu_ChildGIFSprite ）
};

//==============================
// * 2D鼠标判定 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initMouse = function(){
	//（无）
};

//==============================
// * 2E高亮与按下 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initHoverAndPress = function(){
	var data = this._drill_controller.drill_data();
	/*
		贴图的层级如下：
			- 主体贴图（this）
			- - 层贴图（_drill_layerSprite）
			- - - 圈贴图（_drill_childGIFSprite）
			- - - 封印用贴图（_drill_childDeactiveSprite）
			
			- - - 高亮用贴图（_drill_childHoverSprite）
			- - - 按下用贴图（_drill_childPressSprite）
			- - - 封印且高亮用贴图（_drill_childDeactiveHoverSprite）
			- - - 封印且按下用贴图（_drill_childDeactivePressSprite）
		
		高亮与按下的功能，只考虑在 静态数据 中配置，不考虑动态变化。不要浪费太多贴图。
	*/
	
	// > 高亮用贴图
	if( data['highlight_mode'].indexOf("关闭") == -1 ){
		var temp_sprite = new Sprite();
		temp_sprite.anchor.x = this._drill_controller._drill_change_anchor_x;
		temp_sprite.anchor.y = this._drill_controller._drill_change_anchor_y;
		temp_sprite.blendMode = this._drill_controller._drill_blendMode;
		temp_sprite.bitmap = ImageManager.loadBitmap( data['highlight_src_img_file'], data['highlight_src_img'], data['tint'], data['smooth'] );
		this._drill_childHoverSprite = temp_sprite;
		this._drill_layerSprite.addChild( this._drill_childHoverSprite );
	}
	
	// > 按下用贴图
	if( data['pushdown_mode'].indexOf("关闭") == -1 ){
		var temp_sprite = new Sprite();
		temp_sprite.anchor.x = this._drill_controller._drill_change_anchor_x;
		temp_sprite.anchor.y = this._drill_controller._drill_change_anchor_y;
		temp_sprite.blendMode = this._drill_controller._drill_blendMode;
		temp_sprite.bitmap = ImageManager.loadBitmap( data['pushdown_src_img_file'], data['pushdown_src_img'], data['tint'], data['smooth'] );
		this._drill_childPressSprite = temp_sprite;
		this._drill_layerSprite.addChild( this._drill_childPressSprite );
	}
	
	// > 封印且高亮用贴图
	if( data['highlightD_mode'].indexOf("关闭") == -1 ){
		var temp_sprite = new Sprite();
		temp_sprite.anchor.x = this._drill_controller._drill_change_anchor_x;
		temp_sprite.anchor.y = this._drill_controller._drill_change_anchor_y;
		temp_sprite.blendMode = this._drill_controller._drill_blendMode;
		temp_sprite.bitmap = ImageManager.loadBitmap( data['highlightD_src_img_file'], data['highlightD_src_img'], data['tint'], data['smooth'] );
		this._drill_childDeactiveHoverSprite = temp_sprite;
		this._drill_layerSprite.addChild( this._drill_childDeactiveHoverSprite );
	}
	
	// > 封印且按下用贴图
	if( data['pushdownD_mode'].indexOf("关闭") == -1 ){
		var temp_sprite = new Sprite();
		temp_sprite.anchor.x = this._drill_controller._drill_change_anchor_x;
		temp_sprite.anchor.y = this._drill_controller._drill_change_anchor_y;
		temp_sprite.blendMode = this._drill_controller._drill_blendMode;
		temp_sprite.bitmap = ImageManager.loadBitmap( data['pushdownD_src_img_file'], data['pushdownD_src_img'], data['tint'], data['smooth'] );
		this._drill_childDeactivePressSprite = temp_sprite;
		this._drill_layerSprite.addChild( this._drill_childDeactivePressSprite );
	}
	
	this._drill_sprite_lastIsHover = false;
	this._drill_sprite_lastIsPress = false;
}
//==============================
// * 2E高亮与按下 - 帧刷新 - 贴图显示
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateHoverAndPress_Visible = function(){
	var data = this._drill_controller.drill_data();
	
	// > 隐藏全部子贴图（此处控制 子贴图的显示，与父贴图的显示无关）
	this._drill_childGIFSprite.visible = true;
	this._drill_childDeactiveSprite.visible = false;
	if( this._drill_childHoverSprite != undefined ){ this._drill_childHoverSprite.visible = false; }
	if( this._drill_childPressSprite != undefined ){ this._drill_childPressSprite.visible = false; }
	if( this._drill_childDeactiveHoverSprite != undefined ){ this._drill_childDeactiveHoverSprite.visible = false; }
	if( this._drill_childDeactivePressSprite != undefined ){ this._drill_childDeactivePressSprite.visible = false; }
	
	// > 激活
	if( this._drill_controller.drill_controller_isActive() == true ){
		
		// > 激活+高亮
		if( this._drill_controller.drill_GBu_isOnOnlyHover() == true ){	//（唯一悬停）
			
			// > 激活+高亮+按下
			if( this._drill_controller.drill_controller_isOnPress() == true ){
				
				if( this._drill_childPressSprite != undefined ){
					if( data['pushdown_mode'] == "贴图叠加" ){
						this._drill_childGIFSprite.visible = true;
						this._drill_childPressSprite.visible = true;
					}else if( data['pushdown_mode'] == "贴图切换" ){
						this._drill_childGIFSprite.visible = false;
						this._drill_childPressSprite.visible = true;
					}
				}
				
			// > 激活+高亮+不按下
			}else{
				
				if( this._drill_childHoverSprite != undefined ){
					if( data['highlight_mode'] == "贴图叠加" ){
						this._drill_childGIFSprite.visible = true;
						this._drill_childHoverSprite.visible = true;
					}else if( data['highlight_mode'] == "贴图切换" ){
						this._drill_childGIFSprite.visible = false;
						this._drill_childHoverSprite.visible = true;
					}
				}
				
			}
			
		// > 激活+不高亮
		}else{
			//（不操作）
		}
		
		
	// > 封印
	}else{
		
		// （封印时才载入资源）
		if( this._drill_sprite_deactiveBitmap == undefined ){
			this._drill_sprite_deactiveBitmap = ImageManager.loadBitmap( data['deactive_src_img_file'], data['deactive_src_img'], data['tint'], data['smooth'] );
			this._drill_childDeactiveSprite.bitmap = this._drill_sprite_deactiveBitmap;
		}
		this._drill_childDeactiveSprite.visible = true;
		if( data['deactive_mode'] == "贴图叠加" ){
			this._drill_childGIFSprite.visible = true;
		}else if( data['deactive_mode'] == "贴图切换" ){
			this._drill_childGIFSprite.visible = false;
		}
		
		// > 封印+高亮
		if( this._drill_controller.drill_GBu_isOnOnlyHover() == true ){	//（唯一悬停）
			
			// > 封印+高亮+按下
			if( this._drill_controller.drill_controller_isOnPress() == true ){
				
				if( this._drill_childDeactivePressSprite != undefined ){
					if( data['pushdownD_mode'] == "贴图叠加" ){
						this._drill_childDeactiveSprite.visible = true;
						this._drill_childDeactivePressSprite.visible = true;
					}else if( data['pushdownD_mode'] == "贴图切换" ){
						this._drill_childDeactiveSprite.visible = false;
						this._drill_childDeactivePressSprite.visible = true;
					}
				}
				
			// > 激活+高亮+不按下
			}else{
				
				if( this._drill_childDeactiveHoverSprite != undefined ){
					if( data['highlightD_mode'] == "贴图叠加" ){
						this._drill_childDeactiveSprite.visible = true;
						this._drill_childDeactiveHoverSprite.visible = true;
					}else if( data['highlightD_mode'] == "贴图切换" ){
						this._drill_childDeactiveSprite.visible = false;
						this._drill_childDeactiveHoverSprite.visible = true;
					}
				}
			}
			
		// > 封印+不高亮
		}else{
			//（不操作）
		}
			
		// > 封印时的高亮透明度
		if( data['highlightD_mode'] == "透明度切换" ){
			if( this._drill_controller.drill_GBu_isOnOnlyHover() == true ){	//（唯一悬停）
				this._drill_childDeactiveSprite.opacity = data['highlightD_opacity2'];
			}else{
				this._drill_childDeactiveSprite.opacity = data['highlightD_opacity1'];
			}
		}
	}
}
//==============================
// * 2E高亮与按下 - 帧刷新 - 声音播放
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_updateHoverAndPress_Sound = function(){
	var data = this._drill_controller.drill_data();
	var is_hover = this._drill_controller.drill_GBu_isOnOnlyHover();	//（唯一悬停）
	var is_press = this._drill_controller.drill_controller_isOnPress();
	
	// > 高亮时（声音）
	if( this._drill_sprite_lastIsHover != is_hover &&
		this._drill_sprite_lastIsHover == false ){
		
		// > 高亮时+激活（声音）
		if( this._drill_controller.drill_controller_isActive() == true ){
			
			if( data['highlight_soundMode'] == "使用'选择'音效" ){
				SoundManager.playCursor();
			}else if( data['highlight_soundMode'] == "使用自定义音效" ){
				AudioManager.playStaticSe( data['highlight_sound'] );
			}
			
		// > 高亮时+封印（声音）
		}else{
			
			if( data['highlightD_soundMode'] == "使用'选择'音效" ){
				SoundManager.playCursor();
			}else if( data['highlightD_soundMode'] == "使用自定义音效" ){
				AudioManager.playStaticSe( data['highlightD_sound'] );
			}
		}
	}
	
	// > 按下时（声音）
	if( this._drill_sprite_lastIsPress != is_press &&
		this._drill_sprite_lastIsPress == false ){
		
		// > 按下时+激活（声音）
		if( this._drill_controller.drill_controller_isActive() == true ){
			
			if( data['pushdown_soundMode'] == "使用'确定'音效" ){
				SoundManager.playOk();
			}else if( data['pushdown_soundMode'] == "使用自定义音效" ){
				AudioManager.playStaticSe( data['pushdown_sound'] );
			}
			
		// > 按下时+封印（声音）
		}else{
			
			if( data['pushdownD_soundMode'] == "使用'错误'音效" ){
				SoundManager.playBuzzer();
			}else if( data['pushdownD_soundMode'] == "使用自定义音效" ){
				AudioManager.playStaticSe( data['pushdownD_sound'] );
			}
		}
	}
	
	this._drill_sprite_lastIsHover = is_hover;
	this._drill_sprite_lastIsPress = is_press;
}

//==============================
// * 2F按钮执行 - 初始化子功能
//==============================
Drill_GBu_Sprite.prototype.drill_sprite_initButtonExecute = function(){
	//（无）
};


//=============================================================================
// ** 按钮GIF子贴图【Drill_GBu_ChildGIFSprite】
// **
// **		作用域：	地图界面
// **		主功能：	定义一个按钮GIF子贴图。
// **		子功能：	
// **					->子贴图
// **						x->是否就绪
// **						x->优化策略
// **						x->是否需要销毁
// **						x->销毁
// **					
// **					->2C碰撞体-控制器用『按钮的控制器与贴图』
// **					
// **		说明：	> 该贴图功能仍由父贴图控制。（就是单纯的Sprite）
// **				> 用于功能 2C碰撞体-控制器用，因为要继承底层函数 _refresh。（不要继承大父类 Sprite）
// **
// **		代码：	> 范围 - 该类为贴图嵌套贴图。
// **				> 结构 - [ ●合并 /分离/混乱] 
// **				> 数量 - [单个/ ●多个] 该贴图与父贴图一对一。
// **				> 创建 - [ ●一次性 /自延迟/外部延迟]
// **				> 销毁 - [不考虑/自销毁/ ●外部销毁 ] 通过 父贴图 来销毁。
// **				> 样式 - [ ●不可修改 /自变化/外部变化]
//=============================================================================
//==============================
// * 按钮GIF子贴图 - 定义
//==============================
function Drill_GBu_ChildGIFSprite() {
    this.initialize.apply(this, arguments);
};
Drill_GBu_ChildGIFSprite.prototype = Object.create(Sprite.prototype);
Drill_GBu_ChildGIFSprite.prototype.constructor = Drill_GBu_ChildGIFSprite;
//==============================
// * 按钮GIF子贴图 - 2C碰撞体-控制器用 - 刷新框架『贴图框架值』（_realFrame）
//
//			说明：	> 此处 非帧刷新，而是在 贴图底层 发生刷新改变时，才变化值。
//==============================
var _drill_GBu_collision__refresh = Drill_GBu_ChildGIFSprite.prototype._refresh;
Drill_GBu_ChildGIFSprite.prototype._refresh = function(){
	_drill_GBu_collision__refresh.call(this);
	if( this.parent != undefined &&
		this.parent.parent != undefined &&
		this.parent.parent instanceof Drill_GBu_Sprite == true ){
		this.drill_GBu__refreshFrame();
	}
};
//==============================
// * 按钮GIF子贴图 - 2C碰撞体-控制器用 - 刷新框架
//
//			说明：	> 因为 控制器-贴图 一对一，父贴图-子贴图 一对一，所以子贴图可以修改控制器的值。
//==============================
Drill_GBu_ChildGIFSprite.prototype.drill_GBu__refreshFrame = function(){
	var parent_sprite = this.parent.parent;	//（Drill_GBu_Sprite对象）
	
	// > 『贴图框架值归零』 - 未读取时不赋值
	if( this.bitmap == undefined ){
		parent_sprite._drill_controller._drill_collision_width = 0;
		parent_sprite._drill_controller._drill_collision_height = 0;
		return;
	}
	if( this.bitmap.isReady() == false ){
		parent_sprite._drill_controller._drill_collision_width = 0;
		parent_sprite._drill_controller._drill_collision_height = 0;
		return;
	}
	
	// > 『贴图框架值归零』 - 不接受宽度为0的标记
	if( this._realFrame.width == 0  ){
		parent_sprite._drill_controller._drill_collision_width = 0;
		parent_sprite._drill_controller._drill_collision_height = 0;
		return;
	}
	if( this._realFrame.height == 0 ){
		parent_sprite._drill_controller._drill_collision_width = 0;
		parent_sprite._drill_controller._drill_collision_height = 0;
		return;
	}
	
	// > 刷新框架
	parent_sprite._drill_controller._drill_collision_width = this._realFrame.width;
	parent_sprite._drill_controller._drill_collision_height = this._realFrame.height;
};



//=============================================================================
// ** ☆DEBUG悬停范围
//
//			说明：	> 此模块专门管理 DEBUG悬停范围 显示功能。
//					> 注意，只显示。这个模块删掉也不会影响主功能。
//					（插件完整的功能目录去看看：功能结构树）
//=============================================================================
//==============================
// * DEBUG悬停范围 - 帧刷新
//==============================
var _drill_GBu_debugMap_update = Scene_Map.prototype.update;
Scene_Map.prototype.update = function() {
    _drill_GBu_debugMap_update.call(this);
    this.drill_GBu_updateDrawRangeSprite();		//帧刷新 - 初始化贴图
    this.drill_GBu_updateDrawRangeBitmap();		//帧刷新 - 绘制范围
}
//==============================
// * DEBUG悬停范围 - 帧刷新 初始化贴图
//==============================
Scene_Map.prototype.drill_GBu_updateDrawRangeSprite = function() {
	
	// > 功能关闭时
	if( $gameSystem._drill_GBu_DebugEnabled != true ){
		
		// > 销毁贴图
		if( this._drill_GBu_DebugSprite != undefined ){
			this._drill_GBu_DebugSprite.bitmap.clear();
			this._drill_GBu_DebugSprite.bitmap = null;
			this.removeChild(this._drill_GBu_DebugSprite);
			this._drill_GBu_DebugSprite = undefined;
		}
		
	// > 功能开启时
	}else{
		
		// > 创建贴图
		if( this._drill_GBu_DebugSprite == undefined ){
			var temp_bitmap = new Bitmap( Graphics.boxWidth, Graphics.boxHeight );
			var temp_sprite = new Sprite();
			temp_sprite.x = 0;
			temp_sprite.y = 0;
			temp_sprite.bitmap = temp_bitmap;
			this.addChild( temp_sprite );	//（直接加在最顶层的上面）
			this._drill_GBu_DebugSprite = temp_sprite;
		}
	}
}
//==============================
// * DEBUG悬停范围 - 帧刷新 绘制范围
//==============================
Scene_Map.prototype.drill_GBu_updateDrawRangeBitmap = function() {
	if( this._drill_GBu_DebugSprite == undefined ){ return; }
	
	// > 清空绘制
	var temp_bitmap = this._drill_GBu_DebugSprite.bitmap;
	temp_bitmap.clear();
	
	// > 控制器遍历
	for(var i = 0; i < $gameSystem._drill_GBu_dataTank_curController.length; i++ ){
		var controller = $gameSystem._drill_GBu_dataTank_curController[i];
		if( controller == undefined ){ continue; }
		if( controller.drill_controller_isVisible() == false ){ continue; }
		
		
		// > 判断悬停
		var is_hover = controller.drill_controller_isOnHover();
		
		
		// > 绘制 - 颜色标记
		var color_line = "rgb(100,180,225)";
		var color_line_pixel = "rgb(100,180,225,0.13)";
		var color_text = "rgb(100,180,225)";
		var color_background = "rgba(100,180,225,0.225)";
		if( is_hover == true ){
			color_line = "rgb(0,255,0)";
			color_line_pixel = "rgb(0,255,0,0.13)";
			color_text = "rgb(0,255,0)";
			color_background = "rgba(0,255,0,0.225)";
		}
		
		// > 绘制 - 获取矩形的四个顶点
		var point_list = controller.drill_controller_getRectPoint();
		if( point_list == null ){ continue; }
		
		// > 绘制 - 绘制凸多边形
		if( data['pixelHoverEnabled'] == true ){
			temp_bitmap.drill_GBu_drawPolygon( point_list, color_background, color_line_pixel, 24, "round" );
		}else{
			temp_bitmap.drill_GBu_drawPolygon( point_list, color_background, color_line, 2, "miter" );
		}
		
		// > 绘制 - ID编号
		var painter = temp_bitmap._context;
        painter.save();										//（a.存储上一个画笔状态）
        painter.font = temp_bitmap._makeFontNameText();		//（b.设置样式）
		painter.fillStyle = color_text;
		painter.strokeStyle = "rgba(0,0,0,0.7)";
		painter.lineWidth = 4;
		painter.lineJoin = 'round';
		painter.strokeText( String(i), 						//（c.路径填充/描边，fillText）
			point_list[0].x+10, point_list[0].y+30, 60 );
		painter.fillText( String(i), 				
			point_list[0].x+10, point_list[0].y+30, 60 );
		painter.restore();									//（d.回滚上一个画笔状态）
		
		// > 绘制 - 矩形中心点
		temp_bitmap.drawCircle( controller.drill_controller_finalTransform_x(), controller.drill_controller_finalTransform_y(), 9, color_line );
		temp_bitmap.drawCircle( controller.drill_controller_finalTransform_x(), controller.drill_controller_finalTransform_y(), 5, "#ff0000" );
	}
}
//==============================
// * DEBUG悬停范围 - 几何绘制 - 填充+描边多边形
//			
//			参数：	> fill_color 字符串   （填充颜色）
//					> stroke_color 字符串 （描边颜色）
//					> lineWidth 数字      （线宽）
//					> lineJoin 字符串     （连接处，包含miter/round/bevel 尖角/圆角/斜角，默认miter）
//			说明：	> 该函数不会对参数进行任何校验，绘制前一定要确保参数完整。
//					> 该函数包含多边形闭合处理。
//==============================
Bitmap.prototype.drill_GBu_drawPolygon = function( point_list, fill_color, stroke_color, lineWidth, lineJoin ){
    var painter = this._context;
    painter.save();						//（a.存储上一个画笔状态）
	
    painter.fillStyle = fill_color;		//（b.设置样式）
    painter.strokeStyle = stroke_color;
	painter.lineWidth = lineWidth;
	painter.lineJoin = lineJoin;
	
    painter.beginPath();				//（c.路径填充/描边，注意 beginPath + fill + stroke）
	painter.moveTo( point_list[0].x, point_list[0].y );
	for(var i = 1; i < point_list.length; i++ ){
		painter.lineTo( point_list[i].x, point_list[i].y );
	}
    painter.closePath();
	painter.fill();
	painter.stroke();
	
	painter.restore();					//（d.回滚上一个画笔状态）
    this._setDirty();
};


//=============================================================================
// * <<<<基于插件检测<<<<
//=============================================================================
}else{
		Imported.Drill_GaugeButton = false;
		var pluginTip = DrillUp.drill_GBu_getPluginTip_NoBasePlugin();
		alert( pluginTip );
}

